[
  {
    "root": "ءادم",
    "words": "آدم يآدم لآدم ويآدم"
  },
  {
    "root": "أبب",
    "words": "وأبا"
  },
  {
    "root": "أبد",
    "words": "أبدا"
  },
  {
    "root": "إبرهيم",
    "words": "إبرهم إبرهيم بإبرهيم يإبرهيم لإبرهيم وإبرهيم"
  },
  {
    "root": "أبق",
    "words": "أبق"
  },
  {
    "root": "أبل",
    "words": "الإبل أبابيل"
  },
  {
    "root": "أبو",
    "words": "آبائك آباءنا آباؤهم آباءكم ولأبويه أبواه آباؤكم لأبيه آبائهم آباؤنا أبويكم وآباؤكم يأبت أبويك أبينا أبانا أبيكم يأبانا أباهم آباءي أباه أبيهم أبوهم أبا أباكم أبى أبويه لآبائهم أبوهما أبوك وآباءهم آبائنا آباءهم وآباؤنا آبائهن آباء آبائكم لأبي وأبونا أوآباؤنا بآبائنا بآبائنا بأييكم وأبيه"
  },
  {
    "root": "أبي",
    "words": "أبى يأب وتأبى ويأبى فأبى فأبوا وأبى فأبين"
  },
  {
    "root": "أتي",
    "words": "فأتوا وأتوا يأتينكم وآتوا آتينا آتينكم يأتوكم وآتينا أوتوا نأت يأتي تأتينا آتينهم أوتي أتيت يأت وآتى تأتوا آتنا يأتيهم أوتوه يأتكم فأتوهن آتيتموهن آتيتم يؤت يؤتى يأتيكم وآتيه آتيه فأت يأتينك فآتت وتؤتوها تؤتي أوتيتم يؤتيه آتيتكم ويأتوكم نؤته فآتيهم آتيهم يأتينا أتوا وآتنا تؤتوا يأتين يأتينها وآتيتم فآتوهن وآتوهن أتين فآتوهم ويؤت يؤتون وآتينهم لآتينهم نؤتيه ولتأت تؤتونهن ويأت يؤتيهم والمؤتون سنؤتيهم وآتيكم يأتوك تؤتوه وآتينه آتيكم ويؤتون يأتوا تأتيهم أتيهم فتأتيهم أتيكم أتتكم ائتنا آتينها نؤتى لآت فآتهم فأتنا أتأتون لتأتون تأتنا آتيتك يأتهم آتينه تأتيكم آتيتنا آتيهما تأتهم يؤتكم يأتون سيؤتينا أتتهم أتوك ائت أتيها ائتوني آتيت وآتيني يأتيه وآتت يأتيكما تأتوني تؤتون لتأتنني آتوه يأتيني وأتوني آتيتني نأتي فأتونا نأتيكم ويأتيه وأتينك لآتية آتينك يأتيك أتى فأتى وأتيهم وإيتائ تأتي يأتيها وآت فليأتكم آتت يؤتين أتيا آتوني فأتت آتيني يأتوننا يأتك مأتيا لأوتين ويأتينا آتي أتيك آتية أوتيت فأتياه فلنأتينك ائتوا يأته أتتك أفتأتون فليأتنا أتينا وإيتاء آتوا أتينهم يؤتوا وآتوهم يأتونك فسيأتيهم فأتيا فيأتيهم سآتيكم وأوتينا ليأتيني وأوتيت آتين فلنأتينهم يأتوني آتيك أتوه أوتيته وتأتون وليأتينهم فآت لآتينا لآتوها نؤتها وآتين آتيتهن آتهم لتأتينكم تأتوننا وآتينهما فآتهم ائتيا وآتيهم فسيؤتيه أتت فليأتوا فليأت فآتينا فآتوا آتيها أوت فتأتون ويؤتوا"
  },
  {
    "root": "أثث",
    "words": "أثثا"
  },
  {
    "root": "أثر",
    "words": "آثرهم آثرك آثارهما نؤثرك أثري أثر آثر وآثرهم وآثارا أثرة ويؤثرون يؤثر وآثر تؤثرون فأثرن"
  },
  {
    "root": "أثل",
    "words": "وأثل"
  },
  {
    "root": "أثم",
    "words": "بالإثم إثم إثمه إثما وإثمهما أثيم آثم وإثما أثيما الإثم لإثم بإثمي وإثمك الآثمين والإثم أثاما الأثيم تأثيم تأثيما آثما"
  },
  {
    "root": "أجج",
    "words": "أجاج أجاجا"
  },
  {
    "root": "أجر",
    "words": "أجرهم أجره أجورهم أجر أجوركم أجورهن أجرا وأجر لأجرا أجري ولأجر استءجره استءجرت تأجرني أجرها وأجرا فأجره"
  },
  {
    "root": "أجل",
    "words": "أجلهن أجله أجل مؤجلا أجلا وأجل أجلنا أجلت أجلهم لأجل أجلها الأجلين الأجل"
  },
  {
    "root": "أحد",
    "words": "أحدهم أحد أحدكم إحديهما إحديهن أحدا أحدهما إحدى أحدكما أحدنا لأحدهما إحديهما كأحد لأحد لإحدى"
  },
  {
    "root": "أخذ",
    "words": "يؤخذ اتخذتم باتخاذكم فأخذتكم أخذنا خذوا أتتخذنا أتخذتم اتخذ واتخذوا يتخذ أخذته يؤاخذكم تأخذوا تتخذوا تأخذه فخذ بآخذيه تؤاخذنا فأخذهم أخذ وأخذتم ويتخذ أتأخذونه تأخذونه وأخذن متخذت فخذوهم وليأخذوا وخذوا لأتخذن واتخذ يتخذون يتخذوا فأخذتهم اتخذوا وأخذنا وأخذهم متخذي فخذوه اتخذوها اتخذوهم اتخذوني أتخذ فأخذنهم أخذنهم أتتخذ فيأخذكم تتخذون فخذها يأخذوا يتخذوه اتخذوه وأخذ أخذتهم يأخذون يأخذوه خذ أخذتم وخذوهم ويأخذ أخذت آخذ واتخذتموه وأخذت أخذه نتخذه ليأخذ نأخذ أفاتخذتم يأخذهم يؤاخذ اتخذي لاتخذوك لنتخذن أفتتخذونه متخذ يؤاخذهم فاتخذ تؤاخذني لتخذت يأخذ تتخذ فاتخذت خذها يأخذه تأخذ نتخذ لاتخذنه يتخذونك أخذتها فاتخذتموهم تأخذكم اتخذت وتتخذون فأخذنه ويتخذها أخذوا وأخذوا فاتخذوه ءأتخذ تأخذهم وخذ أتخذنهم ليأخذوه ليتخذ وأخذنهم خذوه اتخذها لتأخذوها يأخذونها تأخذونها آخذين فيؤخذ أخذة لأخذنا فاتخذه أخذا فأخذه"
  },
  {
    "root": "أخر",
    "words": "وبالآخرة الآخر بالآخرة الآخرة الآخرة أخر تأخر والآخرة والآخرة الأخرى وأخر وأخرى آخره أخريكم أخرتنا آخرين أخرى بآخرين آخران فآخران وآخرنا يستأخرون أخريهم لأخريهم وآخرين وآخرون وآخر أخرنا نؤخره ويؤخركم يؤخرهم يستأخرون المستخرين آخر وللآخرة أخرتن آخرون الآخرين تستخرون للآخرين والآخرين والآخر أخرتني يؤخر يتأخر وأخرت للآخرة"
  },
  {
    "root": "أخو",
    "words": "أخيه فإخونكم إخونا لإخونهم إخوة أخ أخت وأخوتكم الأخ الأخت الأختين وأخي أخي وإخونهم أختها أخاهم وأخاه لأخيه ولأخي وإخونكم وأخيه إخوتك وإخوته وأخوه بأخ أخانا أخاه أخوك إخوتي إخون يأخت أختك وأخوك إخونهن أخوتهن إخونكم أخوتكم أخوهم لأخته بأخيك أخا أخويكم وإخون إخونهم ولإخوننا"
  },
  {
    "root": "أدد",
    "words": "إدا"
  },
  {
    "root": "إدريس",
    "words": "إدريس وإدريس"
  },
  {
    "root": "أدي",
    "words": "وأداء فليؤد يؤده تؤدوا أدوا"
  },
  {
    "root": "إذ",
    "words": "وإذ إذ فإذ"
  },
  {
    "root": "إذا",
    "words": "وإذا إذا فإذا أءذا أئذا"
  },
  {
    "root": "أذن",
    "words": "آذانهم بإذن بإذنه فأذنوا فبإذن آذان والأذن بالأذن بإذني فأذن مؤذن آذن تأذن وأذن أذنت يستذنك ائذن أذن فاستذنوك استذنك ليؤذن يستذنونك إذنه يأذن يؤذن آذنتكم ليستذنكم فليستذنوا استذن يستذنوه استذنوك أذنيه ويستذن آذاننا آذنك وأذنت"
  },
  {
    "root": "أذي",
    "words": "أذى والأذى وأوذوا فآذوهما أوذينا يؤذون آذيتمونا أوذي أذيهم يؤذي تؤذوا يؤذين آذوا تؤذونني"
  },
  {
    "root": "أرب",
    "words": "مآرب الإربة"
  },
  {
    "root": "أرض",
    "words": "الأرض والأرض أرض أرضكم يأرض أرضا أرضنا أرضي أرضهم وأرضا وأرض وللأرض"
  },
  {
    "root": "أرك",
    "words": "الأرائك"
  },
  {
    "root": "إرم",
    "words": "إرم"
  },
  {
    "root": "أزر",
    "words": "أزري فآزره"
  },
  {
    "root": "أزز",
    "words": "تؤزهم أزا"
  },
  {
    "root": "أزف",
    "words": "الآزفة أزفت"
  },
  {
    "root": "إسحق",
    "words": "وإسحق إسحق بإسحق"
  },
  {
    "root": "أسر",
    "words": "أسرى الأسرى وتأسرون وأسيرا أسرهم"
  },
  {
    "root": "إسرءيل",
    "words": "إسرءيل وإسرءيل"
  },
  {
    "root": "أسس",
    "words": "أسس"
  },
  {
    "root": "أسف",
    "words": "أسفا يأسفى آسفونا"
  },
  {
    "root": "إسمعيل",
    "words": "وإسمعيل إسمعيل"
  },
  {
    "root": "أسن",
    "words": "آسن"
  },
  {
    "root": "أسو",
    "words": "أسوة"
  },
  {
    "root": "أسي",
    "words": "تأس آسى تأسوا"
  },
  {
    "root": "أصر",
    "words": "إصرا إصري إصرهم"
  },
  {
    "root": "أصل",
    "words": "والآصال أصلها وأصيلا أصل أصولها"
  },
  {
    "root": "أفف",
    "words": "أف"
  },
  {
    "root": "أفك",
    "words": "يؤفكون تؤفكون يأفكون والمؤتفكت بالإفك إفك أفاك إفكا أئفكا إفكهم يؤفك لتأفكنا أفك والمؤتفكة"
  },
  {
    "root": "أفل",
    "words": "أفل الآفلين أفلت"
  },
  {
    "root": "أكل",
    "words": "وكلا كلوا فكلوا يأكلون وكلوا تأكلوا لتأكلوا أكلها تأكلون تأكله فكلوه تأكلوها فليأكل وأكلهم أكل أكلون لأكلوا يأكلان نأكل أكله فكلا تأكل ليأكلون يأكل يأكله فأكله فتأكل يأكلهن يأكلن الأكل يأكلوا كلي فكلي فأكلا للآكلين ليأكلوا لآكلون ويأكلون وتأكلون أكلا مأكول"
  },
  {
    "root": "ألا",
    "words": "ألا"
  },
  {
    "root": "إلا",
    "words": "إلا ألا"
  },
  {
    "root": "ألت",
    "words": "ألتنهم"
  },
  {
    "root": "ألف",
    "words": "ألف ألوف فألف آلف بألف وألف ألفت ألفا ألفين والمؤلفة كألف يؤلف لإيلف إلفهم"
  },
  {
    "root": "ألك",
    "words": "للملئكة الملئكة وملئكته الملكين والملئكة ملك ملكا ملكين بالملئكة ملئكة والملك"
  },
  {
    "root": "ألل",
    "words": "آل وآل"
  },
  {
    "root": "ألم",
    "words": "أليم أليما تألمون يألمون الأليم"
  },
  {
    "root": "أله",
    "words": "إلهك وإله إلها وإلهكم إله إلهين آلهة وآلهتك آلهتنا آلهتهم إلهكم آلهتي آلهتكم بآلهتنا فإلهكم إلهه أءله وإلهنا الآلهة ءألهتنا"
  },
  {
    "root": "ألو",
    "words": "يؤلون يألونكم يأتل"
  },
  {
    "root": "ألي",
    "words": "آلاء"
  },
  {
    "root": "إلى",
    "words": "إليك إلى إليه إلينا وإلى وإليه إليكم وإليك إليهم لإلى إليها فإلينا إليهن فإليه وإلينا إليكما"
  },
  {
    "root": "إلياس",
    "words": "وإلياس إلياس إل ياسين"
  },
  {
    "root": "أم",
    "words": "أم من أمن"
  },
  {
    "root": "أما",
    "words": "فأما وأما أما"
  },
  {
    "root": "أمد",
    "words": "أمدا الأمد"
  },
  {
    "root": "أمر",
    "words": "أمر أتأمرون يأمركم تؤمرون بأمره أمرا الأمر الأمور أمركم ويأمركم وأمره يأمرون أيأمركم ويأمرون تأمرون أمرنا أمروا ولآمرنهم أمره أمرتني أمرت وأمرنا أمرهم أمرتك يأمر والأمر وأمر يأمرهم لأمر الآمرون وأمرت تأمرك بأمرهم آمره لأمارة تؤمر يؤمرون إمرا أمري بأمر بأمرنا وأمروا أمرتهم تأمرنا تأمرين يأتمرون تأمروننا تأمروني أمرها وأمرهم تأمرهم وأتمروا"
  },
  {
    "root": "أمل",
    "words": "الأمل أملا"
  },
  {
    "root": "أمم",
    "words": "أميون إماما أمة أم والأمين الأمين فلأمه أمهتكم وأمهتكم وأمهت آمين وأمه وأمي أمم الأمي أمما أئمة وأمم لبإمام بإممهم أمك أمتكم أمه أمها أمهتهم الأمم إمام أمامه فأمه"
  },
  {
    "root": "أمن",
    "words": "يؤمنون آمنا بمؤمنين آمنوا آمن أنؤمن وآمنوا نؤمن يؤمنوا أفتؤمنون مؤمنين إيمنكم للمؤمنين بالإيمن وأمنا آمنتم وليؤمنوا أمنتم يؤمن مؤمنة مؤمن المؤمنين ويؤمن تؤمن أمن اؤتمن أمنته والمؤمنون المؤمنون تؤمنوا تأمنه لتؤمنن إيمنهم وتؤمنون أمنة للإيمن إيمنا فآمنوا فآمنا المؤمنت بإيمنكم الأمنت تؤمنون الأمن يأمنوكم ويأمنوا لمؤمن مؤمنا وآمنتم ليؤمنن بالمؤمنين مؤمنون بالأمن ليؤمنوا إيمنها آمنت أمين أفأمن أوأمن أفأمنوا يأمن لنؤمنن أمنتكم وبالمؤمنين مأمنه الإيمن والمؤمنت بإيمنهم لآمن تأمنا بمؤمن آمنكم آمنين وللمؤمنين إيمنه آمنة أفأمنتم فليؤمن وآمن فيؤمنوا لأمنتهم للمؤمنت أمنا الأمين آمنون الآمنين فآمن والإيمن والمؤمنين الأمانة ويؤمنون فآمن لتؤمنوا مؤمنت بإيمن المؤمن بإيمنهن فآمنت ءأمنتم مأمون وآمنهم"
  },
  {
    "root": "أمو",
    "words": "ولأمة وإمائكم"
  },
  {
    "root": "أن",
    "words": "أن أنه أنهم وأنهم وأنى بأنهم كأنهم لئلا وأن بأن أنكم ألا أنى بأنا أنما أنا كأن فكأنما أنهما بأننا فأنه فأنى أنها أننا كأنما كأنه كأنك وأنه فأن أنك وأنك وأنكم كأنها كأنهن لأن بأنه بأنكم وأنا"
  },
  {
    "root": "إن",
    "words": "إن إنما إنهم إنا وإن فإن إني إنك إنه فإما وإنها إنكم إنها وإنا فإنه فإنما وإنه فإني وإنك إننا وإني فإنهم أفإين وإنما فإنا فإنكم فإنها فإنك أئنكم وإنني وإنهم وإما إنني إما وإنكم فإلم وإلا وإننا أءنك أءنا إنهن وإنهما أئن إنهما"
  },
  {
    "root": "أنا",
    "words": "وأنا أنا فأنا"
  },
  {
    "root": "أنام",
    "words": "للأنام"
  },
  {
    "root": "أنت",
    "words": "أنت وأنت ءأنت أفأنت لأنت فأنت"
  },
  {
    "root": "أنتم",
    "words": "وأنتم أنتم ءأنتم هأنتم أفأنتم فأنتم لأنتم"
  },
  {
    "root": "أنتما",
    "words": "أنتما"
  },
  {
    "root": "أنث",
    "words": "والأنثى بالأنثى أنثى كالأنثى الأنثيين إنثا وإنثا وأنثى الأنثى"
  },
  {
    "root": "إنجيل",
    "words": "والإنجيل الإنجيل"
  },
  {
    "root": "أنس",
    "words": "أناس آنستم الإنسن الإنس والإنس للإنسن إنسن إنسيا آنست تستأنسوا وأناسي آنس مستءنسين إنس"
  },
  {
    "root": "أنف",
    "words": "والأنف بالأنف آنفا"
  },
  {
    "root": "أنى",
    "words": "أنى وأنى"
  },
  {
    "root": "أني",
    "words": "آناء آنائ إنه آن يأن بآنية آنية"
  },
  {
    "root": "أهل",
    "words": "أهل أهله يأهل أهلك أهلهن أهلها أهليكم وأهلها وأهله لأهل وأهلك أهلي بأهلك أهلهم أهلنا وأهلنا بأهلكم لأهله وأهلي بأهله وأهليهم وأهلونا أهليهم وأهليكم وأهل"
  },
  {
    "root": "أو",
    "words": "أو"
  },
  {
    "root": "أوب",
    "words": "المآب مآب للأوبين أوبي أواب مآب مآبا إيابهم"
  },
  {
    "root": "أود",
    "words": "يوده"
  },
  {
    "root": "أول",
    "words": "أول تأويله تأويلا لأولنا الأولين لأوليهم أوليهم الأولون تأويل بتأويله بتأويل أوليهما الأولى بآل الأول والأولى لأول والأولين"
  },
  {
    "root": "أولأ",
    "words": "أولئك وأولئك هؤلاء فأولئك أولاء وأولئكم أهؤلاء أولئكم"
  },
  {
    "root": "أولو",
    "words": "أولو يأولي أولوا لأولي وأولوا وأولي أولى وأولت أولت"
  },
  {
    "root": "أون",
    "words": "الن فالن آلن"
  },
  {
    "root": "أوه",
    "words": "لأوه أوه"
  },
  {
    "root": "أوي",
    "words": "ومأويهم ومأويه مأويهم فآويكم آووا سآوي آوى أوى فأوا أوينا وآوينهما ومأويكم المأوى فمأويهم وتؤي مأويكم تؤيه فآوى"
  },
  {
    "root": "أي",
    "words": "أيهم أي فأي فبأي أيكم أيا أينا أيما بأي لأي"
  },
  {
    "root": "إي",
    "words": "إي"
  },
  {
    "root": "إيا",
    "words": "إياك وإياك وإيي إياه وإياكم وإياهم إيانا فإيي إياكم"
  },
  {
    "root": "أيد",
    "words": "وأيدنه يؤيد أيدتك وأيدكم أيدك وأيده الأيد بأييد وأيدهم فأيدنا"
  },
  {
    "root": "أيك",
    "words": "الأيكة ليكة"
  },
  {
    "root": "أيم",
    "words": "الأيمى"
  },
  {
    "root": "أين",
    "words": "الن فأينما أين فالن أينما أيان آلن الآن فأين"
  },
  {
    "root": "أيها",
    "words": "يأيها أيها أيتها أيه يأيه يأيتها"
  },
  {
    "root": "أيوب",
    "words": "وأيوب أيوب"
  },
  {
    "root": "أيي",
    "words": "بآيتنا بآيتي بآيت آيته آيت آية الآيت آيتك آيتنا لآيت لآية بآية وآية بآيته آيتي وآيته آياتنا الآيت لآيت آيتين بالآيت آيتها بآيتنا بآيت لآيتنا الآية"
  },
  {
    "root": "اضطر",
    "words": "أضطره اضطر اضطررتم نضطرهم المضطر"
  },
  {
    "root": "الذي",
    "words": "الذي التي بالذي كالذي للذي وبالذي والتي والذان بالتي والذي كالتي للتي الي والي وللذين"
  },
  {
    "root": "الذين",
    "words": "الذين والذين للذين كالذين بالذين فالذين"
  },
  {
    "root": "الر",
    "words": "الر"
  },
  {
    "root": "الله",
    "words": "الله لله بالله والله فالله ولله اللهم فلله أبالله آلله تالله وتالله"
  },
  {
    "root": "الم",
    "words": "الم"
  },
  {
    "root": "المر",
    "words": "المر"
  },
  {
    "root": "المص",
    "words": "المص"
  },
  {
    "root": "اليسع",
    "words": "واليسع"
  },
  {
    "root": "بأر",
    "words": "وبئر"
  },
  {
    "root": "بأس",
    "words": "بئسما ولبئس وبئس البأساء البأس فبئس بأس بأسا لبئس بالبأساء بأسنا بأسه بيس تبتئس بئس فلبئس بأسكم البائس بأسهم"
  },
  {
    "root": "بابل",
    "words": "ببابل"
  },
  {
    "root": "بتر",
    "words": "الأبتر"
  },
  {
    "root": "بتك",
    "words": "فليبتكن"
  },
  {
    "root": "بتل",
    "words": "وتبتل تبتيلا"
  },
  {
    "root": "بثث",
    "words": "وبث بثي بث يبث منبثا مبثوثة المبثوث"
  },
  {
    "root": "بجس",
    "words": "فانبجست"
  },
  {
    "root": "بحث",
    "words": "يبحث"
  },
  {
    "root": "بحر",
    "words": "البحر بحيرة والبحر البحرين بحر أبحر البحران البحار"
  },
  {
    "root": "بخس",
    "words": "يبخس تبخسوا يبخسون بخس بخسا"
  },
  {
    "root": "بخع",
    "words": "بخع"
  },
  {
    "root": "بخل",
    "words": "يبخلون بخلوا بالبخل تبخلوا يبخل بخل"
  },
  {
    "root": "بدأ",
    "words": "بدأكم بدءوكم يبدؤا فبدأ بدأنا يبدئ بدأ وبدأ"
  },
  {
    "root": "بدر",
    "words": "ببدر وبدارا"
  },
  {
    "root": "بدع",
    "words": "بديع بدعا ابتدعوها"
  },
  {
    "root": "بدل",
    "words": "فبدل أتستبدلون يتبدل بدله يبدلونه يبدل تتبدلوا استبدال بدلنهم مبدل بدلنا ويستبدل أبدله تبديل بدلوا تبدل بدلا يبدلهما وليبدلنهم بدل تبديلا وبدلنهم يستبدل يبدلوا نبدل يبدله يبدلنا"
  },
  {
    "root": "بدن",
    "words": "ببدنك والبدن"
  },
  {
    "root": "بدو",
    "words": "تبدون تبدوا تبدوه بدت يبدون تبد بدا تبدونها ليبدي بادي يبدها البدو فبدت والباد يبدين لتبدي بادون مبديه وبدا"
  },
  {
    "root": "بذر",
    "words": "تبذر تبذيرا المبذرين"
  },
  {
    "root": "برأ",
    "words": "بارئكم تبرأ فنتبرأ تبرءوا وأبرئ بريا وتبرئ بري براءة بريون أبرئ مبرءون تبرأنا فبرأه براء نبرأها البارئ برءؤا البرية"
  },
  {
    "root": "برج",
    "words": "بروج بروجا متبرجت تبرجن تبرج البروج"
  },
  {
    "root": "برح",
    "words": "أبرح نبرح"
  },
  {
    "root": "برد",
    "words": "بردا برد بارد"
  },
  {
    "root": "برر",
    "words": "بالبر البر تبروا الأبرار للأبرار وبرا تبروهم بررة"
  },
  {
    "root": "برز",
    "words": "برزوا لبرز وبرزوا بارزة وبرزت برزون"
  },
  {
    "root": "برزخ",
    "words": "برزخ برزخا"
  },
  {
    "root": "برص",
    "words": "والأبرص"
  },
  {
    "root": "برق",
    "words": "وبرق البرق وإستبرق برقه إستبرق وأباريق برق"
  },
  {
    "root": "برك",
    "words": "مباركا مبارك تبارك بركت بركنا وبركت وبركته فتبارك مبركة بورك المبركة وبركنا مبرك وبرك وتبارك مبركا تبرك"
  },
  {
    "root": "برم",
    "words": "أبرموا مبرمون"
  },
  {
    "root": "برهن",
    "words": "برهنكم برهن برهنان"
  },
  {
    "root": "بزغ",
    "words": "بازغا بازغة"
  },
  {
    "root": "بسر",
    "words": "وبسر باسرة"
  },
  {
    "root": "بسس",
    "words": "وبست بسا"
  },
  {
    "root": "بسط",
    "words": "ويبصط بسطة يبسطوا بسطت بباسط مبسوطتان باسطوا بصطة كبسط يبسط تبسطها البسط بسط فيبسطه ويبسطوا بساطا"
  },
  {
    "root": "بسق",
    "words": "باسقت"
  },
  {
    "root": "بسل",
    "words": "تبسل أبسلوا"
  },
  {
    "root": "بسم",
    "words": "فتبسم"
  },
  {
    "root": "بشر",
    "words": "وبشر وبشرى بشيرا بشروهن تبشروهن مبشرين فبشرهم يبشرك بشر لبشر بشرى ويستبشرون يستبشرون بشير بشرا وبشير يبشرهم فاستبشروا البشرى بالبشرى فبشرنها يبشرى البشير نبشرك أبشرتموني تبشرون بشرنك ويبشر مبشرا البشر لتبشر لبشرين مبشرت فبشره ومبشرا فبشرنه وبشرنه فبشر وأبشروا يبشر وبشروه أبشرا بشريكم أبشر للبشر مستبشرة"
  },
  {
    "root": "بصر",
    "words": "أبصرهم يبصرون وأبصرهم بصير الأبصر بصيرا وأبصركم والبصير بصائر أبصر مبصرون والأبصر مبصرا بصيرة أبصرنا البصر البصير مبصرة والبصر وأبصر يبصر بصرت يبصروا تبصرون أبصرهن بالأبصر فبصرت مستبصرين أبصركم بصئر بصره وأبصرا تبصرة فبصرك بالبصر فستبصر ويبصرون بأبصرهم يبصرونهم أبصرها"
  },
  {
    "root": "بصل",
    "words": "وبصلها"
  },
  {
    "root": "بضع",
    "words": "بضعة بضع بضعتهم بضعتنا ببضعة"
  },
  {
    "root": "بطأ",
    "words": "ليبطئن"
  },
  {
    "root": "بطر",
    "words": "بطرا بطرت"
  },
  {
    "root": "بطش",
    "words": "يبطشون بطشتم يبطش بطشا نبطش البطشة بطشتنا بطش"
  },
  {
    "root": "بطل",
    "words": "بالبطل تبطلوا بطلا وبطل المبطلون ويبطل البطل سيبطله والبطل أفبالبطل مبطلون"
  },
  {
    "root": "بطن",
    "words": "بطونهم بطني بطانة وباطنه بطون بطن بطونه بطونها بطنه وباطنة البطون ببطن بطائنها والباطن باطنه"
  },
  {
    "root": "بعث",
    "words": "بعثنكم وابعث فبعث ابعث بعث بعثه فابعثوا وبعثنا بمبعوثين يبعثهم يبعثكم يبعث يبعثون بعثنا ليبعثن انبعاثهم مبعوثون نبعث لمبعوثون يبعثك أبعث بعثنهم البعث تبعثون لبعثنا بعثكم يبعثوا لتبعثن انبعث"
  },
  {
    "root": "بعثر",
    "words": "بعثرت بعثر"
  },
  {
    "root": "بعد",
    "words": "بعد بعده بعدي بعيد بعدهم بعيدا بعدكم بعدها بعدت بعدا ببعيد البعيد بعدك مبعدون فبعدا بعدهن"
  },
  {
    "root": "بعر",
    "words": "بعير"
  },
  {
    "root": "بعض",
    "words": "بعوضة بعضكم لبعض ببعضها بعضهم بعض ببعض بعضا بعضها بعضنا بعضه"
  },
  {
    "root": "بعل",
    "words": "وبعولتهن بعلها بعلي لبعولتهن بعولتهن بعلا"
  },
  {
    "root": "بغت",
    "words": "بغتة"
  },
  {
    "root": "بغض",
    "words": "البغضاء والبغضاء"
  },
  {
    "root": "بغل",
    "words": "والبغال"
  },
  {
    "root": "بغي",
    "words": "بغيا باغ وابتغوا تبتغوا ابتغاء وابتغاء يبغون يبتغ تبغونها تبغوا تبتغون أيبتغون يبتغون تبتغي أبتغي ببغيهم أبغي والبغي ويبغونها وتبغونها أبغيكم يبغونكم ابتغوا بغيكم نبغي ولتبتغوا لتبتغوا لابتغوا وابتغ نبغ ينبغي بغى ابتغى البغاء نبتغي فبغى تبغ فابتغوا وابتغاؤكم ابتغيت ليبغي لبغوا البغي ويبغون بغت تبغي يبغيان"
  },
  {
    "root": "بقر",
    "words": "بقرة البقر بقرت"
  },
  {
    "root": "بقع",
    "words": "البقعة"
  },
  {
    "root": "بقل",
    "words": "بقلها"
  },
  {
    "root": "بقي",
    "words": "وبقية بقي بقية باق والبقيت وأبقى الباقين باقية أبقى ويبقى تبقي"
  },
  {
    "root": "بكر",
    "words": "بكر والإبكر بكرة أبكارا وأبكارا"
  },
  {
    "root": "بكك",
    "words": "ببكة"
  },
  {
    "root": "بكم",
    "words": "بكم وبكم البكم أبكم وبكما"
  },
  {
    "root": "بكي",
    "words": "وليبكوا يبكون وبكيا بكت وأبكى تبكون"
  },
  {
    "root": "بل",
    "words": "بل"
  },
  {
    "root": "بلد",
    "words": "بلدا البلد لبلد والبلد بلد بلدة البلدة"
  },
  {
    "root": "بلس",
    "words": "إبليس مبلسون يإبليس يبلس لمبلسين"
  },
  {
    "root": "بلع",
    "words": "ابلعي"
  },
  {
    "root": "بلغ",
    "words": "يبلغ فبلغن بلغن البلغ بلغني بلغوا بليغا بلغ بلغت وبلغنا البلغة أبلغكم أبلغتكم بلغوه أبلغه ليبلغ ببلغه بلغيه يبلغن تبلغ أبلغ بلغا يبلغا لبلغا لتبلغوا يبلغوا وبلغت يبلغون ببلغيه ولتبلغوا وبلغ وأبلغكم مبلغهم بلغة أبلغوا"
  },
  {
    "root": "بلو",
    "words": "بلاء ابتلى ولنبلونكم مبتليكم ليبتليكم وليبتلي لتبلون وابتلوا ليبلوكم ليبلونكم نبلوهم وبلونهم وليبلي تبلوا يبلوكم لنبلوهم ونبلوكم لمبتلين ليبلوني البلؤا بلؤا ليبلوا ونبلوا بلونهم بلونا نبتليه تبلى ابتليه"
  },
  {
    "root": "بلى",
    "words": "بلى"
  },
  {
    "root": "بلي",
    "words": "يبلى"
  },
  {
    "root": "بنن",
    "words": "بنان بنانه"
  },
  {
    "root": "بنو",
    "words": "بناء يبني أبناءكم بني ابن بنيه لبنيه أبناءهم وابن وأبنائنا والبنين أبناءنا وأبناءكم لبني وأبناؤكم وبناتكم وبنات أبنائكم أبنؤا ابني بنين وبنت ببني بنينه بنينهم بنوا ابنه بناتي بناتك ابنك وبني البنت وبنين بالبنين ابنوا بنينا والبنون يبنؤم وابنها أبنائهن أبناء بنون أتبنون ابنتي لابنه وبناتك البنات البنون البنين مبنية بنات بنينها ابنت ببنيه وبنينا بنيها وبنيه"
  },
  {
    "root": "بهت",
    "words": "فبهت بهتنا فتبهتهم بهتن ببهتن"
  },
  {
    "root": "بهج",
    "words": "بهيج بهجة"
  },
  {
    "root": "بهل",
    "words": "نبتهل"
  },
  {
    "root": "بهم",
    "words": "بهيمة"
  },
  {
    "root": "بوأ",
    "words": "وباءو فباءو تبوئ باء وبوأكم تبوءا بوأنا مبوأ يتبوأ لنبوئنهم نتبوأ تبوءو"
  },
  {
    "root": "بوب",
    "words": "الباب أبوبها أبوب الأبوب باب بابا أبوبا"
  },
  {
    "root": "بور",
    "words": "البوار بورا يبور تبور"
  },
  {
    "root": "بول",
    "words": "بال بالهم"
  },
  {
    "root": "بي",
    "words": "بهم به بكم بها بهما بي بك وبما بهن وبه بنا فبم بم"
  },
  {
    "root": "بيت",
    "words": "البيت بيتي البيوت بيوتكم بيت يبيتون بيته بيتا بيوتا بيتك بيتها بالبيت بيوت لنبيتنه بيوتهم لبيت بيوتنا بيوتكن لبيوتهم ولبيوتهم والبيت بيوتهن"
  },
  {
    "root": "بيد",
    "words": "تبيد"
  },
  {
    "root": "بيض",
    "words": "الأبيض تبيض ابيضت بيضاء وابيضت بيض"
  },
  {
    "root": "بيع",
    "words": "بيع البيع تبايعتم ببيعكم بايعتم وبيع يبايعونك يبايعون يبايعنك فبايعهن"
  },
  {
    "root": "بين",
    "words": "بين يبين البينت بالبينت بينت تبين بينهم بينا بينه وبينوا مبين وبينت يتبين بينكم بينة ويبين يبينها بينها وبينه بيننا وبينكم بيان لتبيننه مبينة مبينا ليبين بينهما وبينهم فتبينوا وبين نبين المبين بيني ولتستبين ولنبينه وبينهما ببينة وتبين لتبين تبينا وليبينن بينك وبينك لنبين مبينت تبينت المستبين ولأبين البيان بينهن بيانه البينة"
  },
  {
    "root": "تابوت",
    "words": "التابوت"
  },
  {
    "root": "تبب",
    "words": "تتبيب تباب تبت وتب"
  },
  {
    "root": "تبر",
    "words": "متبر وليتبروا تتبيرا تبرنا تبارا"
  },
  {
    "root": "تبع",
    "words": "تبع واتبعوا تتبع اتبعت يتبع تبعوا بتابع اتبعوا تتبعوا نتبع فاتباع يتبعون يتبعها فيتبعون اتبعن فاتبعوني واتبعنا اتبعوك اتبعوه فاتبعوا اتبع لاتبعنكم لاتبعتم متتابعين ويتبع واتبع اتباع أتبع تتبعون فاتبعوه تبعك اتبعتم واتبعوه فأتبعه يتبعوكم اتبعك لاتبعوك اتبعوهم تتبعان فأتبعهم وأتبعوا واتبعت اتبعني تبعا تبعني ونتبع تبيعا أتبعك اتبعتني فأتبع فاتبعني تتبعن فنتبع فأتبعنا التبعين متبعون فأتبعوهم واتبعك يتبعهم اتبعكما وأتبعنهم أتبعه اتبعون واتبعون فاتبعها نتبعكم تتبعونا واتبعتهم نتبعه فاتبع نتبعهم تتبعها"
  },
  {
    "root": "تجر",
    "words": "تجرتهم تجرة وتجرة التجرة"
  },
  {
    "root": "تحت",
    "words": "تحتها تحت تحتهم تحته تحتك تحتي"
  },
  {
    "root": "ترب",
    "words": "تراب تربا التراب ترابا أتراب أترابا والترائب متربة"
  },
  {
    "root": "ترف",
    "words": "أترفوا مترفيها أترفتم وأترفنهم مترفيهم مترفوها مترفين"
  },
  {
    "root": "ترك",
    "words": "وتركهم ترك فتركه تركوا تركن تركتم وتركتم تتركه تتركوا تارك بتاركي نترك وتركنا تركت أتتركون يتركوا تركنا لتاركوا واترك تركنها تركتموها وتركوك يترك"
  },
  {
    "root": "تسع",
    "words": "تسع تسعا تسعة وتسعون"
  },
  {
    "root": "تعس",
    "words": "فتعسا"
  },
  {
    "root": "تفث",
    "words": "تفثهم"
  },
  {
    "root": "تقن",
    "words": "أتقن"
  },
  {
    "root": "تلل",
    "words": "وتله"
  },
  {
    "root": "تلو",
    "words": "تتلون تتلوا يتلون يتلونه تلاوته يتلوا نتلوها نتلوه فاتلوها تتلى يتلى واتل أتل تليت تلوته ويتلوه لتتلوا سأتلوا أتلوا نتلوا اتل فالتليت تليها"
  },
  {
    "root": "تمم",
    "words": "فأتمهن ولأتم أتموا وأتموا يتم وأتممت وليتم وتمت تماما وأتممنها فتم فأتموا ويتم أتمها أتممت متم أتمم"
  },
  {
    "root": "تنور",
    "words": "التنور"
  },
  {
    "root": "توب",
    "words": "فتاب التواب فتوبوا وتب تابوا أتوب التوبين تبتم توبتهم يتوب تابا توابا التوبة يتوبون تبت ويتوب توبة تاب يتوبوا التئبون ليتوبوا توبوا متاب تواب وتوبوا متابا التوب يتب وتاب تتوبا تئبت"
  },
  {
    "root": "تور",
    "words": "تارة تترا"
  },
  {
    "root": "تين",
    "words": "والتين"
  },
  {
    "root": "تيه",
    "words": "يتيهون"
  },
  {
    "root": "ثبت",
    "words": "وثبت وتثبيتا تثبيتا ثبات ويثبت فثبتوا ليثبتوك فاثبتوا نثبت ثابت يثبت الثابت ثبوتها ليثبت ثبتنك لنثبت"
  },
  {
    "root": "ثبر",
    "words": "مثبورا ثبورا"
  },
  {
    "root": "ثبط",
    "words": "فثبطهم"
  },
  {
    "root": "ثجج",
    "words": "ثجاجا"
  },
  {
    "root": "ثخن",
    "words": "يثخن أثخنتموهم"
  },
  {
    "root": "ثرب",
    "words": "تثريب"
  },
  {
    "root": "ثري",
    "words": "الثرى"
  },
  {
    "root": "ثعب",
    "words": "ثعبان"
  },
  {
    "root": "ثقب",
    "words": "ثاقب الثاقب"
  },
  {
    "root": "ثقف",
    "words": "ثقفتموهم ثقفوا تثقفنهم يثقفوكم"
  },
  {
    "root": "ثقل",
    "words": "مثقال ثقلت ثقالا أثقلت اثاقلتم وثقالا الثقال أثقالكم أثقالهم وأثقالا مثقلة مثقلون الثقلان ثقيلا أثقالها"
  },
  {
    "root": "ثلث",
    "words": "ثلثة بثلثة وثلث ثلثا الثلث الثلثان ثالث ثلثين الثلثة ثلث بثالث ثلثون الثالثة ثلثي وثلثه"
  },
  {
    "root": "ثلل",
    "words": "ثلة وثلة"
  },
  {
    "root": "ثم",
    "words": "ثم أثم"
  },
  {
    "root": "ثمر",
    "words": "الثمرت ثمرة والثمرت ثمره أثمر ثمرت ثمر بثمره"
  },
  {
    "root": "ثمن",
    "words": "ثمنا الثمن ثمنية بثمن وثامنهم ثمنين ثمني وثمنية"
  },
  {
    "root": "ثمود",
    "words": "ثمود وثمود ثمودا لثمود وثمودا"
  },
  {
    "root": "ثني",
    "words": "اثنتا مثنى اثنتين اثني اثنان اثنين اثنتي اثنا ثاني يثنون المثاني مثاني يستثنون"
  },
  {
    "root": "ثوب",
    "words": "لمثوبة مثابة ثواب فأثبكم ثوابا الثواب مثوبة فأثبهم ثيابهم ثيابا ثياب ثيابكم ثيابهن وأثبهم وثيابك ثوب"
  },
  {
    "root": "ثور",
    "words": "تثير وأثاروا فتثير"
  },
  {
    "root": "ثوي",
    "words": "مثوى مثويكم مثويه مثواي ثاويا ومثويكم"
  },
  {
    "root": "جالوت",
    "words": "بجالوت لجالوت جالوت"
  },
  {
    "root": "جبب",
    "words": "الجب"
  },
  {
    "root": "جبت",
    "words": "بالجبت"
  },
  {
    "root": "جبر",
    "words": "جبارين جبار جبارا بجبار الجبار"
  },
  {
    "root": "جبريل",
    "words": "لجبريل وجبريل"
  },
  {
    "root": "جبل",
    "words": "جبل الجبال الجبل للجبل كالجبال والجبال جبال والجبلة يجبال جبلا"
  },
  {
    "root": "جبن",
    "words": "للجبين"
  },
  {
    "root": "جبه",
    "words": "جباههم"
  },
  {
    "root": "جبي",
    "words": "يجتبي واجتبينهم اجتبيتها يجتبيك اجتبه واجتبينا اجتبيكم يجبى كالجواب فاجتبه"
  },
  {
    "root": "جثث",
    "words": "اجتثت"
  },
  {
    "root": "جثم",
    "words": "جثمين"
  },
  {
    "root": "جثو",
    "words": "جثيا جاثية"
  },
  {
    "root": "جحد",
    "words": "يجحدون جحدوا وجحدوا يجحد"
  },
  {
    "root": "جحم",
    "words": "الجحيم جحيم وجحيما"
  },
  {
    "root": "جدث",
    "words": "الأجداث"
  },
  {
    "root": "جدد",
    "words": "جديد جديدا جدد جد"
  },
  {
    "root": "جدر",
    "words": "وأجدر جدارا الجدار جدر"
  },
  {
    "root": "جدل",
    "words": "جدال تجدل جدلتم يجدل يجدلونك ليجدلوكم أتجدلونني جدلتنا جدلنا يجدلنا يجدلون وجدلهم جدلا ويجدل جدلوك تجدلوا وجدلوا تجدلك"
  },
  {
    "root": "جذذ",
    "words": "مجذوذ جذذا"
  },
  {
    "root": "جذع",
    "words": "جذع بجذع جذوع"
  },
  {
    "root": "جذو",
    "words": "جذوة"
  },
  {
    "root": "جرح",
    "words": "الجوارح والجروح جرحتم اجترحوا"
  },
  {
    "root": "جرد",
    "words": "والجراد جراد"
  },
  {
    "root": "جرر",
    "words": "يجره"
  },
  {
    "root": "جرز",
    "words": "جرزا الجرز"
  },
  {
    "root": "جرع",
    "words": "يتجرعه"
  },
  {
    "root": "جرف",
    "words": "جرف"
  },
  {
    "root": "جرم",
    "words": "يجرمنكم المجرمين مجرميها أجرموا مجرمين المجرمون جرم إجرامي تجرمون مجرما للمجرمين أجرمنا بالمجرمين مجرمون كالمجرمين المجرم"
  },
  {
    "root": "جرى",
    "words": "تجري وجرين مجريها يجري لتجري ولتجري الجوار فالجريت تجريان الجارية جارية"
  },
  {
    "root": "جزأ",
    "words": "جزءا جزء"
  },
  {
    "root": "جزع",
    "words": "أجزعنا جزوعا"
  },
  {
    "root": "جزي",
    "words": "تجزى جزاء جزاؤهم وسيجزي وسنجزي فجزاؤه يجز جزؤا فجزاء نجزي تجزون سيجزون سيجزيهم جزينهم سنجزي يجزى يجزون الجزية ليجزيهم ليجزي جزؤه ولنجزين ولنجزينهم جزاؤكم لتجزى نجزيه جزيتهم ليجزيك جاز ويجزيهم وجزؤا ولتجزى ويجزي يجزيه الجزاء وجزيهم"
  },
  {
    "root": "جسد",
    "words": "جسدا"
  },
  {
    "root": "جسس",
    "words": "تجسسوا"
  },
  {
    "root": "جسم",
    "words": "والجسم أجسامهم"
  },
  {
    "root": "جعل",
    "words": "يجعلون جعل تجعلوا جاعل أتجعل فجعلنها جاعلك جعلنا اجعل واجعلنا جعلنكم ولنجعلك وجاعل فنجعل جعله ليجعل يجعل ويجعل واجعل وجعلنا وجعلكم لجعلكم وجعل جعلنه لجعلنه يجعله تجعلونه وجعلوا جعلنك جعلكم تجعلنا تجعلني جعلا فيجعله أجعلتم فجعلتم وجعلنهم واجعلوا لجعل يجعلوه اجعلني اجعلوا جعلها جعلوا فاجعل فجعلنا ويجعلون جعلتم وجعلنه وجعلنكم تجعل لجعلون نجعل أجعل واجعله ولنجعله وجعلني يجعلني سيجعل جعلنهم فجعلهم فجعلنهم وجعلنها جعلنها فجعلنه لجعله فجعله لأجعلنك واجعلني ويجعلكم ونجعلهم وجاعلوه ونجعل نجعلها ويجعله وتجعلون نجعلهما لجعلهم وجعلها لجعلنا أجعلنا نجعلهم فجعل جعلته فجعلنهن أفنجعل لنجعلها وجعلت"
  },
  {
    "root": "جفن",
    "words": "وجفان"
  },
  {
    "root": "جفو",
    "words": "جفاء تتجافى"
  },
  {
    "root": "جلب",
    "words": "وأجلب"
  },
  {
    "root": "جلبب",
    "words": "جلبيبهن"
  },
  {
    "root": "جلد",
    "words": "جلودهم جلودا جلود والجلود فاجلدوا جلدة فاجلدوهم وجلودهم لجلودهم جلودكم"
  },
  {
    "root": "جلس",
    "words": "المجلس"
  },
  {
    "root": "جلل",
    "words": "الجلل"
  },
  {
    "root": "جلو",
    "words": "تجلى يجليها الجلاء جليها"
  },
  {
    "root": "جمح",
    "words": "يجمحون"
  },
  {
    "root": "جمد",
    "words": "جامدة"
  },
  {
    "root": "جمع",
    "words": "جميعا أجمعين جامع جمعنهم الجمعان يجمعون جمعوا تجمعوا ليجمعنكم يجمع لجمعهم جمعكم فأجمعوا مجموع وأجمعوا أجمعوا أجمعون اجتمعت مجمع فجمعنهم جمعا فجمع اجتمعوا مجتمعون لجميع جميع الجمع جمعهم يجمعكم لمجموعون الجمعة وجمع نجمع جمعه جمعنكم جمع"
  },
  {
    "root": "جمل",
    "words": "الجمل جميل الجميل جمال جملة جميلا جملت"
  },
  {
    "root": "جمم",
    "words": "جما"
  },
  {
    "root": "جنب",
    "words": "جنوبهم تجتنبوا الجنب بالجنب جنبا جنوبكم فاجتنبوه وجنوبهم لجنبه واجنبني واجتنبوا جانب بجانبه فاجتنبوا جنوبها جنب بجانب اجتنبوا يجتنبون ويتجنبها وسيجنبها"
  },
  {
    "root": "جنح",
    "words": "جناح بجناحيه جنحوا فاجنح جناحك أجنحة"
  },
  {
    "root": "جند",
    "words": "بالجنود وجنوده جنودا بجنود جندا بجنوده وجنود جنوده وجنودهما جنود وجنودا جند جندنا الجنود"
  },
  {
    "root": "جنف",
    "words": "جنفا متجانف"
  },
  {
    "root": "جنن",
    "words": "جنت الجنة جنة وجنة وجنت جن الجن والجن لمجنون والجان جنتين الجنتين جنته جنتك جان جنتان بجنتيهم مجنون بالجنة الجنات أجنة الجان بمجنون جنتي"
  },
  {
    "root": "جني",
    "words": "جنيا وجنى"
  },
  {
    "root": "جهد",
    "words": "وجهدوا جهدوا والمجهدون المجهدين جهد يجهدون وجهد وجهاد يجهدوا جهدهم جهاده وجهدهم جهادا يجهد جهداك جهدا وتجهدون"
  },
  {
    "root": "جهر",
    "words": "جهرة الجهر وجهركم جهر وجهرا تجهر تجهروا كجهر اجهروا جهارا"
  },
  {
    "root": "جهز",
    "words": "جهزهم بجهازهم"
  },
  {
    "root": "جهل",
    "words": "الجهلين الجاهل الجهلية بجهلة يجهلون تجهلون جهلون الجهلون جهولا"
  },
  {
    "root": "جهنم",
    "words": "جهنم بجهنم لجهنم"
  },
  {
    "root": "جوب",
    "words": "أجيب فليستجيبوا استجابوا فاستجاب أجبتم يستجيب جواب استجيبوا أجيبت يستجيبوا مجيب يستجيبون فاستجبتم نجب فتستجيبون فاستجبنا يجيب المجيبون أستجب استجيب ويستجيب أجيبوا يجب جابوا"
  },
  {
    "root": "جود",
    "words": "الجودي الجياد"
  },
  {
    "root": "جور",
    "words": "والجار جار استجارك فأجره متجورت جائر يجير يجار يجاورونك ويجركم يجيرني"
  },
  {
    "root": "جوز",
    "words": "جاوزه وجوزنا جاوزا ونتجاوز"
  },
  {
    "root": "جوس",
    "words": "فجاسوا"
  },
  {
    "root": "جوع",
    "words": "والجوع الجوع تجوع جوع"
  },
  {
    "root": "جوف",
    "words": "جوفه"
  },
  {
    "root": "جوي",
    "words": "جو"
  },
  {
    "root": "جيأ",
    "words": "جئت جاءكم جاءهم جاءك جاءتكم جاءته جاءتهم جاءه جئتكم وجئتكم وجاءهم جاءو جئنا وجئنا جاء جاءوك جاءوكم جاءنا جئتهم جئتمونا جاءت فجاءها جئنهم أجئتنا وجاء وجاءو جاءتنا جئتنا وجاءتهم جاءتها فجاءوهم جئتم وجاءته وجاءه وجاءك وجاءت جئنك فأجاءها جاءني جئتك جاءها وجئتك فجاءته لجاءهم وجاءكم جاءتك وجاي جاءوها جئنكم فجاء"
  },
  {
    "root": "جيب",
    "words": "جيوبهن جيبك"
  },
  {
    "root": "جيد",
    "words": "جيدها"
  },
  {
    "root": "حبب",
    "words": "يحبونهم كحب حبا حبه يحب تحبوا ويحب حبة حب تحبون يحببكم تحبونهم يحبونكم ويحبون وأحبؤه يحبهم ويحبونه أحب الحب استحبوا يحبون يستحبون محبة أحببت فاستحبوا حبب أيحب وحب والحب تحبونها وتحبون لحب"
  },
  {
    "root": "حبر",
    "words": "والأحبار أحبارهم الأحبار يحبرون تحبرون"
  },
  {
    "root": "حبس",
    "words": "تحبسونهما يحبسه"
  },
  {
    "root": "حبط",
    "words": "حبطت حبط لحبط وحبط فحبطت فأحبط ليحبطن وسيحبط تحبط"
  },
  {
    "root": "حبك",
    "words": "الحبك"
  },
  {
    "root": "حبل",
    "words": "بحبل وحبل حبالهم حبل"
  },
  {
    "root": "حتم",
    "words": "حتما"
  },
  {
    "root": "حتى",
    "words": "حتى"
  },
  {
    "root": "حثث",
    "words": "حثيثا"
  },
  {
    "root": "حجب",
    "words": "حجاب حجابا بالحجاب لمحجوبون"
  },
  {
    "root": "حجج",
    "words": "ليحاجوكم أتحاجوننا حجة حج والحج الحج حاج حاجوك حاجك تحاجون حججتم يحاجوكم وحاجه أتحجوني حجتنا الحجة الحاج بالحج حجج يتحاجون يحاجون حجتهم"
  },
  {
    "root": "حجر",
    "words": "والحجارة الحجر كالحجارة الحجارة حجوركم حجر حجارة حجرا محجورا وحجرا الحجرت بحجارة"
  },
  {
    "root": "حجز",
    "words": "حاجزا حجزين"
  },
  {
    "root": "حدب",
    "words": "حدب"
  },
  {
    "root": "حدث",
    "words": "أتحدثونهم حديثا حديث الأحاديث الحديث أحدث يحدث محدث أحاديث لحديث بحديث فحدث تحدث"
  },
  {
    "root": "حدد",
    "words": "حدود حدوده يحادد لحدود حديدا الحديد حديد حداد يحادون حاد"
  },
  {
    "root": "حدق",
    "words": "حدائق وحدائق"
  },
  {
    "root": "حذر",
    "words": "حذر فاحذروه ويحذركم حذركم حذرهم فاحذروا واحذرهم واحذروا يحذر تحذرون يحذرون محذورا فليحذر حذرون فاحذرهم فاحذروهم"
  },
  {
    "root": "حرب",
    "words": "بحرب المحراب يحاربون للحرب الحرب حارب محريب"
  },
  {
    "root": "حرث",
    "words": "الحرث حرث حرثكم والحرث وحرث حرثه تحرثون"
  },
  {
    "root": "حرج",
    "words": "حرجا حرج"
  },
  {
    "root": "حرد",
    "words": "حرد"
  },
  {
    "root": "حرر",
    "words": "الحر بالحر محررا فتحرير وتحرير تحرير حرا حرير الحرور وحريرا"
  },
  {
    "root": "حرس",
    "words": "حرسا"
  },
  {
    "root": "حرص",
    "words": "أحرص حرصتم حرصت تحرص"
  },
  {
    "root": "حرض",
    "words": "وحرض حرض حرضا"
  },
  {
    "root": "حرف",
    "words": "يحرفونه يحرفون متحرفا حرف"
  },
  {
    "root": "حرق",
    "words": "فاحترقت الحريق لنحرقنه حرقوه"
  },
  {
    "root": "حرك",
    "words": "تحرك"
  },
  {
    "root": "حرم",
    "words": "محرم الحرام حرم والحرمت وحرم حرمت حرمنا محرمة تحرموا حرما ومحرم وحرموا محرما حرمهما ويحرم الحرم يحرمون ويحرمونه حراما المحرم حرام حرمها وحرمنا والمحروم محرومون تحرم"
  },
  {
    "root": "حرو",
    "words": "تحروا"
  },
  {
    "root": "حزب",
    "words": "حزب الأحزاب الحزبين حزبه والأحزاب"
  },
  {
    "root": "حزن",
    "words": "يحزنون تحزنوا يحزنك ليحزنك تحزنون تحزن حزنا ليحزنني الحزن وحزني تحزني يحزنهم وحزنا يحزن ليحزن"
  },
  {
    "root": "حسب",
    "words": "الحساب فحسبه حساب حسبتم يحسبهم يحاسبكم لتحسبوه تحسبن حسبنا يحسبن تحسبنهم حسيبا وحسبوا حسابهم حسابك الحسبين حسبانا ويحسبون حسبك حسبهم والحساب حسبت وتحسبهم أفحسب يحسبون حسبين أيحسبون أفحسبتم حسابه تحسبوه وتحسبونه يحسبه تحسب حسبته تحسبها أحسب حسب حسبي يحتسبون بحسبان يحتسبوا تحسبهم يحتسب حسبه فحاسبنها حسابا حسابيه أيحسب حسبتهم يحاسب يحسب"
  },
  {
    "root": "حسد",
    "words": "حسدا يحسدون تحسدوننا حاسد حسد"
  },
  {
    "root": "حسر",
    "words": "حسرت حسرة يحسرتنا محسورا الحسرة يستحسرون يحسرة يحسرتى حسير لحسرة"
  },
  {
    "root": "حسس",
    "words": "أحس تحسونهم فتحسسوا تحس أحسوا حسيسها"
  },
  {
    "root": "حسم",
    "words": "حسوما"
  },
  {
    "root": "حسن",
    "words": "المحسنين إحسانا حسنا محسن أحسن بإحسن وأحسنوا حسنة حسن وحسن أحسنوا إحسنا وأحسن بأحسن الحسنى تحسنوا بالحسنة الحسنة بأحسنها بالحسنت الحسنيين الحسنت والإحسن محسنون أحسنتم وحسنت يحسنون حسنت للمحسنين للمحسنت حسنهن لحسن أحسنه فأحسن للحسنى محسنين بالحسنى الإحسن حسان"
  },
  {
    "root": "حشر",
    "words": "تحشرون وتحشرون فسيحشرهم نحشرهم يحشرون يحشروا وحشرنا يحشرهم حشرين ونحشرهم وحشرنهم لنحشرنهم نحشر يحشر ونحشر ونحشره حشرتني وحشر احشروا محشورة حشر الحشر فحشر حشرت"
  },
  {
    "root": "حصب",
    "words": "حاصبا حصب"
  },
  {
    "root": "حصحص",
    "words": "حصحص"
  },
  {
    "root": "حصد",
    "words": "حصاده حصيدا وحصيد حصدتم الحصيد"
  },
  {
    "root": "حصر",
    "words": "أحصرتم أحصروا وحصورا حصرت واحصروهم حصيرا"
  },
  {
    "root": "حصل",
    "words": "وحصل"
  },
  {
    "root": "حصن",
    "words": "والمحصنت محصنين المحصنت محصنت أحصن تحصنون لتحصنكم أحصنت تحصنا حصونهم محصنة"
  },
  {
    "root": "حصي",
    "words": "تحصوها أحصى أحصيها أحصيهم أحصينه أحصيه وأحصوا وأحصى تحصوه"
  },
  {
    "root": "حضر",
    "words": "حضر حاضري حاضرة محضرا وأحضرت حاضرا لنحضرنهم يحضرون المحضرين محضرون لمحضرون حضروه محتضر أحضرت"
  },
  {
    "root": "حضض",
    "words": "يحض تحضون"
  },
  {
    "root": "حطب",
    "words": "حطبا الحطب"
  },
  {
    "root": "حطط",
    "words": "حطة"
  },
  {
    "root": "حطم",
    "words": "يحطمنكم حطما الحطمة"
  },
  {
    "root": "حظر",
    "words": "محظورا المحتظر"
  },
  {
    "root": "حظظ",
    "words": "حظا حظ"
  },
  {
    "root": "حفد",
    "words": "وحفدة"
  },
  {
    "root": "حفر",
    "words": "حفرة الحافرة"
  },
  {
    "root": "حفظ",
    "words": "حفظوا حفظهما حفظت حفظ حفيظا استحفظوا واحفظوا حفظة يحافظون بحفيظ والحفظون حفيظ لحفظون حفظا ونحفظ حفظين يحفظونه وحفظنها محفوظا حفظون ويحفظوا ويحفظن والحفظين والحفظت وحفظا لحفظين محفوظ حافظ"
  },
  {
    "root": "حفف",
    "words": "وحففنهما حافين"
  },
  {
    "root": "حفو",
    "words": "حفي حفيا فيحفكم"
  },
  {
    "root": "حقب",
    "words": "حقبا أحقابا"
  },
  {
    "root": "حقف",
    "words": "بالأحقاف"
  },
  {
    "root": "حقق",
    "words": "الحق بالحق حق للحق حقا أحق استحقا استحق بحق حقه حقيق يحق ليحق حقت لحق ويحق فحق وبالحق فالحق والحق وحق الحاقة وحقت"
  },
  {
    "root": "حكم",
    "words": "الحكيم يحكم والحكمة الحكام حكيم ليحكم الحكمة محكمت فأحكم والحكم وحكمة حكيما حكما وحكما حكمتم تحكموا يتحاكموا يحكموك لتحكم فاحكم حكمت يحكمونك حكم وليحكم احكم أفحكم الحكم يحكمون الحكمين تحكمون أحكمت أحكم لحكمه بالحكمة حكمه يحكمان لحكمهم بحكمه تحكم فالحكم فحكمه محكمة لحكم حكمة بأحكم"
  },
  {
    "root": "حلف",
    "words": "يحلفون حلفتم وسيحلفون ويحلفون سيحلفون وليحلفن فيحلفون حلاف"
  },
  {
    "root": "حلق",
    "words": "تحلقوا محلقين"
  },
  {
    "root": "حلقم",
    "words": "الحلقوم"
  },
  {
    "root": "حلل",
    "words": "حللا أحل محله يحل تحل وأحل ولأحل حلا وحلئل أحلت محلي تحلوا حللتم حل ويحل يحلونه فيحلوا وحللا وأحلوا حلل واحلل فيحل يحلل وأحلت محلها أحللنا أحلنا يحلون تحلة"
  },
  {
    "root": "حلم",
    "words": "حليم لحليم الحليم أحلم الأحلم حليما الحلم أحلمهم"
  },
  {
    "root": "حلي",
    "words": "حليهم حلية يحلون الحلية وحلوا"
  },
  {
    "root": "حم",
    "words": "حم"
  },
  {
    "root": "حمأ",
    "words": "حمإ حمئة"
  },
  {
    "root": "حمد",
    "words": "الحمد بحمدك حميد محمد يحمدوا حميدا والحمد الحمدون بحمده الحميد بحمد محمودا أحمد"
  },
  {
    "root": "حمر",
    "words": "حمارك والحمير الحمير وحمر الحمار حمر"
  },
  {
    "root": "حمل",
    "words": "تحمله تحمل حملته تحملنا احتمل يحملون حمولة حملت حملا لتحملهم أحملكم احمل أحمل حمل فاحتمل وتحمل ليحملوا حملنا وحملنهم فحملته يحمل حملها تحملون حملتم ولنحمل بحملين وليحملن احتملوا يحملنها وحملها وحمله فالحملت وحملنه حملوا يحملوها الأحمال حملهن حملنكم وحملت ويحمل حمالة"
  },
  {
    "root": "حمم",
    "words": "حميم الحميم حميما وحميم يحموم"
  },
  {
    "root": "حمي",
    "words": "حام يحمى الحمية حمية حامية"
  },
  {
    "root": "حنث",
    "words": "تحنث الحنث"
  },
  {
    "root": "حنجر",
    "words": "الحناجر"
  },
  {
    "root": "حنذ",
    "words": "حنيذ"
  },
  {
    "root": "حنف",
    "words": "حنيفا حنفاء"
  },
  {
    "root": "حنك",
    "words": "لأحتنكن"
  },
  {
    "root": "حنن",
    "words": "وحنانا"
  },
  {
    "root": "حنين",
    "words": "حنين"
  },
  {
    "root": "حوب",
    "words": "حوبا"
  },
  {
    "root": "حوت",
    "words": "حيتانهم حوتهما الحوت"
  },
  {
    "root": "حوج",
    "words": "حاجة"
  },
  {
    "root": "حوذ",
    "words": "نستحوذ استحوذ"
  },
  {
    "root": "حور",
    "words": "الحواريون الحوارين يحاوره بحور حور وحور تحاوركما للحوارين يحور"
  },
  {
    "root": "حوط",
    "words": "محيط وأحطت يحيطون محيطا لمحيطة أحيط يحيطوا يحاط أحاط وأحيط تحط أحطنا أحطت تحيطوا وأحاط"
  },
  {
    "root": "حول",
    "words": "حوله حولين الحول حولك حيلة حولها يحول حولكم حولهم وحال تحويلا حولا حول وحيل"
  },
  {
    "root": "حوي",
    "words": "الحوايا أحوى"
  },
  {
    "root": "حيث",
    "words": "حيث وحيث"
  },
  {
    "root": "حيد",
    "words": "تحيد"
  },
  {
    "root": "حير",
    "words": "حيران"
  },
  {
    "root": "حيز",
    "words": "متحيزا"
  },
  {
    "root": "حيض",
    "words": "المحيض يحضن"
  },
  {
    "root": "حيف",
    "words": "يحيف"
  },
  {
    "root": "حيق",
    "words": "فحاق وحاق يحيق"
  },
  {
    "root": "حين",
    "words": "حين وحين حينئذ"
  },
  {
    "root": "حيي",
    "words": "يستحي فأحيكم يحييكم ويستحيون يحي الحيوة حيوة أحياء فأحيا أحيهم الحي أحي تحي بيحيى وأحي حييتم بتحية فحيوا أحياها أحيا حياتنا ويحيى فأحيينه ومحياي تحيون ونستحي حي بالحيوة وتحيتهم تحيتهم نحي فلنحيينه يحيى ييحيى حيا حية للحي أحياكم ونحيا تحية لنحي يحيين ويستحي استحياء الحيوان ويحي فيحي لمحي فيستحي فأحيينا الأحياء أحيينها يحييها وأحييتنا واستحيوا محياهم حياتكم وأحيينا وأحيا حيوك يحيك والحيوة لحياتي"
  },
  {
    "root": "خبأ",
    "words": "الخبء"
  },
  {
    "root": "خبت",
    "words": "وأخبتوا خبت المخبتين فتخبت"
  },
  {
    "root": "خبث",
    "words": "الخبيث خبث الخبئث خبيثة الخبيثت للخبيثين والخبيثون للخبيثت"
  },
  {
    "root": "خبر",
    "words": "خبير خبيرا الخبير أخباركم خبرا بخبر لخبير أخبارها"
  },
  {
    "root": "خبز",
    "words": "خبزا"
  },
  {
    "root": "خبط",
    "words": "يتخبطه"
  },
  {
    "root": "خبل",
    "words": "خبالا"
  },
  {
    "root": "ختر",
    "words": "ختار"
  },
  {
    "root": "ختم",
    "words": "ختم وختم وخاتم نختم يختم مختوم ختمه"
  },
  {
    "root": "خدد",
    "words": "خدك الأخدود"
  },
  {
    "root": "خدع",
    "words": "يخدعون خدعهم يخدعوك"
  },
  {
    "root": "خدن",
    "words": "أخدان"
  },
  {
    "root": "خذل",
    "words": "يخذلكم مخذولا خذولا"
  },
  {
    "root": "خرب",
    "words": "خرابها يخربون"
  },
  {
    "root": "خرج",
    "words": "فأخرج فأخرجهما يخرج مخرج فيخرج تخرجون وتخرجون إخراجهم خرجت بخرجين وأخرجوهم أخرجوكم وإخراج إخراج خرجن خرجوا أخرجنا يخرجهم يخرجونهم وتخرج أخرجت وأخرجوا اخرجوا ويخرجهم يخرجوا تخرج أخرجوا ومخرج فأخرجنا نخرج بخارج فتخرجوه فاخرج اخرج أخرج أخرجوهم لنخرجنك يخرجكم لتخرجوا أخرجك يخرجوك بإخراج أخرجه لخرجنا الخروج للخروج تخرجوا ويخرج استخرجها أخرجني لتخرج لنخرجنكم بمخرجين وتستخرجوا أخرجكم ونخرج ليخرجوك وأخرجني ويستخرجا خرجا فخرج نخرجكم لتخرجنا يخرجاكم يخرجنكما مخرجون فخراج ليخرجن فأخرجنهم المخرجين ولنخرجنهم لمخرجون فنخرج ليخرجكم وتستخرجون وأخرجنا خروج يخرجون أخرجتك أخرجتم لنخرجن خرجتم يخرجوكم وأخرجوكم إخراجكم تخرجوهن يخرجن مخرجا ليخرج ويخرجكم إخراجا لنخرج وأخرج وأخرجت"
  },
  {
    "root": "خردل",
    "words": "خردل"
  },
  {
    "root": "خرر",
    "words": "وخر وخروا فخر يخرون ويخرون خروا وتخر خر يخروا"
  },
  {
    "root": "خرص",
    "words": "يخرصون تخرصون الخرصون"
  },
  {
    "root": "خرطوم",
    "words": "الخرطوم"
  },
  {
    "root": "خرق",
    "words": "وخرقوا تخرق خرقها أخرقتها"
  },
  {
    "root": "خزن",
    "words": "خزائن خزائنه بخزنين خزنتها لخزنة"
  },
  {
    "root": "خزي",
    "words": "خزي أخزيته تخزنا مخزي ويخزهم الخزي يخزيه تخزون يخزيهم ونخزى تخزني أخزى وليخزي يخزي"
  },
  {
    "root": "خسأ",
    "words": "خسين اخسؤا خاسئا"
  },
  {
    "root": "خسر",
    "words": "الخسرون الخسرين خسرين خسر خسرانا خسروا لخسرون الأخسرون تخسير خسارا بالأخسرين الأخسرين الخسران المخسرين وخسر يخسر تخسروا خسرا خاسرة يخسرون"
  },
  {
    "root": "خسف",
    "words": "يخسف فخسفنا لخسف خسفنا نخسف وخسف"
  },
  {
    "root": "خشب",
    "words": "خشب"
  },
  {
    "root": "خشع",
    "words": "الخشعين خشعين خشوعا وخشعت خشعون والخشعين والخشعت خشعة خشعا تخشع"
  },
  {
    "root": "خشي",
    "words": "خشية تخشوهم واخشوني فاخشوهم وليخش خشي يخشون كخشية واخشون تخشوا نخشى أتخشونهم تخشوه يخش تخشون ويخشون فخشينا يخشى تخشى خشيت خشيته ويخش واخشوا وتخشى تخشيه ويخشونه وخشي فتخشى يخشيها"
  },
  {
    "root": "خصص",
    "words": "يختص خاصة خصاصة"
  },
  {
    "root": "خصف",
    "words": "يخصفان"
  },
  {
    "root": "خصم",
    "words": "الخصام يختصمون خصيما خصيم خصمان اختصموا يخصمون الخصم تخاصم تختصمون خصمون تختصموا"
  },
  {
    "root": "خضد",
    "words": "مخضود"
  },
  {
    "root": "خضر",
    "words": "خضرا خضر مخضرة الأخضر"
  },
  {
    "root": "خضع",
    "words": "خضعين تخضعن"
  },
  {
    "root": "خطأ",
    "words": "خطيكم خطيته أخطأنا خطآ خطية خطيتكم الخاطءين لخطين خطءين خطآ خطينا خطيتي خطيهم أخطأتم بالخاطئة الخطؤن خطيتهم خاطئة"
  },
  {
    "root": "خطب",
    "words": "خطبة تخطبني خطبكن خطبكم خطبك خاطبهم خطبكما الخطاب خطابا"
  },
  {
    "root": "خطط",
    "words": "تخطه"
  },
  {
    "root": "خطف",
    "words": "يخطف يتخطفكم فتخطفه نتخطف ويتخطف خطف الخطفة"
  },
  {
    "root": "خطو",
    "words": "خطوت"
  },
  {
    "root": "خفت",
    "words": "تخافت يتخفتون"
  },
  {
    "root": "خفض",
    "words": "واخفض خافضة"
  },
  {
    "root": "خفف",
    "words": "يخفف تخفيف خفت خفيفا خفف خفافا تستخفونها يستخفنك فاستخف"
  },
  {
    "root": "خفي",
    "words": "تخفوها تخفوه يخفى تخفوا تخفى يخفون يستخفون تخفون وخفية وتخفون ليستخفوا مستخف نخفي خفيا وأخفى أخفيها يخفين أخفي وتخفي خفي أخفيتم خافية"
  },
  {
    "root": "خلد",
    "words": "خلدون خلدين خلدا الخلدين أخلد الخلد الخلدون ويخلد تخلدون خلد الخلود مخلدون أخلده"
  },
  {
    "root": "خلص",
    "words": "خالصة مخلصون وأخلصوا مخلصين المخلصين أستخلصه خلصوا خالصا مخلصا أخلصنهم بخالصة الخالص"
  },
  {
    "root": "خلط",
    "words": "تخالطوهم اختلط خلطوا فاختلط الخلطاء"
  },
  {
    "root": "خلع",
    "words": "فاخلع"
  },
  {
    "root": "خلف",
    "words": "خليفة خلفها يخلف يختلفون واختلف اختلفوا اختلف خلفهم تختلفون واختلفوا تخلف اختلفا خلف ويستخلف مختلفا خلئف خلفاء ويستخلفكم اخلفني خلفتموني فخلف لاختلفتم أخلفوا المخلفون الخلفين الخوالف خلفوا يتخلفوا فاختلفوا خلفك أخالفكم فاختلف مختلفين خلفه فأخلفتكم مخلف مختلف خلفنا نخلفه فأخلفتم أخلفنا تخلفه ليستخلفنهم استخلف يخالفون خلفة يخلفه خلفكم اختلفتم يخلفون للمخلفين مستخلفين مختلفون"
  },
  {
    "root": "خلق",
    "words": "خلقكم خلق يخلق أخلق خلقه خلقت وخلق تخلق خلقنكم وخلقهم خلقتني وخلقته الخلق خلقنا يخلقون بخلقهم بخلقكم خلقهم خلقوا كخلقه بخلق خلقنه خلقته خلقها ويخلق خلقا خلقك خلقتك مخلقة يخلقوا فخلقنا الخلقين خلقني وتخلقون لخلق وخلقنا خلقنهم اختلق يخلقكم خلقهن خلقنهما بخلقهن بالخلق الخلقون تخلقونه فخلق نخلقكم وخلقنكم"
  },
  {
    "root": "خلل",
    "words": "خلة خليلا خللكم خلل خللها خللهما خلله الأخلاء"
  },
  {
    "root": "خلو",
    "words": "خلوا خلا خلت فخلوا يخل الخالية وتخلت"
  },
  {
    "root": "خمد",
    "words": "خمدين خمدون"
  },
  {
    "root": "خمر",
    "words": "الخمر خمرا بخمرهن خمر"
  },
  {
    "root": "خمس",
    "words": "بخمسة خمسه خمسة والخمسة خمسين"
  },
  {
    "root": "خمص",
    "words": "مخمصة"
  },
  {
    "root": "خمط",
    "words": "خمط"
  },
  {
    "root": "خنزر",
    "words": "الخنزير والخنازير خنزير"
  },
  {
    "root": "خنس",
    "words": "بالخنس الخناس"
  },
  {
    "root": "خنق",
    "words": "والمنخنقة"
  },
  {
    "root": "خور",
    "words": "خوار"
  },
  {
    "root": "خوض",
    "words": "يخوضوا يخوضون خوضهم نخوض وخضتم خاضوا خوض الخائضين"
  },
  {
    "root": "خوف",
    "words": "خوف خائفين الخوف خاف يخافا خفتم يخوف تخافوهم وخافون خافوا تخافون خافت يخافون أخاف يخافه يخافوا خوفا وخيفة تخافن خيفة تخف وأخاف خيفته ويخافون وخاف تخوف والخوف تخويفا ونخوفهم خفت نخاف تخافا يخاف خوفهم فأخاف خفتكم تخافي خائفا تخافونهم كخيفتكم ويخوفونك تخافوا"
  },
  {
    "root": "خول",
    "words": "وخلتكم خولنكم أخولكم خلتكم خالك خلتك خوله خولنه"
  },
  {
    "root": "خون",
    "words": "تختانون للخائنين يختانون خوانا خائنة تخونوا وتخونوا خيانة الخائنين خيانتك خانوا أخنه خوان فخانتاهما"
  },
  {
    "root": "خوي",
    "words": "خاوية"
  },
  {
    "root": "خيب",
    "words": "خائبين وخاب خاب"
  },
  {
    "root": "خير",
    "words": "خير بخير الخيرت خيرا الخير واختار بالخير وخير اخترتك والخير ويختار الخيرة بالخيرت الأخيار اخترنهم للخير خيرت يتخيرون تخيرون"
  },
  {
    "root": "خيط",
    "words": "الخيط الخياط"
  },
  {
    "root": "خيل",
    "words": "والخيل مختالا الخيل بخيلك يخيل مختال خيل"
  },
  {
    "root": "خيم",
    "words": "الخيام"
  },
  {
    "root": "دأب",
    "words": "كدأب دأبا دائبين دأب"
  },
  {
    "root": "داود",
    "words": "داود وداود يداود لداود"
  },
  {
    "root": "دبب",
    "words": "دابة الدواب والدواب"
  },
  {
    "root": "دبر",
    "words": "الأدبار أدبارها يتدبرون أدباركم دابر دبره وأدبرهم مدبرين يدبر دبر أدبرهم يدبروا مدبرا الأدبر ليدبروا وأدبر وإدبر الدبر أدبر فالمدبرت"
  },
  {
    "root": "دثر",
    "words": "المدثر"
  },
  {
    "root": "دحر",
    "words": "مدحورا دحورا"
  },
  {
    "root": "دحض",
    "words": "ليدحضوا المدحضين داحضة"
  },
  {
    "root": "دحو",
    "words": "دحيها"
  },
  {
    "root": "دخر",
    "words": "تدخرون دخرون دخرين داخرين"
  },
  {
    "root": "دخل",
    "words": "ادخلوا وادخلوا يدخل يدخلوها تدخلوا دخل دخله وأدخل تدخل ولأدخلنهم يدخله دخلتم وندخلكم مدخلا سندخلهم وندخلهم يدخلون فسيدخلهم ولأدخلنكم ندخلها دخلون دخلتموه دخلوا يدخلنا دخلت وأدخلنا سيدخلهم ودخل فدخلوا يدخلونها ادخلوها فادخلوا دخلا وليدخلوا دخلوه أدخلني مدخل وأدخلنه وأدخلنهم ليدخلنهم تدخلوها وأدخلني ادخلي لندخلنهم ادخل فادخلوها وأدخلهم أدخلوا سيدخلون فيدخلهم ويدخلهم ليدخل لتدخلن ويدخلكم ويدخله ادخلا الدخلين يدخلنها فأدخلوا فادخلي وادخلي"
  },
  {
    "root": "دخن",
    "words": "دخان بدخان"
  },
  {
    "root": "درأ",
    "words": "فادرءتم فادرءوا ويدرءون ويدرؤا"
  },
  {
    "root": "درج",
    "words": "درجة درجت سنستدرجهم الدرجت"
  },
  {
    "root": "درر",
    "words": "مدرارا دري"
  },
  {
    "root": "درس",
    "words": "تدرسون درست دراستهم ودرسوا يدرسونها"
  },
  {
    "root": "درك",
    "words": "يدرككم يدركه الدرك تدركه يدرك اداركوا أدركه دركا لمدركون ادرك تدرك"
  },
  {
    "root": "درهم",
    "words": "درهم"
  },
  {
    "root": "دري",
    "words": "تدرون أدريكم أدري تدري يدريك ندري أدر أدريك أدريك"
  },
  {
    "root": "دسر",
    "words": "ودسر"
  },
  {
    "root": "دسس",
    "words": "يدسه دسيها"
  },
  {
    "root": "دعو",
    "words": "وادعوا فادع ادع دعاء دعوة الداع دعان يدعون يدعوا ادعهن دعوا دعا الدعاء ندع يدعوكم تدعون تدعونه أندعوا يدعونه دعويهم وادعوه ادعوا فادعوه تدعوهم أدعوتموهم فادعوهم دعاكم دعانا يدعنا دعوتكما تدع تدعونا يدعونني أدعوا تدعوننا دعوتكم دعوتك ندعوا ويدع دعاءه تدعوا فدعوهم تدعهم بدعائك وأدعوا بدعاء الداعي دعويهم ويدعوننا وادع لتدعوهم يدع كدعاء دعاؤكم دعاه يدعوك يدعوهم أدعياءكم ادعوهم أدعيائهم وداعيا دعيتم دعاءكم أتدعون دعي فادعوا وليدع أدعوكم وتدعونني تدعونني دعؤا ادعوني فدعا تدعى دعائهم داعي وتدعوا ستدعون ندعوه يدعى ويدعون دعوت دعاءي دعوتهم يدعوه فليدع سندع"
  },
  {
    "root": "دفأ",
    "words": "دفء"
  },
  {
    "root": "دفع",
    "words": "دفع ادفعوا فادفعوا دفعتم يدفع ادفع دافع"
  },
  {
    "root": "دفق",
    "words": "دافق"
  },
  {
    "root": "دكك",
    "words": "دكا دكاء فدكتا دكة دكت"
  },
  {
    "root": "دلك",
    "words": "لدلوك"
  },
  {
    "root": "دلل",
    "words": "أدلكم أدلك دليلا ندلكم دلهم"
  },
  {
    "root": "دلو",
    "words": "وتدلوا فدليهما فأدلى دلوه فتدلى"
  },
  {
    "root": "دم",
    "words": "الدماء دماءكم"
  },
  {
    "root": "دمدم",
    "words": "فدمدم"
  },
  {
    "root": "دمر",
    "words": "ودمرنا فدمرنها تدميرا فدمرنهم دمرنا دمرنهم تدمر دمر"
  },
  {
    "root": "دمع",
    "words": "الدمع"
  },
  {
    "root": "دمغ",
    "words": "فيدمغه"
  },
  {
    "root": "دمي",
    "words": "والدم دما بدم ودم دماؤها"
  },
  {
    "root": "دنر",
    "words": "بدينار"
  },
  {
    "root": "دنو",
    "words": "أدنى الدنيا وأدنى دانية الأدنى يدنين دنا دان ودانية"
  },
  {
    "root": "دهر",
    "words": "الدهر"
  },
  {
    "root": "دهق",
    "words": "دهاقا"
  },
  {
    "root": "دهم",
    "words": "مدهامتان"
  },
  {
    "root": "دهن",
    "words": "بالدهن كالدهان مدهنون تدهن فيدهنون"
  },
  {
    "root": "دهو",
    "words": "أدهى"
  },
  {
    "root": "دور",
    "words": "ديركم ديرهم الدار ديرنا تديرونها دائرة وللدار دار دارهم والدار الدوائر داركم ولدار الديار وبداره تدور وديرهم ديارا"
  },
  {
    "root": "دول",
    "words": "نداولها دولة"
  },
  {
    "root": "دوم",
    "words": "دمت داموا دمتم دامت دائم دائمون"
  },
  {
    "root": "دون",
    "words": "دون دونكم دونه ودون دونهم دونك دوني دونها دونهما دوننا"
  },
  {
    "root": "دين",
    "words": "الدين دينكم دينه تداينتم بدين دينهم دين دينا يدينون ودين ديني للدين لمدينون بدينكم مدينين بالدين"
  },
  {
    "root": "ذأب",
    "words": "الذئب"
  },
  {
    "root": "ذأم",
    "words": "مذءوما"
  },
  {
    "root": "ذا",
    "words": "ذلك هذا بهذا هذه ذلكم تلك وتلك ذا وهذا وذلك وبذلك تلكما لهذا تلكم فذلكم فبذلك ولذلك فذلكن ذلكما هذن فكذلك فذلك أهذا هذان أذلك أهكذا فتلك هتين فذنك فهذا وذلكم فلذلك بذلك وهذه كذلكم أفبهذا"
  },
  {
    "root": "ذبب",
    "words": "ذبابا الذباب"
  },
  {
    "root": "ذبح",
    "words": "يذبحون تذبحوا فذبحوها ذبح ويذبحون لأاذبحنه يذبح أذبحك بذبح"
  },
  {
    "root": "ذبذب",
    "words": "مذبذبين"
  },
  {
    "root": "ذرأ",
    "words": "ذرأ ذرأنا ذرأكم يذرؤكم"
  },
  {
    "root": "ذرر",
    "words": "ذريتي ذريتنا ذرية وذريتها ذرة ذريته وذريتهم ذريتهم وذرية تذروه وذريته وذريتنا ذريتهما والذريت ذروا"
  },
  {
    "root": "ذرع",
    "words": "ذرعا ذراعيه ذرعها ذراعا"
  },
  {
    "root": "ذعن",
    "words": "مذعنين"
  },
  {
    "root": "ذقن",
    "words": "للأذقان الأذقان"
  },
  {
    "root": "ذكر",
    "words": "اذكروا واذكروا يذكر فاذكروني أذكركم فاذكروا واذكروه كذكركم ذكرا يتذكرون ستذكرونهن فتذكر الذكر واذكر والذكر ذكروا يذكرون ذكر للذكر فللذكر اذكر الذكرى ذكرى وذكر تتذكرون لذكورنا آلذكرين تذكرون وذكرى تذكروا وتذكيري للذكرين اذكرني وادكر تذكر يتذكر بذكر وذكرهم وليذكر ليذكروا ذكرت ذكرنا أذكره تذكرة لذكرى ونذكرك ذكركم وذكرا يذكرهم ويذكروا بذكرهم ذكرهم ويذكر الذكران وذكروا ولذكر واذكرن والذكرين والذكرت ذكرتم وليتذكر فستذكرون بالذكر الذكور ذكرانا لذكر فذكر مدكر لتذكرة التذكرة ذكره مذكورا ذكريها سيذكر مذكر ذكرك"
  },
  {
    "root": "ذكو",
    "words": "ذكيتم"
  },
  {
    "root": "ذلل",
    "words": "الذلة ذلول وتذل أذلة وذلة ذلة ذللا الذل نذل وذللنها الأذلين الأذل ذلولا وذللت تذليلا"
  },
  {
    "root": "ذمم",
    "words": "ذمة مذموما مذموم"
  },
  {
    "root": "ذنب",
    "words": "بذنوبهم ذنوبنا ذنوبكم لذنوبهم الذنوب بذنوبكم ذنوبهم لذنبك بذنوب ذنب بذنبه الذنب بذنوبنا ذنبك ذنوبا ذنوب ذنبه بذنبهم"
  },
  {
    "root": "ذهب",
    "words": "ذهب لذهب الذهب ذهبا لتذهبوا يذهبكم فاذهب ويذهب وتذهب يذهبن تذهبوا ذهبوا ذهبنا اذهبوا فيذهب اذهب لنذهبن اذهبا ويذهبا ذهاب يذهب يذهبوا فاذهبا ليذهب تذهب أذهب ذاهب نذهبن أذهبتم ذهبت تذهبون"
  },
  {
    "root": "ذهل",
    "words": "تذهل"
  },
  {
    "root": "ذو",
    "words": "وذي ذو ذوي لذو بذات وبذي ذي ذوا ذات ولذي وذات يذا وذا ذواتي وذو فذو ذواتا لذي"
  },
  {
    "root": "ذود",
    "words": "تذودان"
  },
  {
    "root": "ذوق",
    "words": "فذوقوا ذوقوا ذائقة ليذوقوا ليذوق ويذيق ذاقوا ذاقا فذوقوه وذوقوا أذقنا نذيقهم أذقنه وتذوقوا فأذقها لأذقنك ونذيقه نذقه أذاقهم ليذيقهم وليذيقكم ولنذيقنهم لذائقون لذائقوا يذوقوا فليذوقوه فأذاقهم لنذيقهم فلنذيقن ذق يذوقون فذاقوا فذاقت"
  },
  {
    "root": "ذيع",
    "words": "أذاعوا"
  },
  {
    "root": "رأس",
    "words": "رءوسكم رأسه رءوس برءوسكم برأس رأسي رءوسهم الرأس برأسي"
  },
  {
    "root": "رأف",
    "words": "لرءوف رءوف رأفة"
  },
  {
    "root": "رأى",
    "words": "يروا أرءيتم"
  },
  {
    "root": "رأي",
    "words": "نرى ويريكم وأرنا يرى يرون ورأوا يريهم تر أرني رئاء يرونهم رأى رأيتموه أريكم رأيت أريك يراءون أرنا ليريه فترى وترى ترى أرءيتكم رءا ليريهما يريكم ترونهم لنريك تريني سأوريكم وتريهم يريكهم أريكهم يريكموهم ورئاء تراءت أرى ترون تروها وسيرى فسيرى نرينك رأوا نريك الرأي رأيتهم رءياك لنريها رأينه نريك رءيي للرءيا ترونها لنريه الرءيا أرينك أرءيتك ترن ورءا أرءيت ترين ورءيا أفرءيت وأرى أرينه ير رءاك يريها رأتهم يرونها رأوك نربك ترءا أفرءيتم يريك رءاها رءاه رأته سيريكم ونري فرأوه فأروني تروا ليريكم ويرى أروني فرءاه فتريه أفرءيتم سنريهم وتريهم نريهم أريكم رأوه لأرينكهم تريهم فتريه لرأيته ورأيتهم رأوها يرونه ونريه فأريه رأوهم يره ليروا فالموريت لترون لترونها ورأيت"
  },
  {
    "root": "رب",
    "words": "ربما"
  },
  {
    "root": "ربب",
    "words": "رب ربهم ربكم ربك ربه ربنا لرب وربكم ربي ربها لربك أربابا ربنين ربيون بربكم وربئبكم وربك والربنيون الربنيون بربهم وربنا ربكما ربهما برب لربهم وربي ءأرباب فوربك أربى بربك ربياني لربه فربكم بربي بربنا ورب يرب ألربك لربكم فورب بربه ولربك لربها"
  },
  {
    "root": "ربح",
    "words": "ربحت"
  },
  {
    "root": "ربص",
    "words": "تربص يتربصن يتربصون فتربصوا تربصون نتربص متربصون ويتربص متربص تربصوا المتربصين وتربصتم"
  },
  {
    "root": "ربط",
    "words": "ورابطوا وليربط رباط وربطنا ربطنا"
  },
  {
    "root": "ربع",
    "words": "أربعين أربعة وربع الربع رابعهم بأربعة أربع"
  },
  {
    "root": "ربو",
    "words": "بربوة الربوا ويربي ربا رابيا وربت ربوة ليربوا يربوا رابية"
  },
  {
    "root": "رتق",
    "words": "رتقا"
  },
  {
    "root": "رتل",
    "words": "ورتلنه ترتيلا ورتل"
  },
  {
    "root": "رجج",
    "words": "رجت رجا"
  },
  {
    "root": "رجز",
    "words": "رجزا الرجز رجز والرجز"
  },
  {
    "root": "رجس",
    "words": "رجس الرجس رجسا رجسهم"
  },
  {
    "root": "رجع",
    "words": "يرجعون ترجعون رجعون رجعتم ترجع يتراجعا مرجعكم مرجعهم رجع رجعك رجعوا يرجع أرجع ارجع ارجعوا فرجعنك فرجع وارجعوا فرجعوا ارجعون فارجعوا فارجعنا رجعت ترجعونها ترجعوهن رجعنا فارجع رجعه الرجع ارجعي الرجعى"
  },
  {
    "root": "رجف",
    "words": "الرجفة والمرجفون ترجف الراجفة"
  },
  {
    "root": "رجل",
    "words": "وللرجال فرجالا رجالكم رجلين فرجل رجالا للرجال رجل الرجال وأرجلكم رجلان وأرجلهم أرجلهم رجلا أرجلكم رجال أرجل ورجلك بأرجلهن لرجل برجلك ورجلا وأرجلهن برجال"
  },
  {
    "root": "رجم",
    "words": "الرجيم لرجمنك رجيم يرجموكم رجما لأرجمنك المرجومين لنرجمنكم ترجمون رجوما"
  },
  {
    "root": "رجو",
    "words": "يرجون وترجون أرجه مرجون مرجوا ترجوها ويرجون يرجوا ترجوا وارجوا ترجي ويرجوا أرجائها ترجون"
  },
  {
    "root": "رحب",
    "words": "رحبت مرحبا"
  },
  {
    "root": "رحق",
    "words": "رحيق"
  },
  {
    "root": "رحل",
    "words": "رحالهم رحل رحله رحلة"
  },
  {
    "root": "رحم",
    "words": "الرحمن الرحيم ورحمته برحمته رحيم ورحمة رحمت أرحامهن وارحمنا الأرحام رحمة ترحمون والأرحام رحيما الرحمة رحمه أرحام وترحمنا برحمة رحمته يرحمنا رحمتك أرحم الرحمين ورحمتي سيرحمهم وبرحمته برحمتك رحم وترحمني برحمتنا بالرحمن يرحمكم ارحمهما رحما للرحمن رحمتنا رحمنهم وارحم ويرحم رحمتي لرحمة ورحمت أرحامكم رحماء رحمنا بالمرحمة"
  },
  {
    "root": "رخو",
    "words": "رخاء"
  },
  {
    "root": "ردأ",
    "words": "ردءا"
  },
  {
    "root": "ردد",
    "words": "يردون يردونكم يردوكم يرتدد بردهن فنردها فردوه ردوه ردوها ردوا ترتدوا يرتد ترد نرد ونرد ليردوهم يترددون تردون وستردون وردوا يردك راد مردود ردت فارتد فردوا برادي رددنا رددت فارتدا مردا ردها رادوه فرددنه لرادك لتردين مردنا ارتدوا لمردودون رددنه"
  },
  {
    "root": "ردف",
    "words": "مردفين ردف الرادفة"
  },
  {
    "root": "ردم",
    "words": "ردما"
  },
  {
    "root": "ردي",
    "words": "والمتردية فتردى أرديكم تردى"
  },
  {
    "root": "رذل",
    "words": "أراذلنا أرذل الأرذلون"
  },
  {
    "root": "رزق",
    "words": "رزقنهم رزقا رزقوا رزقنا رزقنكم رزق وارزق يرزق رزقهن وترزق يرزقون وارزقوهم فارزقوهم رزقهم رزقكم وارزقنا الرزقين نرزقكم الرزق ورزق ورزقكم يرزقكم ورزقنهم رزقها ورزقني ترزقانه وارزقهم برزقين ورزقا رزقنه نرزقهم برزق نرزقك ليرزقنهم يرزقها لرزقنا الرزاق ويرزقه رزقه"
  },
  {
    "root": "رسخ",
    "words": "والرسخون الرسخون"
  },
  {
    "root": "رسس",
    "words": "الرس"
  },
  {
    "root": "رسل",
    "words": "بالرسل رسول ورسله رسولكم أرسلنك رسولا الرسول أرسلنا المرسلين الرسل ورسوله رسله والرسول ورسولا رسوله لرسول رسل رسلك وأرسلنك ورسلا رسلا برسلي رسولنا رسلنا رسالته وأرسلنا وبرسولي برسل نرسل ويرسل أرسل يرسل رسلت مرسل رسالة أرسلت رسلهم فأرسل وأرسل فأرسلنا ولنرسلن برسلتي وللرسول وبرسوله رسولهم أرسله فأرسلوا فأرسلون مرسلا أرسلتم لرسلهم المرسلون فيرسل ورسلي رسولها وبالرسول مرسلة فأرسله مرسلين الرسولا رسلي مرسلون لمرسلون وأرسلنه برسولهم رسلكم للرسل ورسول ورسلنا لنرسل أرسلنه مرسلوا برسلنا برسوله برسول لرسوله ولرسوله ورسلته والمرسلت أرسلوا"
  },
  {
    "root": "رسو",
    "words": "مرسيها ومرسيها روسي راسيت أرسيها مرسيها"
  },
  {
    "root": "رشد",
    "words": "يرشدون الرشد رشدا رشيد الرشيد برشيد مرشدا رشده الرشاد الرشدون"
  },
  {
    "root": "رصد",
    "words": "مرصد وإرصادا رصدا مرصادا لبالمرصاد"
  },
  {
    "root": "رصص",
    "words": "مرصوص"
  },
  {
    "root": "رضع",
    "words": "يرضعن الرضاعة تسترضعوا أرضعنكم الرضعة مرضعة أرضعت أرضعيه المراضع أرضعن فسترضع"
  },
  {
    "root": "رضو",
    "words": "ترضى ترضيها مرضات ترضوا تراض ترضون ورضون رضون ترضيتم يرضى ورضونا ورضيت رضونه رضي ورضوا وليرضوه يرضونكم ترضونها أرضيتم رضوا ليرضوكم يرضوه رضيتم لترضوا رضيا مرضيا لترضى ورضي ارتضى يرضونه ترضيه ويرضين يرضه ويرضى مرضاتي راضية مرضية فترضى"
  },
  {
    "root": "رطب",
    "words": "رطب رطبا"
  },
  {
    "root": "رعب",
    "words": "الرعب رعبا"
  },
  {
    "root": "رعد",
    "words": "ورعد الرعد"
  },
  {
    "root": "رعي",
    "words": "رعنا ورعنا يرتع وارعوا رعون الرعاء رعوها رعايتها ومرعيها المرعى"
  },
  {
    "root": "رغب",
    "words": "يرغب وترغبون رغبون يرغبوا أراغب رغبا فارغب"
  },
  {
    "root": "رغد",
    "words": "رغدا"
  },
  {
    "root": "رغم",
    "words": "مرغما"
  },
  {
    "root": "رفت",
    "words": "ورفتا"
  },
  {
    "root": "رفث",
    "words": "الرفث رفث"
  },
  {
    "root": "رفد",
    "words": "الرفد المرفود"
  },
  {
    "root": "رفرف",
    "words": "رفرف"
  },
  {
    "root": "رفع",
    "words": "ورفعنا يرفع ورفع ورافعك رفعه نرفع لرفعنه رفع ورفعنه ترفع يرفعه رفيع ترفعوا المرفوع رفعها رافعة مرفوعة رفعت"
  },
  {
    "root": "رفق",
    "words": "رفيقا المرافق مرفقا مرتفقا"
  },
  {
    "root": "رقب",
    "words": "الرقاب رقيبا رقبة الرقيب يرقبوا يرقبون وارتقبوا رقيب ترقب يترقب فارتقب مرتقبون فارتقبهم"
  },
  {
    "root": "رقد",
    "words": "رقود مرقدنا"
  },
  {
    "root": "رقق",
    "words": "رق"
  },
  {
    "root": "رقم",
    "words": "والرقيم مرقوم"
  },
  {
    "root": "رقي",
    "words": "ترقى لرقيك فليرتقوا التراقي راق"
  },
  {
    "root": "ركب",
    "words": "ركبانا متراكبا والركب اركبوا اركب لتركبوها ركبا ركبوا يركبون ركوبهم لتركبوا تركبون ركاب ركبك لتركبن"
  },
  {
    "root": "ركد",
    "words": "رواكد"
  },
  {
    "root": "ركز",
    "words": "ركزا"
  },
  {
    "root": "ركس",
    "words": "أركسهم أركسوا"
  },
  {
    "root": "ركض",
    "words": "يركضون تركضوا اركض"
  },
  {
    "root": "ركع",
    "words": "واركعوا الركعين والركع واركعي ركعون الركعون اركعوا راكعا ركعا يركعون"
  },
  {
    "root": "ركم",
    "words": "فيركمه ركاما مركوم"
  },
  {
    "root": "ركن",
    "words": "ركن تركنوا تركن بركنه"
  },
  {
    "root": "رمح",
    "words": "ورماحكم"
  },
  {
    "root": "رمد",
    "words": "كرماد"
  },
  {
    "root": "رمز",
    "words": "رمزا"
  },
  {
    "root": "رمض",
    "words": "رمضان"
  },
  {
    "root": "رمم",
    "words": "رميم كالرميم"
  },
  {
    "root": "رمن",
    "words": "والرمان ورمان"
  },
  {
    "root": "رمي",
    "words": "يرم رميت رمى يرمون ترمي ترميهم"
  },
  {
    "root": "رهب",
    "words": "فارهبون ورهبانا واسترهبوهم يرهبون ترهبون ورهبنهم والرهبان ورهبا الرهب ورهبانية رهبة"
  },
  {
    "root": "رهط",
    "words": "رهطك أرهطي رهط"
  },
  {
    "root": "رهق",
    "words": "يرهق وترهقهم ترهقني يرهقهما ترهقهم رهقا سأرهقه ترهقها"
  },
  {
    "root": "رهن",
    "words": "فرهن رهين رهينة"
  },
  {
    "root": "رهو",
    "words": "رهوا"
  },
  {
    "root": "روح",
    "words": "بروح الريح ريح وروح ريحكم بريح روح روحي بالروح تريحون الروح روحنا الرياح ريحا روحه ورواحها روحا فروح والروح"
  },
  {
    "root": "رود",
    "words": "تريدون أرادوا أرادا أردتم يرد أردنا أتريدون نريد أردت ورودته رودتني ترود رودته رودتن سنرود أردنه فأراد تريد فأردت فأردنا وأرادوا أردن ونريد أتريد تردن يردن فأرادوا يراد أرادني رودوه رويدا"
  },
  {
    "root": "روض",
    "words": "روضة روضات"
  },
  {
    "root": "روع",
    "words": "الروع"
  },
  {
    "root": "روغ",
    "words": "فراغ"
  },
  {
    "root": "روم",
    "words": "الروم"
  },
  {
    "root": "ريب",
    "words": "ريب ترتابوا ارتبتم وارتابت ريبهم ريبة مريب ارتابوا لارتاب مرتاب يرتابوا وارتبتم يرتاب"
  },
  {
    "root": "ريحن",
    "words": "والريحان وريحان"
  },
  {
    "root": "ريد",
    "words": "أراد يريد ويريد يريدا ويريدون يريدون أريد يريدوا يريدان"
  },
  {
    "root": "ريش",
    "words": "وريشا"
  },
  {
    "root": "ريع",
    "words": "ريع"
  },
  {
    "root": "رين",
    "words": "ران"
  },
  {
    "root": "زبد",
    "words": "زبدا زبد الزبد"
  },
  {
    "root": "زبر",
    "words": "والزبر زبورا زبر الزبور زبرا وبالزبر الزبر"
  },
  {
    "root": "زبن",
    "words": "الزبانية"
  },
  {
    "root": "زجاجة",
    "words": "زجاجة"
  },
  {
    "root": "زجج",
    "words": "الزجاجة"
  },
  {
    "root": "زجر",
    "words": "فالزجرت زجرا زجرة مزدجر وازدجر"
  },
  {
    "root": "زجو",
    "words": "مزجية يزجي"
  },
  {
    "root": "زحزح",
    "words": "بمزحزحه زحزح"
  },
  {
    "root": "زحف",
    "words": "زحفا"
  },
  {
    "root": "زخرف",
    "words": "زخرف زخرفها وزخرفا"
  },
  {
    "root": "زرب",
    "words": "وزرابي"
  },
  {
    "root": "زرع",
    "words": "والزرع تزرعون وزرع زرع الزرع زرعا وزروع كزرع الزراع تزرعونه الزرعون"
  },
  {
    "root": "زرق",
    "words": "زرقا"
  },
  {
    "root": "زري",
    "words": "تزدري"
  },
  {
    "root": "زعم",
    "words": "يزعمون تزعمون زعمتم بزعمهم زعيم زعمت زعم"
  },
  {
    "root": "زفر",
    "words": "زفير وزفيرا"
  },
  {
    "root": "زفف",
    "words": "يزفون"
  },
  {
    "root": "زقم",
    "words": "الزقوم"
  },
  {
    "root": "زقوم",
    "words": "زقوم"
  },
  {
    "root": "زكريا",
    "words": "زكريا وزكريا يزكريا"
  },
  {
    "root": "زكو",
    "words": "الزكوة ويزكيهم ويزكيكم يزكيهم أزكى يزكون يزكى وتزكيهم زكية زكوة وزكوة زكيا والزكوة تزكى للزكوة زكى يتزكى تزكوا زكيها"
  },
  {
    "root": "زلزل",
    "words": "وزلزلوا زلزلة زلزالا زلزلت زلزالها"
  },
  {
    "root": "زلف",
    "words": "وزلفا وأزلفنا وأزلفت زلفى لزلفى زلفة أزلفت"
  },
  {
    "root": "زلق",
    "words": "زلقا ليزلقونك"
  },
  {
    "root": "زلل",
    "words": "فأزلهما زللتم استزلهم فتزل"
  },
  {
    "root": "زلم",
    "words": "بالأزلم والأزلم"
  },
  {
    "root": "زمر",
    "words": "زمرا"
  },
  {
    "root": "زمل",
    "words": "المزمل"
  },
  {
    "root": "زمهرير",
    "words": "زمهريرا"
  },
  {
    "root": "زنجبيل",
    "words": "زنجبيلا"
  },
  {
    "root": "زنم",
    "words": "زنيم"
  },
  {
    "root": "زني",
    "words": "الزنى الزانية والزاني الزاني والزانية زان يزنون يزنين"
  },
  {
    "root": "زهد",
    "words": "الزهدين"
  },
  {
    "root": "زهر",
    "words": "زهرة"
  },
  {
    "root": "زهق",
    "words": "وتزهق وزهق زهوقا زاهق"
  },
  {
    "root": "زوج",
    "words": "أزوج وزوجك وزوجه زوجا أزوجهن أزوجا لأزوجهم وأزوج زوجها أزوجكم زوج أزوجنا وأزوجكم زوجين وأزوجهم ولزوجك زوجه أزوجهم وأزوجه لأزوجك زوجك زوجنكها أزوجك أزوجه الأزوج يزوجهم وزوجنهم الزوجين زوجان زوجت"
  },
  {
    "root": "زود",
    "words": "وتزودوا الزاد"
  },
  {
    "root": "زور",
    "words": "تزور الزور وزورا زرتم"
  },
  {
    "root": "زول",
    "words": "زوال لتزول تزولا زالتا"
  },
  {
    "root": "زيت",
    "words": "والزيتون زيتونة زيتها وزيتونا"
  },
  {
    "root": "زيد",
    "words": "فزادهم وسنزيد وزاده ازدادوا ليزدادوا ويزيدهم وليزيدن وزادكم سنزيد زادتهم زيادة زادوكم زادته فزادتهم وزيادة ويزدكم تزيدونني زادوهم ونزداد تزداد لأزيدنكم زدنهم يزيدهم يزيد وزدنهم وازدادوا ويزيد زدني وزادهم زادهم زيد يزيدون فزده نزد مزيد يزدهم يزده تزد فزادوهم زد أزيد ويزداد نزيدكم"
  },
  {
    "root": "زيغ",
    "words": "زيغ تزغ يزيغ زاغت يزغ زاغ زاغوا أزاغ"
  },
  {
    "root": "زيل",
    "words": "يزالون تزال يزال فزيلنا زالت زلتم تزيلوا"
  },
  {
    "root": "زين",
    "words": "زين وزين زينا زينتكم زينة وازينت وزينتها وزينها لأزينن وزينة فزين الزينة زينتهن بزينة زينته وزينا فزينوا وزينه"
  },
  {
    "root": "سأل",
    "words": "سألتم تسلوا سئل تسل تسلون والسائلين سألك يسلونك سل ويسلونك يسلون تساءلون وسلوا يسلك سألوا سألها أسلكم فلنسلن ولنسلن وسلهم سألتهم سألتكم فسل تسلن أسلك للسائلين فسله وسل تسلهم سألتموه لنسلنهم فسلوا لتسلن ولتسلن مسؤلا ليتساءلوا تسلني سألتك سؤلك نسلك يسل فسلوهم يتساءلون وليسلن ليسل سئلوا سألتموهن فسلوهن نسل يسلكم مسؤلون بسؤال ويسلون يسلكموها للسائل يسله يسل وسلوا وليسلوا سألهم سلهم تسلهم سأل سائل سئلت السائل"
  },
  {
    "root": "سأم",
    "words": "تسموا يسمون يسم"
  },
  {
    "root": "سبأ",
    "words": "سبإ لسبإ"
  },
  {
    "root": "سبب",
    "words": "الأسباب تسبوا فيسبوا سببا بسبب الأسبب أسبب"
  },
  {
    "root": "سبت",
    "words": "السبت سبتهم يسبتون سباتا"
  },
  {
    "root": "سبح",
    "words": "نسبح سبحنك سبحنه وسبح ويسبحونه وسبحن ويسبح فسبح سبحن تسبح يسبح تسبيحهم سبحان سبحوا نسبحك يسبحون فسبحن يسبحن وتسبيحه وسبحوا وسبحوه المسبحين المسبحون وتسبحوه فسبحه سبح تسبحون سبحا وسبحه والسبحت"
  },
  {
    "root": "سبط",
    "words": "والأسباط أسباطا"
  },
  {
    "root": "سبع",
    "words": "سبع وسبعة السبع سبعين وسبع سبعة سبعا سبعون"
  },
  {
    "root": "سبغ",
    "words": "وأسبغ سبغت"
  },
  {
    "root": "سبق",
    "words": "فاستبقوا سبقكم سبقوا سبق والسبقون سبقت نستبق واستبقا تسبق يسبقونه سبقون يسبقونا سبقين سابق سبقونا السبقون بمسبوقين سابقوا فالسبقت سبقا"
  },
  {
    "root": "سبل",
    "words": "السبيل سبيل سبيلا سبيلي سبل سبيله السبل سبيلهم سبيلك سبلنا لبسبيل وسبلا سبلا سبيلنا السبيلا"
  },
  {
    "root": "ستت",
    "words": "ستة ستين"
  },
  {
    "root": "ستر",
    "words": "مستورا سترا تستترون"
  },
  {
    "root": "سجد",
    "words": "اسجدوا فسجدوا سجدا مسجد السجود المسجد والمسجد واسجدي يسجدون سجدوا السجدين تسجد سجدين مسجدا لمسجد السجدون يسجد فسجد لأسجد ءأسجد ومسجد واسجدوا أنسجد يسجدوا ساجدا تسجدوا فاسجدوا يسجدان فاسجد واسجد"
  },
  {
    "root": "سجر",
    "words": "يسجرون المسجور سجرت"
  },
  {
    "root": "سجل",
    "words": "سجيل السجل"
  },
  {
    "root": "سجن",
    "words": "يسجن ليسجنن السجن ليسجننه المسجونين سجين"
  },
  {
    "root": "سجو",
    "words": "سجى"
  },
  {
    "root": "سحب",
    "words": "والسحاب سحابا السحاب سحاب يسحبون"
  },
  {
    "root": "سحت",
    "words": "للسحت السحت فيسحتكم"
  },
  {
    "root": "سحر",
    "words": "السحر بالأسحار سحر لسحر السحرة سحروا بسحر لتسحرنا أسحر السحرون مسحورون مسحورا بسحرك لسحرن بسحرهما سحرهم الساحر تسحرون بسحره سحار المسحرين سحران وبالأسحار ساحر أفسحر"
  },
  {
    "root": "سحق",
    "words": "سحيق فسحقا"
  },
  {
    "root": "سحل",
    "words": "بالساحل"
  },
  {
    "root": "سخر",
    "words": "المسخر ويسخرون سخروا مسخرت فيسخرون سخر تسخروا نسخر تسخرون وسخر وسخرنا سخرنها سخرها سخريا يستسخرون سخرنا فسخرنا السخرين يسخر"
  },
  {
    "root": "سخط",
    "words": "بسخط سخط يسخطون أسخط"
  },
  {
    "root": "سدد",
    "words": "سديدا السدين سدا"
  },
  {
    "root": "سدر",
    "words": "سدر سدرة السدرة"
  },
  {
    "root": "سدس",
    "words": "السدس سادسهم"
  },
  {
    "root": "سدي",
    "words": "سدى"
  },
  {
    "root": "سرب",
    "words": "وسارب سربا كسراب سرابا"
  },
  {
    "root": "سربل",
    "words": "سرابيلهم سربيل وسربيل"
  },
  {
    "root": "سرج",
    "words": "سرجا وسراجا سراجا"
  },
  {
    "root": "سرح",
    "words": "تسريح سرحوهن تسرحون وأسرحكن سراحا وسرحوهن"
  },
  {
    "root": "سرد",
    "words": "السرد"
  },
  {
    "root": "سردق",
    "words": "سرادقها"
  },
  {
    "root": "سرر",
    "words": "تسر يسرون سرا السراء أسروا سركم والسراء سرهم وأسروا وأسروه فأسرها أسر سرر تسرون السر وسررا إسرارهم وأسررت إسرارا وسرورا مسرورا السرائر"
  },
  {
    "root": "سرع",
    "words": "سريع ويسرعون وسارعوا يسرعون أسرع لسريع نسارع سراعا"
  },
  {
    "root": "سرف",
    "words": "وإسرافنا إسرافا لمسرفون تسرفوا المسرفين مسرفون للمسرفين يسرف أسرف يسرفوا أسرفوا مسرف مسرفين"
  },
  {
    "root": "سرق",
    "words": "والسارق والسارقة لسرقون سرقين يسرق سرق استرق يسرقن"
  },
  {
    "root": "سرمد",
    "words": "سرمدا"
  },
  {
    "root": "سري",
    "words": "فأسر أسرى سريا أسر يسر"
  },
  {
    "root": "سطح",
    "words": "سطحت"
  },
  {
    "root": "سطر",
    "words": "أسطير مسطورا مسطور مستطر يسطرون"
  },
  {
    "root": "سطو",
    "words": "يسطون"
  },
  {
    "root": "سعد",
    "words": "وسعيد سعدوا"
  },
  {
    "root": "سعر",
    "words": "سعيرا السعير وسعر وسعيرا سعرت"
  },
  {
    "root": "سعي",
    "words": "وسعى سعى سعيا ويسعون سعيها سعيهم تسعى لسعيه سعوا يسعى سعو يسعون السعي سعيه فاسعوا سعيكم لسعيها"
  },
  {
    "root": "سغب",
    "words": "مسغبة"
  },
  {
    "root": "سفح",
    "words": "مسفحين مسفحت مسفوحا"
  },
  {
    "root": "سفر",
    "words": "سفر وسفرا سفرنا أسفارنا أسفارا أسفر سفرة مسفرة"
  },
  {
    "root": "سفع",
    "words": "لنسفعا"
  },
  {
    "root": "سفك",
    "words": "ويسفك تسفكون"
  },
  {
    "root": "سفل",
    "words": "الأسفل أسفل السفلى سافلها الأسفلين سفلين"
  },
  {
    "root": "سفن",
    "words": "السفينة سفينة"
  },
  {
    "root": "سفه",
    "words": "السفهاء سفه سفيها سفها سفاهة سفيهنا"
  },
  {
    "root": "سقر",
    "words": "سقر"
  },
  {
    "root": "سقط",
    "words": "تسقط سقط سقطوا فأسقط نسقط ساقطا"
  },
  {
    "root": "سقف",
    "words": "السقف سقفا والسقف"
  },
  {
    "root": "سقم",
    "words": "سقيم"
  },
  {
    "root": "سقي",
    "words": "استسقى تسقى استسقيه سقاية فيسقي السقاية يسقى ويسقى فأسقينكموه نسقيكم ونسقيه ويسقين يسقون نسقي فسقى سقيت وسقوا لأسقينهم ويسقون وسقيهم وأسقينكم وسقيها"
  },
  {
    "root": "سكب",
    "words": "مسكوب"
  },
  {
    "root": "سكت",
    "words": "سكت"
  },
  {
    "root": "سكر",
    "words": "سكرى سكرت سكرتهم سكرا بسكرى سكرة"
  },
  {
    "root": "سكن",
    "words": "اسكن والمسكنة والمسكين مسكين سكينة المسكنة سكن سكنا اسكنوا ليسكن ومسكن سكينته لتسكنوا سكينا ولنسكننكم أسكنت وسكنتم مسكن لمسكين مسكنهم ومسكنكم فأسكنه مسكونة ساكنا مسكنكم ليسكنوا تسكن تسكنون يسكن السكينة مسكينا أسكنوهن سكنتم المسكين"
  },
  {
    "root": "سلب",
    "words": "يسلبهم"
  },
  {
    "root": "سلح",
    "words": "أسلحتهم وأسلحتهم أسلحتكم"
  },
  {
    "root": "سلخ",
    "words": "فانسلخ انسلخ نسلخ"
  },
  {
    "root": "سلسبيل",
    "words": "سلسبيلا"
  },
  {
    "root": "سلسل",
    "words": "والسلسل سلسلة سلسلا"
  },
  {
    "root": "سلط",
    "words": "لسلطهم يسلط"
  },
  {
    "root": "سلطن",
    "words": "سلطنا سلطن وسلطن بسلطن سلطنه سلطنيه"
  },
  {
    "root": "سلف",
    "words": "سلف أسلفت سلفا أسلفتم"
  },
  {
    "root": "سلق",
    "words": "سلقوكم"
  },
  {
    "root": "سلك",
    "words": "نسلكه فاسلكي وسلك فاسلك سلكنه اسلك فسلكه فاسلكوه لتسلكوا يسلكه يسلك سلككم"
  },
  {
    "root": "سلل",
    "words": "سللة يتسللون"
  },
  {
    "root": "سلم",
    "words": "مسلمة أسلم مسلمين أسلمت مسلمون السلم سلمتم الإسلم ءأسلمتم أسلموا مسلما ويسلموا تسليما سلما سلم لنسلم للإسلم المسلمين للسلم إسلمهم بسلم تسلمون للمسلمين وسلم والسلم وسلما وتسلموا فسلموا سليم وأسلمت يسلم وتسليما والمسلمت وسلموا مستسلمون أسلما وأسلموا يسلمون أسلمنا إسلمكم فسلم مسلمت سلمون المسلمون"
  },
  {
    "root": "سلو",
    "words": "والسلوى"
  },
  {
    "root": "سليمان",
    "words": "سليمن وسليمن ولسليمن لسليمن"
  },
  {
    "root": "سمد",
    "words": "سمدون"
  },
  {
    "root": "سمر",
    "words": "السامري يسمري سمرا"
  },
  {
    "root": "سمع",
    "words": "سمعهم بسمعهم يسمعون واسمعوا سمعنا السميع يسمع سمعه سميع سمع ولتسمعن واسمع مسمع سميعا سمعتم سمعون سمعوا يستمع سمعكم يسمعوا فاستمعوا تسمعون لأسمعهم أسمعهم لسميع السمع يستمعون تسمع والسميع سمعت وسمعهم وأسمع سمعا أسمع فاستمع استمعوه سمعتموه مستمعون تستمعون يسمعونكم يسمعها وسمعنا بمسمع فاسمعون تسمعوا نسمع واستمع مستمعهم استمع للسمع"
  },
  {
    "root": "سمك",
    "words": "سمكها"
  },
  {
    "root": "سمم",
    "words": "سم السموم سموم"
  },
  {
    "root": "سمن",
    "words": "سمان سمين يسمن"
  },
  {
    "root": "سمو",
    "words": "بسم السماء والسماء سموت الأسماء بأسماء بأسمائهم السموت اسمه مسمى سميتها اسم أسماء سميتموها أسمئه ويسماء سموهم والسموت سميا سميكم سموات سماء الاسم ليسمون تسمية باسم تسمى"
  },
  {
    "root": "سنبل",
    "words": "سنابل سنبلة سنبلت سنبله"
  },
  {
    "root": "سند",
    "words": "مسندة"
  },
  {
    "root": "سندس",
    "words": "سندس"
  },
  {
    "root": "سنم",
    "words": "تسنيم"
  },
  {
    "root": "سنن",
    "words": "سنن والسن بالسن سنة مسنون لسنتنا لسنة سنت لسنت"
  },
  {
    "root": "سنه",
    "words": "سنة يتسنه بالسنين السنين سنين سنا"
  },
  {
    "root": "سنو",
    "words": "سنا"
  },
  {
    "root": "سهر",
    "words": "بالساهرة"
  },
  {
    "root": "سهل",
    "words": "سهولها"
  },
  {
    "root": "سهم",
    "words": "فساهم"
  },
  {
    "root": "سهو",
    "words": "ساهون"
  },
  {
    "root": "سوأ",
    "words": "سوء سيئة بالسوء سياتكم تسؤهم سياتنا سياتهم السوء السيات وساء فساء وساءت سوءا سوءة ساء تسؤكم بالسيئة سوءتهما سوءتكم بسوء السيئة والسيات سيئا سي والسوء سيات أسأتم ليسوا سيئه ساءت أسؤا السوأى السيئ أسوأ المسي أساء سياته سيت"
  },
  {
    "root": "سوح",
    "words": "بساحتهم"
  },
  {
    "root": "سود",
    "words": "الأسود وسيدا وتسود اسودت سيدها مسودا سادتنا سود مسودة"
  },
  {
    "root": "سور",
    "words": "بسورة سورة سور أساور تسوروا أسورة بسور"
  },
  {
    "root": "سوط",
    "words": "سوط"
  },
  {
    "root": "سوع",
    "words": "الساعة ساعة بالساعة للساعة والساعة"
  },
  {
    "root": "سوغ",
    "words": "يسيغه سائغا سائغ"
  },
  {
    "root": "سوف",
    "words": "فسوف سوف وسوف لسوف فلسوف ولسوف"
  },
  {
    "root": "سوق",
    "words": "سقنه يساقون ونسوق الأسواق ساقيها نسوق فسقنه بالسوق وسيق سوقه سائق ساق الساق بالساق المساق"
  },
  {
    "root": "سول",
    "words": "سولت سول"
  },
  {
    "root": "سوم",
    "words": "يسومونكم المسومة مسومين يسومهم مسومة تسيمون"
  },
  {
    "root": "سوي",
    "words": "سواء استوى فسويهن تسوى يستوي يستون يستويان واستوت تستوي سويته سويك ساوى سويا سوى السوي استويت نسويكم واستوى سويه وسواء لتستوا استويتم فاستوى نسوي فسوى فسويها فسويك سويها"
  },
  {
    "root": "سيب",
    "words": "سائبة"
  },
  {
    "root": "سيح",
    "words": "فسيحوا السئحون سئحت"
  },
  {
    "root": "سير",
    "words": "فسيروا وللسيارة سيروا يسيركم السيارة سيارة يسيروا سيرت نسير سيرتها وسار السير وتسير سيرا وسيرت"
  },
  {
    "root": "سيطر",
    "words": "المصيطرون بمصيطر"
  },
  {
    "root": "سيل",
    "words": "فسالت السيل وأسلنا سيل"
  },
  {
    "root": "سيناء",
    "words": "سيناء سينين"
  },
  {
    "root": "شأم",
    "words": "المشءمة"
  },
  {
    "root": "شأن",
    "words": "شأن شأنهم"
  },
  {
    "root": "شبه",
    "words": "متشبها تشبه تشبهت متشبهت شبه مشتبها متشبه فتشبه"
  },
  {
    "root": "شتت",
    "words": "شتى أشتاتا لشتى"
  },
  {
    "root": "شتو",
    "words": "الشتاء"
  },
  {
    "root": "شجر",
    "words": "الشجرة شجر كشجرة الشجر والشجرة شجرة والشجر وشجرة شجرها شجرت شجرتها"
  },
  {
    "root": "شحح",
    "words": "الشح أشحة شح"
  },
  {
    "root": "شحم",
    "words": "شحومهما"
  },
  {
    "root": "شحن",
    "words": "المشحون"
  },
  {
    "root": "شخص",
    "words": "تشخص شخصة"
  },
  {
    "root": "شدد",
    "words": "أشد شديد شديدا وأشد أشده الشديد واشدد شداد لشديد اشتدت أشدهما اشدد أشدكم سنشد وشددنا فشدوا أشداء شدادا"
  },
  {
    "root": "شرب",
    "words": "مشربهم واشربوا وأشربوا شرب فشربوا وشرابك شراب للشربين الشراب واشربي ويشرب تشربون شرابه ومشارب وشراب فشربون يشربون يشرب شرابا"
  },
  {
    "root": "شرح",
    "words": "يشرح شرح اشرح نشرح"
  },
  {
    "root": "شرد",
    "words": "فشرد"
  },
  {
    "root": "شرذم",
    "words": "لشرذمة"
  },
  {
    "root": "شرر",
    "words": "شر بشر الشر بالشر شرا لشر الأشرار أشر شره بشرر"
  },
  {
    "root": "شرط",
    "words": "أشراطها"
  },
  {
    "root": "شرع",
    "words": "شرعة شرعا شرع شرعوا شريعة"
  },
  {
    "root": "شرق",
    "words": "المشرق مشرق مشرقين شرقيا شرقية والإشراق وأشرقت المشرقين"
  },
  {
    "root": "شرك",
    "words": "أشركوا المشركين المشركت مشركة مشرك نشرك شركاء تشركوا يشرك تشركون شركاؤكم مشركين أشركتم شركؤا لمشركون لشركائنا لشركائهم شركائهم شركاؤهم أشركنا شريك أشرك يشركون أيشركون شركاءكم للمشركين المشركون وشركاؤكم شركائكم وشركاءكم مشركون أشركتمون شركاءي شركاءهم شركاؤنا وشاركهم وأشركه تشرك لتشرك بشركائهم الشرك والمشركين والمشركت شرك بشرككم مشتركون أشركت وأشرك يشركن"
  },
  {
    "root": "شري",
    "words": "اشتروا تشتروا ليشتروا اشتريه شروا ويشترون يشري يشترون واشتروا يشرون نشتري اشترى وشروه اشتريه يشتري"
  },
  {
    "root": "شطأ",
    "words": "شطئ شطه"
  },
  {
    "root": "شطر",
    "words": "شطر شطره"
  },
  {
    "root": "شطط",
    "words": "شططا تشطط"
  },
  {
    "root": "شعب",
    "words": "شعوبا شعب"
  },
  {
    "root": "شعر",
    "words": "يشعرون تشعرون شعائر المشعر شعئر يشعركم وأشعارها يشعرن شاعر والشعراء الشعر لشاعر الشعرى"
  },
  {
    "root": "شعل",
    "words": "واشتعل"
  },
  {
    "root": "شعيب",
    "words": "شعيبا يشعيب شعيب"
  },
  {
    "root": "شغف",
    "words": "شغفها"
  },
  {
    "root": "شغل",
    "words": "شغل شغلتنا"
  },
  {
    "root": "شفع",
    "words": "شفعة يشفع شفيع شفعاءكم شفعاء فيشفعوا شفعؤنا الشفعة يشفعون شفعين شفعؤا شفعتهم الشفعين والشفع"
  },
  {
    "root": "شفق",
    "words": "مشفقين مشفقون وأشفقن ءأشفقتم بالشفق"
  },
  {
    "root": "شفه",
    "words": "وشفتين"
  },
  {
    "root": "شفو",
    "words": "شفا"
  },
  {
    "root": "شفي",
    "words": "ويشف وشفاء شفاء يشفين"
  },
  {
    "root": "شقق",
    "words": "يشقق شقاق يشاقق شاقوا الشقة شقاقي شقي شقوا أشق بشق تشقون شقيا وتنشق يشقى شقوتنا تشقق وشقاق وشاقوا وانشق انشقت يشاق وانشقت شققنا شقا الأشقى أشقيها"
  },
  {
    "root": "شقو",
    "words": "لتشقى فتشقى"
  },
  {
    "root": "شكر",
    "words": "تشكرون واشكروا شاكر يشكرون الشكرين شكرتم شاكرا بالشكرين شكرين شكور شكورا مشكورا شكرون أشكر ءأشكر شكر يشكر اشكر شكرا الشكور تشكروا"
  },
  {
    "root": "شكس",
    "words": "متشكسون"
  },
  {
    "root": "شكك",
    "words": "شك"
  },
  {
    "root": "شكل",
    "words": "شاكلته شكله"
  },
  {
    "root": "شكو",
    "words": "أشكوا كمشكوة وتشتكي"
  },
  {
    "root": "شمأز",
    "words": "اشمأزت"
  },
  {
    "root": "شمت",
    "words": "تشمت"
  },
  {
    "root": "شمخ",
    "words": "شمخت"
  },
  {
    "root": "شمس",
    "words": "بالشمس الشمس والشمس للشمس شمسا"
  },
  {
    "root": "شمل",
    "words": "اشتملت شمائلهم والشمائل الشمال وشمال بشماله"
  },
  {
    "root": "شنأ",
    "words": "شنآن شنآن شانئك"
  },
  {
    "root": "شهب",
    "words": "شهاب بشهاب وشهبا شهابا"
  },
  {
    "root": "شهد",
    "words": "شهداءكم تشهدون شهداء شهدة شهيدا شهد ويشهد واستشهدوا شهيدين الشهداء للشهدة وأشهدوا شهيد الشهدة واشهد الشهدين اشهدوا فاشهدوا وشهدوا فأشهدوا فاستشهدوا شهدوا بشهيد والشهداء يشهد يشهدون لشهدتنا شهدتهما بالشهدة لتشهدون أشهد والشهدة شهدنا تشهد وأشهدهم شهدين شهودا شاهد الأشهد واشهدوا مشهود وشهد مشهودا أشهدتهم مشهد ليشهدوا وليشهد فشهدة شهدت بالشهداء شهدا وتشهد شهدون شهدتم أشهدوا شهدتهم وشهيد نشهد بشهدتهم يشهده وشاهد ومشهود شهود لشهيد"
  },
  {
    "root": "شهر",
    "words": "شهر الشهر بالشهر أشهر شهرين والشهر الأشهر الشهور شهرا"
  },
  {
    "root": "شهق",
    "words": "وشهيق شهيقا"
  },
  {
    "root": "شهو",
    "words": "الشهوت شهوة يشتهون اشتهت تشتهي تشتهيه"
  },
  {
    "root": "شوب",
    "words": "لشوبا"
  },
  {
    "root": "شور",
    "words": "وتشاور وشاورهم فأشارت شورى"
  },
  {
    "root": "شوظ",
    "words": "شواظ"
  },
  {
    "root": "شوك",
    "words": "الشوكة"
  },
  {
    "root": "شوي",
    "words": "يشوي للشوى"
  },
  {
    "root": "شيأ",
    "words": "شاء شي شئتما شيا شئتم يشاء بشي تشاء يشأ أشياء يشإ نشاء أشياءهم شئت أشاء شئنا لشي يشاءون لشاي نشأ وشي تشاءون"
  },
  {
    "root": "شيب",
    "words": "شيبا وشيبة"
  },
  {
    "root": "شيخ",
    "words": "شيخا شيخ شيوخا"
  },
  {
    "root": "شيد",
    "words": "مشيدة مشيد"
  },
  {
    "root": "شيطن",
    "words": "شيطينهم الشيطن الشيطين شيطنا شيطين شيطن للشيطن والشيطين للشيطين"
  },
  {
    "root": "شيع",
    "words": "شيعا شيع شيعة تشيع شيعته بأشياعهم أشياعكم"
  },
  {
    "root": "ص",
    "words": "ص"
  },
  {
    "root": "صالح",
    "words": "صلحا يصلح صلح"
  },
  {
    "root": "صبأ",
    "words": "والصبين والصبؤن"
  },
  {
    "root": "صبب",
    "words": "يصب صبوا صببنا صبا فصب"
  },
  {
    "root": "صبح",
    "words": "فأصبحتم فأصبح فيصبحوا فأصبحوا أصبحوا الإصباح الصبح مصبحين فتصبح يصبح ليصبحن مصباح المصباح وأصبح تصبحون صباح بمصبيح فتصبحوا صبحهم أصبح فأصبحت والصبح صبحا"
  },
  {
    "root": "صبر",
    "words": "بالصبر نصبر الصبرين أصبرهم والصبرين صبرا تصبروا اصبروا وصابروا فصبروا فاصبروا واصبروا صبروا صبرون صابرة واصبر فاصبر فصبر ويصبر صبرتم صبار ولنصبرن صبرنا وصبروا للصبرين صبرك تصبر صابرا واصطبر أتصبرون الصبرون والصبرت اصبر يصبروا صبر"
  },
  {
    "root": "صبع",
    "words": "أصبعهم"
  },
  {
    "root": "صبغ",
    "words": "صبغة وصبغ"
  },
  {
    "root": "صبو",
    "words": "أصب صبيا"
  },
  {
    "root": "صحب",
    "words": "أصحب والصاحب صحبة أصحب بصاحبهم لصحبه وأصحب يصحبي صاحبه تصحبني يصحبون وصاحبهما بصاحبكم أصحبهم صاحبكم صاحبهم فأصحب لأصحب كصاحب وصحبته بأصحب"
  },
  {
    "root": "صحف",
    "words": "الصحف بصحاف صحف صحفا"
  },
  {
    "root": "صخخ",
    "words": "الصاخة"
  },
  {
    "root": "صخر",
    "words": "الصخرة صخرة الصخر"
  },
  {
    "root": "صدد",
    "words": "وصد تصدون صد يصدون صدودا وبصدهم وصدوا صدوكم ويصدكم وتصدون ليصدوا ويصدون فصدوا تصدونا صديد صددتم يصدنك فصدهم وصدها صددنكم يصدكم ليصدونهم يصدنكم وصدوكم"
  },
  {
    "root": "صدر",
    "words": "صدوركم صدورهم الصدور صدره صدرك صدور صدرا صدري يصدر"
  },
  {
    "root": "صدع",
    "words": "فاصدع يصدعون متصدعا الصدع"
  },
  {
    "root": "صدف",
    "words": "يصدفون وصدف الصدفين"
  },
  {
    "root": "صدق",
    "words": "صدقين مصدقا مصدق صدقوا صدقة صدقتكم الصدقت تصدقوا والصدقين ومصدقا صدق صدقكم صدقتهن والصديقين أصدق يصدقوا بصدقة تصدق صديقة صدقتنا الصدقين صدقهم صدقا لصدقون لنصدقن تصديق فصدقت الصديق وتصدق المتصدقين صديقا صادق صدقنهم صديقكم صديق أصدقت يصدقني وصدق بصدقهم والصدقت والمتصدقين والمتصدقت المصدقين صدقت بالصدق صدقنا صادقا الصدق الصدقون لصادق تصدقون والمصدقت الصديقون فأصدق وصدقت يصدقون"
  },
  {
    "root": "صرح",
    "words": "الصرح صرح صرحا"
  },
  {
    "root": "صرخ",
    "words": "بمصرخكم بمصرخي يستصرخه يصطرخون صريخ"
  },
  {
    "root": "صرر",
    "words": "صر يصروا يصر صرة يصرون وأصروا"
  },
  {
    "root": "صرصر",
    "words": "صرصرا صرصر"
  },
  {
    "root": "صرط",
    "words": "الصرط صرط صرطا صرطي صرطك"
  },
  {
    "root": "صرع",
    "words": "صرعى"
  },
  {
    "root": "صرف",
    "words": "وتصريف صرفكم يصرف نصرف صرفت سأصرف انصرفوا صرف تصرفون مصروفا لنصرف تصرف فصرف صرفنا مصرفا وصرفنا ويصرفه صرفا صرفنه اصرف يصرفون"
  },
  {
    "root": "صرم",
    "words": "ليصرمنها كالصريم صرمين"
  },
  {
    "root": "صعد",
    "words": "تصعدون صعيدا يصعد صعدا صعودا"
  },
  {
    "root": "صعر",
    "words": "تصعر"
  },
  {
    "root": "صعق",
    "words": "الصوعق الصعقة صعقا فصعق صعقة يصعقون"
  },
  {
    "root": "صغر",
    "words": "صغيرا صغار الصغرين صغرين صغرون صغيرة أصغر صغير"
  },
  {
    "root": "صغو",
    "words": "ولتصغى صغت"
  },
  {
    "root": "صفح",
    "words": "واصفحوا واصفح فاصفح الصفح وليصفحوا صفحا وتصفحوا"
  },
  {
    "root": "صفد",
    "words": "الأصفاد"
  },
  {
    "root": "صفر",
    "words": "صفراء مصفرا صفر"
  },
  {
    "root": "صفصف",
    "words": "صفصفا"
  },
  {
    "root": "صفف",
    "words": "صفا صواف صفت والصفت الصافون مصفوفة"
  },
  {
    "root": "صفن",
    "words": "الصفنت"
  },
  {
    "root": "صفو",
    "words": "اصطفينه اصطفى الصفا اصطفيه صفوان اصطفيك واصطفيك اصطفيتك أفأصفيكم يصطفي اصطفينا أصطفى المصطفين لاصطفى وأصفيكم مصفى"
  },
  {
    "root": "صكك",
    "words": "فصكت"
  },
  {
    "root": "صلب",
    "words": "أصلبكم صلبوه يصلبوا لأصلبنكم فيصلب ولأصلبنكم الصلب"
  },
  {
    "root": "صلح",
    "words": "مصلحون الصلحت صلحا الصلحين وأصلحوا فأصلح إصلاح المصلح وتصلحوا إصلحا وأصلحا فالصلحت والصلحين إصلح يصلحا والصلح تصلحوا وأصلح إصلحها الصلحون المصلحين صلح يصلح الإصلح صلحين بالصلحين وأصلحنا يصلحون الصلح ويصلح فأصلحوا وصلح"
  },
  {
    "root": "صلد",
    "words": "صلدا"
  },
  {
    "root": "صلصال",
    "words": "صلصل"
  },
  {
    "root": "صلو",
    "words": "الصلوة والصلوة مصلى صلوت الصلوت يصلى يصلوا فليصلوا صلاتهم صلاتي تصل وصلوت صلوتك أصلوتك بصلاتك بالصلوة صلوتهم صلاته صلوة صلوا للصلوة المصلين صلى فصلى للمصلين فصل"
  },
  {
    "root": "صلي",
    "words": "وسيصلون نصليه نصليهم ونصله يصلونها يصليها صليا تصطلون اصلوها صال صالوا وتصلية صلوه سأصليه لصالوا ويصلى يصلى تصلى سيصلى"
  },
  {
    "root": "صمت",
    "words": "صمتون"
  },
  {
    "root": "صمد",
    "words": "الصمد"
  },
  {
    "root": "صمم",
    "words": "صم وصموا الصم والأصم وصما صما فأصمهم"
  },
  {
    "root": "صنع",
    "words": "يصنعون يصنع صنعوا واصنع ويصنع صنعا ولتصنع واصطنعتك صنعة اصنع مصانع صنع تصنعون"
  },
  {
    "root": "صنم",
    "words": "أصناما أصنام الأصنام أصنمكم"
  },
  {
    "root": "صنو",
    "words": "صنوان"
  },
  {
    "root": "صهر",
    "words": "يصهر وصهرا"
  },
  {
    "root": "صوب",
    "words": "كصيب أصبتهم مصيبة فأصابه أصابها يصبها وأصابه فأصابها أصابت تصبكم أصابهم أصبكم أصبتكم أصبتم تصبهم أصابك يصيبهم تصيبنا فأصبتكم سيصيب أصبنهم أصيب تصيبن تصبك يصيبنا يصيبكم يصيب مصيبها أصاب نصيب فيصيب تصيبهم فأصابهم أصابه أصابته سيصيبهم يصبكم فتصيبكم تصيبوا صوابا"
  },
  {
    "root": "صوت",
    "words": "بصوتك الأصوات صوتك الأصوت لصوت أصوتكم صوت أصوتهم"
  },
  {
    "root": "صور",
    "words": "فصرهن يصوركم الصور صورنكم وصوركم صوركم المصور صورة"
  },
  {
    "root": "صوع",
    "words": "صواع"
  },
  {
    "root": "صوف",
    "words": "أصوافها"
  },
  {
    "root": "صوم",
    "words": "الصيام تصوموا فليصمه صيام فصيام صياما صوما والصئمين والصئمت"
  },
  {
    "root": "صومع",
    "words": "صومع"
  },
  {
    "root": "صيح",
    "words": "الصيحة صيحة"
  },
  {
    "root": "صيد",
    "words": "الصيد فاصطادوا صيد"
  },
  {
    "root": "صير",
    "words": "المصير مصيرا مصيركم ومصيرا تصير"
  },
  {
    "root": "صيص",
    "words": "صياصيهم"
  },
  {
    "root": "صيف",
    "words": "والصيف"
  },
  {
    "root": "ضأن",
    "words": "الضأن"
  },
  {
    "root": "ضبح",
    "words": "ضبحا"
  },
  {
    "root": "ضجع",
    "words": "مضاجعهم المضاجع"
  },
  {
    "root": "ضحك",
    "words": "فليضحكوا فضحكت تضحكون ضاحكا يضحكون أضحك وتضحكون ضاحكة"
  },
  {
    "root": "ضحو",
    "words": "ضحى تضحى ضحيها وضحيها والضحى"
  },
  {
    "root": "ضدد",
    "words": "ضدا"
  },
  {
    "root": "ضرب",
    "words": "يضرب اضرب وضربت اضربوه ضربا ضربت ضربوا واضربوهن ضربتم فاضربوا واضربوا يضربون ضرب ويضرب وضربنا تضربوا وضرب فضربنا واضرب فاضرب وليضربن يضربن ضربنا نضربها أفنضرب ضربوه فضرب"
  },
  {
    "root": "ضرر",
    "words": "بضارين يضرهم والضراء ضرارا تضار يضار يضروكم يضركم يضر يضروا مضار الضرر يضرونك يضروك ضرا بضر يضرنا الضراء تضروه الضر ضره ضر ضراء يضرك تضرونه يضره يضرون بضارهم تضاروهن"
  },
  {
    "root": "ضرع",
    "words": "يتضرعون تضرعوا تضرعا يضرعون ضريع"
  },
  {
    "root": "ضعف",
    "words": "فيضعفه أضعافا يضعف ضعفين ضعفاء ضعيفا أضعفا مضعفة ضعفوا ضعفا يضعفها والمستضعفين مستضعفين المستضعفين ضعف استضعفوا يستضعفون استضعفوني مستضعفون الضعفاء الضعفؤا وضعف وأضعف يستضعف المضعفون الضعف يضعفه أضعف"
  },
  {
    "root": "ضغث",
    "words": "أضغث ضغثا"
  },
  {
    "root": "ضغن",
    "words": "أضغنهم أضغنكم"
  },
  {
    "root": "ضفدع",
    "words": "والضفادع"
  },
  {
    "root": "ضلل",
    "words": "الضالين الضللة يضل ضل تضل يضلونكم يضلون الضالون ضلل تضلوا يضلهم ضللا أضل يضلل يضلوك ولأضلنهم ضلوا وأضل وأضلوا وضلوا وضل يضلله ضللت ليضلون يضله ليضل أضلونا ضللة الضلل ليضلوا ضللك فيضل ويضل أضللن يضلونهم فضلوا المضلين وأضلهم ضالين أضللتم أضلني ليضلنا أضلنا ضللتهم مضل ضللنا فأضلونا والضلل فيضلك أضلانا وأضله لضالون أضلوا يضلوا ضالا تضليل"
  },
  {
    "root": "ضمر",
    "words": "ضامر"
  },
  {
    "root": "ضمم",
    "words": "واضمم"
  },
  {
    "root": "ضنك",
    "words": "ضنكا"
  },
  {
    "root": "ضنن",
    "words": "بضنين"
  },
  {
    "root": "ضهأ",
    "words": "يضهؤن"
  },
  {
    "root": "ضوأ",
    "words": "أضاءت أضاء ضياء وضياء يضي بضياء"
  },
  {
    "root": "ضيز",
    "words": "ضيزى"
  },
  {
    "root": "ضيع",
    "words": "ليضيع يضيع أضيع نضيع أضاعوا"
  },
  {
    "root": "ضيف",
    "words": "ضيفي ضيف يضيفوهما ضيفه"
  },
  {
    "root": "ضيق",
    "words": "ضيقا وضاقت ضاقت وضائق وضاق يضيق ضيق ويضيق لتضيقوا"
  },
  {
    "root": "طالوت",
    "words": "طالوت"
  },
  {
    "root": "طبع",
    "words": "طبع ونطبع يطبع وطبع نطبع فطبع"
  },
  {
    "root": "طبق",
    "words": "طباقا طبقا طبق"
  },
  {
    "root": "طحو",
    "words": "طحيها"
  },
  {
    "root": "طرح",
    "words": "اطرحوه"
  },
  {
    "root": "طرد",
    "words": "تطرد فتطردهم بطارد طردتهم"
  },
  {
    "root": "طرف",
    "words": "طرفا طرفي أطرافها طرفهم وأطراف طرفك الطرف طرف"
  },
  {
    "root": "طرق",
    "words": "طريقا طريق بطريقتكم طريقة طرائق الطريقة والطارق الطارق"
  },
  {
    "root": "طرو",
    "words": "طريا"
  },
  {
    "root": "طس",
    "words": "طس"
  },
  {
    "root": "طسم",
    "words": "طسم"
  },
  {
    "root": "طعم",
    "words": "طعام يطعمه طعامك الطعام وطعام وطعامكم إطعام تطعمون طعموا وطعامه يطعم يطعمها طاعم طعاما استطعما وأطعموا يطعمني طعمتم أنطعم أطعمه طعمه يطعمون فإطعام وطعاما نطعم ويطعمون نطعمكم طعامه إطعم أطعمهم"
  },
  {
    "root": "طعن",
    "words": "وطعنا وطعنوا"
  },
  {
    "root": "طغى",
    "words": "طغينهم بالطغوت الطغوت والطغوت طغينا طغينا تطغوا طغى يطغى طغين للطغين أطغيته طاغون وأطغى بالطاغية طغوا بطغويها ليطغى"
  },
  {
    "root": "طفأ",
    "words": "أطفأها يطفؤا ليطفؤا"
  },
  {
    "root": "طفف",
    "words": "للمطففين"
  },
  {
    "root": "طفق",
    "words": "وطفقا فطفق"
  },
  {
    "root": "طفل",
    "words": "طفلا الطفل الأطفل"
  },
  {
    "root": "طلب",
    "words": "يطلبه طلبا الطالب والمطلوب"
  },
  {
    "root": "طلح",
    "words": "وطلح"
  },
  {
    "root": "طلع",
    "words": "ليطلعكم تطلع طلعها طلعت اطلعت مطلع أطلع طلوع مطلعون فاطلع فأطلع طلع"
  },
  {
    "root": "طلق",
    "words": "الطلق والمطلقت طلقها طلقتم طلقتموهن وللمطلقت فانطلقا ينطلق وانطلق انطلقتم فطلقوهن طلقكن فانطلقوا انطلقوا"
  },
  {
    "root": "طلل",
    "words": "فطل"
  },
  {
    "root": "طمأن",
    "words": "ليطمئن ولتطمئن اطمأننتم وتطمئن واطمأنوا تطمئن مطمئن مطمئنة مطمئنين اطمأن المطمئنة"
  },
  {
    "root": "طمث",
    "words": "يطمثهن"
  },
  {
    "root": "طمس",
    "words": "نطمس اطمس لطمسنا فطمسنا طمست"
  },
  {
    "root": "طمع",
    "words": "أفتطمعون ونطمع يطمعون وطمعا نطمع أطمع فيطمع أيطمع يطمع"
  },
  {
    "root": "طمم",
    "words": "الطامة"
  },
  {
    "root": "طه",
    "words": "طه"
  },
  {
    "root": "طهر",
    "words": "مطهرة طهرا يطهرن تطهرن المتطهرين وأطهر وطهرك ومطهرك فاطهروا ليطهركم يطهر يتطهرون تطهرهم يتطهروا المطهرين أطهر وطهر طهورا ويطهركم تطهيرا المطهرون فطهر"
  },
  {
    "root": "طود",
    "words": "كالطود"
  },
  {
    "root": "طور",
    "words": "الطور طور والطور أطوارا وطور"
  },
  {
    "root": "طوع",
    "words": "تطوع استطعوا يستطيعون يستطيع وأطعنا أطيعوا وأطيعون طوعا استطاع تطيعوا وأطيعوا أطاعونا يطع يستطع أطعنكم ليطاع أطاع طاعة تستطيعوا فطوعت استطعت تطع أطعتموهم استطعتم استطعنا ويطيعون المطوعين تستطيع تستطع تسطع اسطعوا أطعتم تطيعوه تستطيعون تطعهما وأطعن أطعنا يطاع طائعين فأطاعوه سنطيعكم يطيعكم نطيع مطاع تطعه"
  },
  {
    "root": "طوف",
    "words": "للطائفين يطوف طائفة طائفتان وطائفة طائفتين الطوفان طئف الطائفتين وليطوفوا طوفون يطاف ويطوف يطوفون فطاف طائف ويطاف"
  },
  {
    "root": "طوق",
    "words": "يطيقونه طاقة سيطوقون"
  },
  {
    "root": "طول",
    "words": "طولا الطول أفطال طال فتطاول فطال طويلا"
  },
  {
    "root": "طوي",
    "words": "طوى نطوي كطي مطويت"
  },
  {
    "root": "طيب",
    "words": "طيبت طيبا طيبة الطيب بالطيب طاب طبن الطيبت والطيب والطيبت طوبى طيبين للطيبين والطيبون للطيبت طبتم طيبتكم"
  },
  {
    "root": "طير",
    "words": "الطير طيرا طئر يطير يطيروا طئرهم طئره والطير اطيرنا طئركم تطيرنا طير مستطيرا"
  },
  {
    "root": "طين",
    "words": "الطين طين طينا"
  },
  {
    "root": "ظعن",
    "words": "ظعنكم"
  },
  {
    "root": "ظفر",
    "words": "ظفر أظفركم"
  },
  {
    "root": "ظلل",
    "words": "وظللنا ظلل ظلا ظليلا ظلة وظللهم وظلها فظلوا ظلله ظل ظللا ظلت الظل فظلت فنظل الظلة لظلوا كالظلل فيظللن وظل فظلتم ظللها ظليل"
  },
  {
    "root": "ظلم",
    "words": "ظلمت أظلم الظلمين ظلمون ظلمتم ظلمونا يظلمون ظلموا بالظلمين الظلمون ظلم الظلمت للظلمين تظلمون ظلما ظلمهم بظلام وظلما يظلم الظالم ظالمي بظلمهم فبظلم وظلموا ظلمه بظلم ظلمين ظلمنا فظلموا تظلموا ليظلمهم مظلما ظلمنهم ظلمة لظلمون لظلوم لظلمين مظلوما تظلم ظالم ظالمة كظلمت لظلم ظلوما مظلمون وظالم ظلمك والظلمون والظلمين"
  },
  {
    "root": "ظمأ",
    "words": "ظمأ تظمؤا الظمآن"
  },
  {
    "root": "ظنن",
    "words": "يظنون ظنا ظن الظن لنظنك وظنوا وظن نظنكم وتظنون لأظنك أظن فظنوا فظن يظن نظنك لأظنه الظنونا ظنه ظنكم ظننتم نظن الظانين وظننتم ظننت ظننا ظنوا تظن"
  },
  {
    "root": "ظهر",
    "words": "تظهرون ظهورهم ظهورها ظهوركم ظهر ظهورهما يظهروا ليظهره وظهورهم وظهر ظهريا بظهر ظهيرا ظهرا يظهروه الظهيرة تظهرا ظهرة ظهروهم ظهير ظهرها يظهر ظهرين ظهره ظهوره يظهرون والظهر وظهره وظهروا وأظهره ظهرك"
  },
  {
    "root": "عاد",
    "words": "عاد وعاد عادا لعاد وعادا بعاد"
  },
  {
    "root": "عبأ",
    "words": "يعبؤا"
  },
  {
    "root": "عبث",
    "words": "عبثا"
  },
  {
    "root": "عبد",
    "words": "نعبد اعبدوا عبدنا تعبدون عباده عبدون والعبد بالعبد عبادي بالعباد ولعبد فاعبدوه عبادا للعبيد واعبدوا عبادك عبدا عبادته وعبد أتعبدون أعبد لعباده لنعبد يعبد عباد ليعبدوا العبدون ويعبدون عبادتكم تعبدوا يعبدون فاعبده عبادنا لعبادي واعبد بعبده بعباده عبده بعبادة عبد تعبد لعبدته بعبادتهم فاعبدني بعبادي فاعبدون عبدين أفتعبدون للعبدين عبادكم يعبدونني وعباد عبدت واعبدوه يعبادي العباد اعبدوني لعبادنا العبد فاعبد نعبدهم يعباد فاعبدوا يعبدوها للعباد عبادتي عبدنهم العبدين ليعبدون عبدي فليعبدوا عابد عبدتم"
  },
  {
    "root": "عبر",
    "words": "لعبرة عابري تعبرون عبرة فاعتبروا"
  },
  {
    "root": "عبس",
    "words": "عبس عبوسا"
  },
  {
    "root": "عبقر",
    "words": "وعبقري"
  },
  {
    "root": "عتب",
    "words": "يستعتبون يستعتبوا المعتبين"
  },
  {
    "root": "عتد",
    "words": "أعتدنا وأعتدنا وأعتدت عتيد"
  },
  {
    "root": "عتق",
    "words": "العتيق"
  },
  {
    "root": "عتل",
    "words": "فاعتلوه عتل"
  },
  {
    "root": "عتو",
    "words": "وعتوا عتوا عتيا وعتو فعتوا عتت عتو عاتية"
  },
  {
    "root": "عثر",
    "words": "عثر أعثرنا"
  },
  {
    "root": "عثو",
    "words": "تعثوا"
  },
  {
    "root": "عجب",
    "words": "يعجبك أعجبتكم أعجبكم أعجبك أوعجبتم تعجبك عجبا عجيب أتعجبين تعجب فعجب عجبت وعجبوا عجاب يعجب عجبوا تعجبون أعجب"
  },
  {
    "root": "عجز",
    "words": "أعجزت بمعجزين يعجزون معجزي معجزين عجوز عجوزا ليعجزه بمعجز أعجاز نعجز نعجزه"
  },
  {
    "root": "عجف",
    "words": "عجاف"
  },
  {
    "root": "عجل",
    "words": "العجل تعجل تستعجلون عجلا أعجلتم يعجل استعجالهم يستعجل بعجل ويستعجلونك تستعجلوه عجولا العاجلة عجلنا لعجل أعجلك وعجلت عجل يستعجلون يستعجلونك استعجلتم تستعجل فعجل لتعجل"
  },
  {
    "root": "عجم",
    "words": "أعجمي الأعجمين أعجميا آعجمي"
  },
  {
    "root": "عدد",
    "words": "أعدت معدودة معدودت فعدة العدة وأعد أعد وأعدوا عدة لأعدوا عدد معدود تعدوا عددا بعدتهم نعد عدا وعدهم تعدون العادين تعتدونها نعدهم لعدتهن فعدتهن عدتهم وعدده"
  },
  {
    "root": "عدس",
    "words": "وعدسها"
  },
  {
    "root": "عدل",
    "words": "عدل بالعدل تعدلوا اعدلوا يعدلون تعدل وعدلا فاعدلوا لأعدل فعدلك"
  },
  {
    "root": "عدن",
    "words": "عدن"
  },
  {
    "root": "عدو",
    "words": "عدو يعتدون اعتدوا والعدون عدوا عاد اعتدى تعتدوا المعتدين عدون فاعتدوا تعتدوها يتعد لتعتدوا أعداء ويتعد عدونا بأعدائكم تعدوا العداوة العدوة عدوة اعتدينا بالمعتدين عدوكم الأعداء يعدون بالعدوة وعدوكم المعتدون وعدوا تعد وعدو العادون عادون عدوه معتد عدوي عاديتم عدوهم العدو والعديت"
  },
  {
    "root": "عذب",
    "words": "عذاب العذاب والعذاب ويعذب بعذاب فأعذبهم عذابا يعذبهم بعذابكم فيعذبهم يعذبكم يعذب أعذبه تعذبهم وعذاب عذابي معذبهم ليعذبهم وعذب نعذب سنعذبهم عذابه ولعذاب معذبين معذبوها تعذب نعذبه فيعذبه بالعذاب عذابهما عذب عذابها بمعذبين أفبعذابنا المعذبين لأعذبنه كعذاب ليعذب يعذبه لعذبنا يعذبنا لعذبهم وعذبنها وعذابا"
  },
  {
    "root": "عذر",
    "words": "معذرة تعتذروا المعذرون يعتذرون عذرا معذرتهم معاذيره فيعتذرون"
  },
  {
    "root": "عرب",
    "words": "الأعراب عربيا عربي وعربي عربا"
  },
  {
    "root": "عرج",
    "words": "يعرجون الأعرج يعرج ومعارج المعارج تعرج"
  },
  {
    "root": "عرجن",
    "words": "كالعرجون"
  },
  {
    "root": "عرر",
    "words": "والمعتر معرة"
  },
  {
    "root": "عرش",
    "words": "عروشها معروشت العرش يعرشون عرشه عرش بعرشها عرشها عرشك"
  },
  {
    "root": "عرض",
    "words": "عرضهم معرضون عرضة عرضتم عرضها فأعرضوا فأعرض عرض إعراضا تعرضوا أعرض تعرض معرضين إعراضهم وأعرض عرضا لتعرضوا يعرضون تعرضن أعرضتم وعرضوا وعرضنا أعرضوا عرضنا عريض يعرض عارضا عارض يعرضوا كعرض تعرضون"
  },
  {
    "root": "عرف",
    "words": "عرفوا يعرفونه يعرفون بالمعروف عرفت بمعروف معروفا معروف تعرفهم الأعراف يعرفونهم بالعرف المعروف اعترفوا يتعارفون فعرفهم يعرفونها تعرف يعرفوا معروفة فتعرفونها يعرفن فاعترفنا عرفها فلعرفتهم ولتعرفنهم لتعارفوا يعرف عرف فاعترفوا عرفا"
  },
  {
    "root": "عرم",
    "words": "العرم"
  },
  {
    "root": "عرو",
    "words": "بالعروة"
  },
  {
    "root": "عري",
    "words": "اعتريك تعرى بالعراء"
  },
  {
    "root": "عزب",
    "words": "يعزب"
  },
  {
    "root": "عزر",
    "words": "وعزرتموهم وعزروه وتعزروه"
  },
  {
    "root": "عزز",
    "words": "العزيز العزة عزيز وتعز عزيزا أعزة بعزيز أعز وأعز عزا بعزة فعززنا عزة وعزني فبعزتك والعزى الأعز"
  },
  {
    "root": "عزل",
    "words": "فاعتزلوا اعتزلوكم يعتزلوكم معزل اعتزلتموهم وأعتزلكم اعتزلهم لمعزولون عزلت فاعتزلون"
  },
  {
    "root": "عزم",
    "words": "عزموا تعزموا عزمت عزم عزما العزم"
  },
  {
    "root": "عزو",
    "words": "عزين"
  },
  {
    "root": "عزير",
    "words": "عزير"
  },
  {
    "root": "عسر",
    "words": "العسر عسرة العسرة عسرا عسيرا عسر تعاسرتم عسير للعسرى"
  },
  {
    "root": "عسعس",
    "words": "عسعس"
  },
  {
    "root": "عسق",
    "words": "عسق"
  },
  {
    "root": "عسل",
    "words": "عسل"
  },
  {
    "root": "عسى",
    "words": "وعسى عسيتم فعسى عسى"
  },
  {
    "root": "عشر",
    "words": "عشرة وعشرا وعاشروهن عشر يمعشر بعشر عشرون وعشيرتكم عشرا العشير عشيرتك معشار عشيرتهم العشار"
  },
  {
    "root": "عشو",
    "words": "بالعشي والعشي عشاء وعشيا العشاء يعش عشية"
  },
  {
    "root": "عصب",
    "words": "عصيب عصبة بالعصبة"
  },
  {
    "root": "عصر",
    "words": "إعصار أعصر يعصرون المعصرت والعصر"
  },
  {
    "root": "عصف",
    "words": "عاصف عاصفة العصف فالعصفت عصفا كعصف"
  },
  {
    "root": "عصم",
    "words": "يعتصم واعتصموا يعصمك عاصم يعصمني فاستعصم يعصمكم بعصم"
  },
  {
    "root": "عصو",
    "words": "-"
  },
  {
    "root": "عصي",
    "words": "عصوا وعصينا وعصيتم يعص وعصوا عصيت عصيته عصاني أعصي عصيا أفعصيت وعصى عصوك والعصيان ومعصيت يعصينك يعصون فعصوا عصوني فعصى"
  },
  {
    "root": "عضد",
    "words": "عضدا عضدك"
  },
  {
    "root": "عضض",
    "words": "عضوا عضين يعض"
  },
  {
    "root": "عضل",
    "words": "تعضلوهن"
  },
  {
    "root": "عطف",
    "words": "عطفه"
  },
  {
    "root": "عطل",
    "words": "معطلة عطلت"
  },
  {
    "root": "عطو",
    "words": "يعطوا أعطوا عطاء أعطى عطاؤنا وأعطى فتعاطى يعطيك أعطينك"
  },
  {
    "root": "عظم",
    "words": "عظيم العظيم العظام عظيما بعظم أعظم عظما العظم يعظم وعظما ويعظم وأعظم عظامه"
  },
  {
    "root": "عفرت",
    "words": "عفريت"
  },
  {
    "root": "عفف",
    "words": "التعفف فليستعفف وليستعفف يستعففن"
  },
  {
    "root": "عفو",
    "words": "عفونا فاعفوا عفي وعفا العفو يعفون يعفوا تعفوا واعف والعافين عفا فاعف عفوا يعفو فعفونا ويعفوا نعف لعفو وليعفوا ويعف"
  },
  {
    "root": "عقب",
    "words": "عقبيه العقاب عقبة أعقبكم أعقابنا والعقبة فأعقبهم العقبة معقبت عقبى عقاب وعقبى معقب عاقبتم فعاقبوا عوقبتم عقبا عاقب عوقب يعقب عقبه عقبتهما فعاقبتم عقبها"
  },
  {
    "root": "عقد",
    "words": "عقدة عقدت بالعقود عقدتم العقد"
  },
  {
    "root": "عقر",
    "words": "عاقر فعقروا فعقروها عاقرا فعقر"
  },
  {
    "root": "عقل",
    "words": "تعقلون عقلوه يعقلون يعقلها نعقل"
  },
  {
    "root": "عقم",
    "words": "عقيم عقيما العقيم"
  },
  {
    "root": "عكف",
    "words": "والعكفين عكفون يعكفون عكفين عاكفا العكف معكوفا"
  },
  {
    "root": "عل",
    "words": "لعلكم ولعلكم لعلهم ولعلهم فلعلك لعلى لعله لعلك لعلنا لعل"
  },
  {
    "root": "علق",
    "words": "كالمعلقة علقة العلقة علق"
  },
  {
    "root": "علم",
    "words": "العلمين يعلمون تعلمون فيعلمون عليم أعلم وعلم علم علمتنا العليم وأعلم علمتم يعلم يعلمان فيتعلمون ويتعلمون علموا تعلم العلم ويعلمهم لنعلم ليعلمون ويعلمكم واعلموا معلومت يعلمه فاعلموا علمكم وعلمه علمه واعلم ويعلم ويعلمه للعلمين وليعلم نعلم عليما تعلموا لعلمه وعلمك بعلمه تعلمونهن فاعلم ليعلم لتعلموا اعلموا علمتك ونعلم علمته بأعلم يعلمها علما وعلمتم بعلم أتعلمون علمها تعلمونهم يعلمهم وتعلم يعلموا تعلمهم نعلمهم تعلمها علمت لتعلم ويعلمك ولنعلمه وعلما علمني بعلمين علمنا علمنه وعلمتني وسيعلم وليعلموا معلوم المعلوم وعلمت ولتعلموا ليعلموا وعلمنه تعلمن فسيعلمون ولتعلمن فستعلمون علمين لعليم ويعلمون علمي علمؤا علمهم ولتعلم فعلموا فليعلمن وليعلمن العلمون العلمؤا كالأعلم لعلم معلم فعلم تعلموهم سيعلمون علمتموهن"
  },
  {
    "root": "علن",
    "words": "يعلنون وعلانية نعلن تعلنون أعلنتم أعلنت"
  },
  {
    "root": "علو",
    "words": "العلى تعالوا الأعلون عليا وتعلى فتعلى العليا لعال عليها المتعال تعلى الأعلى ولتعلن علوا استعلى عالين ولعلا وعلوا تعلوا علا فتعالين العالين على لعلى عاليا عالية عليهم عليين عليون"
  },
  {
    "root": "على",
    "words": "عليهم على وعلى عليه عليكم علينا عليها عليهن عليهما عليك وعليها فعليهن فعليها فعليكم فعلى فعليه وعليه وعلينا فعليهم لعلى وعليكم وعليهم عليكما"
  },
  {
    "root": "عمد",
    "words": "متعمدا عمد تعمدت العماد"
  },
  {
    "root": "عمر",
    "words": "يعمر اعتمر والعمرة بالعمرة يعمروا وعمارة عمرا واستعمركم لعمرك العمر نكسوا عمرك وعمروها عمروها ناكسوا معمر عمره نعمركم نعمره ننكسه المعمور"
  },
  {
    "root": "عمران",
    "words": "عمرن"
  },
  {
    "root": "عمق",
    "words": "عميق"
  },
  {
    "root": "عمل",
    "words": "وعملوا وعمل تعملون يعملون أعملنا أعملكم أعملهم عملت العملين عمل يعمل عمله عملهم عملوا اعملوا عامل فنعمل نعمل والعملين عملكم عملا عملي أعمل عملون أعملا فليعمل تعمل ويعملون واعملوا لعملكم وتعمل اعمل والعمل عملته العملون عملك فاعمل عملتم ويعمل وعمله عاملة"
  },
  {
    "root": "عمم",
    "words": "وعمتكم أعممكم عمتكم عمك عمتك"
  },
  {
    "root": "عمه",
    "words": "يعمهون"
  },
  {
    "root": "عمي",
    "words": "عمى فعموا عموا الأعمى عمين العمى كالأعمى فعميت أعمى عميا تعمى وعميانا عمون وأعمى"
  },
  {
    "root": "عن",
    "words": "عنها عن عنكم عما عنهم عنك عني عنا عنهما عنه وعن عم"
  },
  {
    "root": "عنب",
    "words": "وأعناب أعناب أعنب والأعنب وعنب وأعنب وأعنبا وعنبا"
  },
  {
    "root": "عنت",
    "words": "لأعنتكم عنتم العنت لعنتم"
  },
  {
    "root": "عند",
    "words": "عند عنده عندها عندنا عندك فعند عندهم وعندهم عندي وعنده عندكم وعند عنيد وعندنا أعنده عنيدا"
  },
  {
    "root": "عنق",
    "words": "الأعناق أعناقهم عنقه عنقك أعنقهم أعناق والأعناق"
  },
  {
    "root": "عنكب",
    "words": "العنكبوت"
  },
  {
    "root": "عنو",
    "words": "وعنت"
  },
  {
    "root": "عهد",
    "words": "عهد بعهدي بعهدكم عهدا عهده عهدوا عهدي وعهدنا بعهدهم بعهده بعهد وبعهد عهدت عهدهم عهدتم بالعهد العهد عهدنا وعهدهم أعهد"
  },
  {
    "root": "عهن",
    "words": "كالعهن"
  },
  {
    "root": "عوج",
    "words": "عوجا عوج"
  },
  {
    "root": "عود",
    "words": "عاد عيدا لعادوا تعودون لتعودن عدنا نعود تعودوا نعد يعودوا يعيده عدتم يعيدنا يعيدكم يعيدوكم سنعيدها نعيدكم نعيده أعيدوا معاد يعيد عائدون يعودون ويعيد"
  },
  {
    "root": "عوذ",
    "words": "أعوذ أعيذها فاستعذ معاذ وأعوذ عذت يعوذون"
  },
  {
    "root": "عور",
    "words": "عورت عورة بعورة"
  },
  {
    "root": "عوق",
    "words": "المعوقين"
  },
  {
    "root": "عول",
    "words": "تعولوا عيلة عائلا"
  },
  {
    "root": "عوم",
    "words": "عام عامهم عاما عامين"
  },
  {
    "root": "عون",
    "words": "نستعين واستعينوا عوان استعينوا وتعاونوا تعاونوا المستعان فأعينوني وأعانه"
  },
  {
    "root": "عيب",
    "words": "أعيبها"
  },
  {
    "root": "عير",
    "words": "العير والعير"
  },
  {
    "root": "عيسى",
    "words": "عيسى وعيسى يعيسى بعيسى"
  },
  {
    "root": "عيش",
    "words": "معيش معيشة معيشتها معيشتهم عيشة معاشا"
  },
  {
    "root": "عين",
    "words": "عينا العين والعين بالعين أعينهم أعين أعينكم وأعينهم بأعيننا عيناه وعيون عينيك عيناك عين عيني عينها أعينهن العيون الأعين عيونا عينان عينين"
  },
  {
    "root": "عيي",
    "words": "يعي أفعيينا"
  },
  {
    "root": "غبث",
    "words": "تعبثون"
  },
  {
    "root": "غبر",
    "words": "الغبرين غبرة"
  },
  {
    "root": "غبن",
    "words": "التغابن"
  },
  {
    "root": "غثو",
    "words": "غثاء"
  },
  {
    "root": "غدر",
    "words": "نغادر يغادر"
  },
  {
    "root": "غدق",
    "words": "غدقا"
  },
  {
    "root": "غدو",
    "words": "غدوت بالغدوة بالغدو غدا غداءنا غدوها غدوا لغد اغدوا وغدوا"
  },
  {
    "root": "غرب",
    "words": "والمغرب المغرب غرابا الغراب ومغربها غربت مغرب تغرب غروبها غربية الغربي وغرابيب الغروب المغربين"
  },
  {
    "root": "غرر",
    "words": "وغرهم الغرور يغرنك غرورا وغرتهم بغرور غر تغرنكم يغرنكم يغررك وغرتكم وغركم غرور غرك"
  },
  {
    "root": "غرف",
    "words": "اغترف غرفة الغرفة غرفا الغرفت غرف"
  },
  {
    "root": "غرق",
    "words": "وأغرقنا فأغرقنهم الغرق مغرقون المغرقين فيغرقكم فأغرقنه لتغرق أغرقنهم أغرقنا نغرقهم أغرقوا غرقا"
  },
  {
    "root": "غرم",
    "words": "والغرمين مغرما غراما مغرم لمغرمون"
  },
  {
    "root": "غرو",
    "words": "فأغرينا لنغرينك"
  },
  {
    "root": "غزل",
    "words": "غزلها"
  },
  {
    "root": "غزو",
    "words": "غزى"
  },
  {
    "root": "غسق",
    "words": "غسق وغساق وغساقا غاسق"
  },
  {
    "root": "غسل",
    "words": "تغتسلوا فاغسلوا مغتسل غسلين"
  },
  {
    "root": "غشو",
    "words": "غشوة يغشى غواش تغشيها يغشيكم أغشيت يستغشون غشية وتغشى فغشيهم غشيهم يغشيه يغشيهم فأغشينهم المغشي فغشيها غشى واستغشوا الغشية يغشيها"
  },
  {
    "root": "غصب",
    "words": "غصبا"
  },
  {
    "root": "غصص",
    "words": "غصة"
  },
  {
    "root": "غضب",
    "words": "المغضوب بغضب غضب وغضب غضبن الغضب غضبي مغضبا غضبوا"
  },
  {
    "root": "غضض",
    "words": "يغضوا يغضضن واغضض يغضون"
  },
  {
    "root": "غطش",
    "words": "وأغطش"
  },
  {
    "root": "غطو",
    "words": "غطاء غطاءك"
  },
  {
    "root": "غفر",
    "words": "نغفر غفور بالمغفرة واستغفروا والمغفرة ومغفرة مغفرة فيغفر غفرانك واغفر فاغفر والمستغفرين ويغفر يغفر فاستغفروا اغفر لمغفرة واستغفر غفورا يستغفر ليغفر ويستغفرونه تغفر لغفور الغفرين سيغفر يستغفرون استغفر تستغفر يستغفروا استغفار الغفور استغفروا فاستغفروه واستغفري أستغفر ويستغفروا سأستغفر لغفار تستغفرون فغفر بمغفرة غفر فاستغفر فغفرنا الغفر غافر ويستغفرون واستغفروه يغفرون وغفر يغفروا المغفرة لأستغفرن أستغفرت وتغفروا لتغفر غفارا واستغفره"
  },
  {
    "root": "غفل",
    "words": "بغفل تغفلون غفلون لغفلين غفلين الغفلون الغفلين لغفلون غفلا أغفلنا غفلة الغفلت"
  },
  {
    "root": "غلب",
    "words": "غلبت ستغلبون غالب يغلب غلبون الغلبون الغلبين فغلبوا يغلبون يغلبوا غلبوا غلبهم سيغلبون تغلبون مغلوب لأغلبن غلبا"
  },
  {
    "root": "غلظ",
    "words": "غليظ غليظا واغلظ غلظة فاستغلظ غلاظ"
  },
  {
    "root": "غلف",
    "words": "غلف"
  },
  {
    "root": "غلق",
    "words": "وغلقت"
  },
  {
    "root": "غلل",
    "words": "يغل يغلل غل مغلولة غلت والأغلل الأغلل أغللا غلا فغلوه وأغللا"
  },
  {
    "root": "غلم",
    "words": "غلم بغلم غلما الغلم لغلمين غلمان"
  },
  {
    "root": "غلو",
    "words": "تغلوا"
  },
  {
    "root": "غلي",
    "words": "يغلي كغلي"
  },
  {
    "root": "غمر",
    "words": "غمرت غمرتهم غمرة"
  },
  {
    "root": "غمز",
    "words": "يتغامزون"
  },
  {
    "root": "غمض",
    "words": "تغمضوا"
  },
  {
    "root": "غمم",
    "words": "الغمام غما بغم الغم الغمم غمة غم بالغمم"
  },
  {
    "root": "غنم",
    "words": "مغانم والغنم غنمتم غنمي غنم ومغانم"
  },
  {
    "root": "غني",
    "words": "غني أغنياء تغني غنيا يغن الغني أغنى يغنوا تغن يغنيكم أغنيهم يغني أغنت لغني مغنون يغنهم يغنيهم الأغنياء واستغنى يغنيا استغنى يغنيه فأغنى"
  },
  {
    "root": "غوث",
    "words": "تستغيثون يغاث يستغيثوا يغاثوا فاستغثه يستغيثان يغوث"
  },
  {
    "root": "غور",
    "words": "الغار مغرت غورا"
  },
  {
    "root": "غوص",
    "words": "يغوصون وغواص"
  },
  {
    "root": "غوط",
    "words": "الغائط"
  },
  {
    "root": "غول",
    "words": "غول"
  },
  {
    "root": "غوي",
    "words": "الغي أغويتني الغاوين يغويكم ولأغوينهم غيا فغوى للغاوين والغاون الغاون لغوي أغوينا أغوينهم غوينا فأغوينكم غوين لأغوينهم غوى"
  },
  {
    "root": "غيب",
    "words": "بالغيب غيب الغيب للغيب الغيوب غائبين غيبت الغائبين غائبة يغتب غيبه بغائبين"
  },
  {
    "root": "غيث",
    "words": "الغيث غيث"
  },
  {
    "root": "غير",
    "words": "غير بغير لغير غيره أفغير غيرها فليغيرن غيركم أغير وغير مغيرا يغيروا يغير غيري يتغير فالمغيرت"
  },
  {
    "root": "غيض",
    "words": "وغيض تغيض"
  },
  {
    "root": "غيظ",
    "words": "الغيظ بغيظكم غيظ يغيظ تغيظا لغائظون بغيظهم ليغيظ"
  },
  {
    "root": "فأد",
    "words": "أفدتهم أفدة فؤادك وأفدتهم والأفدة والفؤاد فؤاد والأفدة وأفدة الفؤاد الأفدة"
  },
  {
    "root": "فأي",
    "words": "فئة فئتين فئتكم الفئتان"
  },
  {
    "root": "فتأ",
    "words": "تفتؤا"
  },
  {
    "root": "فتح",
    "words": "فتح يستفتحون بالفتح فتحنا مفاتح تفتح افتح الفتحين لفتحنا تستفتحوا الفتح فتحوا واستفتحوا فتحت مفاتحه فافتح فتحا يفتح الفتاح مفتحة وفتحت ففتحنا وفتح والفتح"
  },
  {
    "root": "فتر",
    "words": "فترة يفترون يفتر"
  },
  {
    "root": "فتق",
    "words": "ففتقنهما"
  },
  {
    "root": "فتل",
    "words": "فتيلا"
  },
  {
    "root": "فتن",
    "words": "فتنة والفتنة الفتنة يفتنكم فتنته يفتنوك فتنتهم فتنا يفتننكم فتنتك تفتني يفتنون يفتنهم لفتينه فتنوا ليفتنونك وفتنك فتونا فتنتم لنفتنهم تفتنون بفتنين فتنه فتنتكم المفتون"
  },
  {
    "root": "فتو",
    "words": "ويستفتونك يفتيكم يستفتونك تستفتيان أفتوني أفتنا تستفت فاستفتهم"
  },
  {
    "root": "فتي",
    "words": "فتيتكم فتيها فتيان الفتية فتية لفتيه فتى"
  },
  {
    "root": "فجج",
    "words": "فجاجا فج"
  },
  {
    "root": "فجر",
    "words": "فانفجرت يتفجر الفجر تفجر فتفجر تفجيرا وفجرنا كالفجار فاجرا ليفجر يفجرونها الفجرة فجرت الفجار والفجر فجورها"
  },
  {
    "root": "فجو",
    "words": "فجوة"
  },
  {
    "root": "فحش",
    "words": "والفحشاء بالفحشاء فحشة الفحشة بفحشة الفوحش الفحشاء والفوحش"
  },
  {
    "root": "فخر",
    "words": "فخورا فخور كالفخار وتفاخر"
  },
  {
    "root": "فدي",
    "words": "تفدوهم فدية ففدية افتدت افتدى ليفتدوا لافتدت لافتدوا وفدينه فداء يفتدي"
  },
  {
    "root": "فرت",
    "words": "فرات فراتا"
  },
  {
    "root": "فرث",
    "words": "فرث"
  },
  {
    "root": "فرج",
    "words": "فرجها لفروجهم فروجهم فروجهن فروج فرجت"
  },
  {
    "root": "فرح",
    "words": "يفرحوا فرحين يفرحون فرحوا فرحون فرح وفرحوا فليفرحوا لفرح تفرحون تفرح الفرحين يفرح تفرحوا"
  },
  {
    "root": "فرد",
    "words": "فردى فردا وفردى"
  },
  {
    "root": "فردس",
    "words": "الفردوس"
  },
  {
    "root": "فرر",
    "words": "فرارا ففررت الفرار فررتم ففروا تفرون فرت المفر يفر"
  },
  {
    "root": "فرش",
    "words": "فرشا وفرشا فرشنها فرش وفرش كالفراش"
  },
  {
    "root": "فرض",
    "words": "فارض فرض تفرضوا فريضة فرضتم مفروضا الفريضة وفرضنها فرضنا"
  },
  {
    "root": "فرط",
    "words": "فرطنا يفرطون فرطتم مفرطون فرطا يفرط فرطت"
  },
  {
    "root": "فرع",
    "words": "وفرعها"
  },
  {
    "root": "فرعون",
    "words": "فرعون يفرعون لفرعون وفرعون"
  },
  {
    "root": "فرغ",
    "words": "أفرغ فرغا سنفرغ فرغت"
  },
  {
    "root": "فرق",
    "words": "فرقنا والفرقان فريق فريقا ففريقا وفريقا يفرقون نفرق الفرقان لفريقا تفرقوا يتفرقا يفرقوا فافرق الفريقين فتفرق فرقوا فرقانا وتفريقا فرقة متفرقون متفرقة فرقنه فراق فرقت فرق فريقان يتفرقون وفريق تتفرقوا يفرق فارقوهن الفراق فالفرقت فرقا تفرق"
  },
  {
    "root": "فره",
    "words": "فرهين"
  },
  {
    "root": "فري",
    "words": "يفترون افترى افتراء افترينا المفترين يفترى افتريه تفترون مفتريت افتريته مفترون مفتر لتفتروا لتفتري فريا تفتروا افتريه مفترى أفترى يفترينه"
  },
  {
    "root": "فزز",
    "words": "واستفزز ليستفزونك يستفزهم"
  },
  {
    "root": "فزع",
    "words": "الفزع ففزع فزع فزعوا"
  },
  {
    "root": "فسح",
    "words": "تفسحوا فافسحوا يفسح"
  },
  {
    "root": "فسد",
    "words": "تفسدوا المفسدون ويفسدون يفسد مفسدين ليفسد الفساد المفسد لفسدت بالمفسدين فساد فسادا المفسدين ليفسدوا وفساد لنفسد يفسدون لتفسدن مفسدون لفسدتا أفسدوها كالمفسدين"
  },
  {
    "root": "فسر",
    "words": "تفسيرا"
  },
  {
    "root": "فسق",
    "words": "الفسقين يفسقون الفسقون فسوق فسق لفسقون فسقون لفسق فسقا لفسقين فسقين فسقوا ففسقوا ففسق وألحقني فاسقا تفسقون فاسق والفسوق الفسوق"
  },
  {
    "root": "فشل",
    "words": "تفشلا فشلتم لفشلتم فتفشلوا"
  },
  {
    "root": "فصح",
    "words": "أفصح"
  },
  {
    "root": "فصل",
    "words": "فصالا فصل نفصل الفصلين فصلنا مفصلا وتفصيلا فصلنه مفصلت ونفصل يفصل وتفصيل فصلت تفصيلا وفصله الفصل وفصل وفصيلته"
  },
  {
    "root": "فصم",
    "words": "انفصام"
  },
  {
    "root": "فضح",
    "words": "تفضحون"
  },
  {
    "root": "فضض",
    "words": "والفضة لانفضوا فضة انفضوا ينفضوا"
  },
  {
    "root": "فضل",
    "words": "فضلتكم فضل فضله الفضل فضلا فضلنا وفضلا وفضل فضلكم بفضل لفضله ونفضل فضلوا تفضيلا وفضلنهم يتفضل"
  },
  {
    "root": "فضو",
    "words": "أفضى"
  },
  {
    "root": "فطر",
    "words": "فاطر فطر فطرني فطركم يتفطرن فطرنا فطرهن فطرت فطور منفطر انفطرت"
  },
  {
    "root": "فظظ",
    "words": "فظا"
  },
  {
    "root": "فعل",
    "words": "تفعلوا فافعلوا يفعلون يفعل فعلن يفعلوا فعلوا مفعولا فعلوه تفعل فعل تفعلوه فعلت نفعل فعال فعلين لفعلون فعلتم ويفعل فعلنا ويفعلون تفعلون لمفعولا فاعل فعلته فعله وافعلوا فعلون وفعلت فعلتك فعلتها افعل يفعله"
  },
  {
    "root": "فقد",
    "words": "تفقدون نفقد وتفقد"
  },
  {
    "root": "فقر",
    "words": "الفقر الفقراء للفقراء فقير فقيرا الفقير فقراء فاقرة"
  },
  {
    "root": "فقع",
    "words": "فاقع"
  },
  {
    "root": "فقه",
    "words": "يفقهون يفقهوه ليتفقهوا نفقه تفقهون يفقهوا"
  },
  {
    "root": "فكر",
    "words": "تتفكرون ويتفكرون يتفكرون يتفكروا تتفكروا فكر"
  },
  {
    "root": "فكك",
    "words": "فك منفكين"
  },
  {
    "root": "فكه",
    "words": "فوكه فكهون فكهة بفكهة فكهين وفكهة تفكهون وفوكه"
  },
  {
    "root": "فلان",
    "words": "فلانا"
  },
  {
    "root": "فلح",
    "words": "المفلحون تفلحون يفلح يفلحون تفلحوا أفلح المفلحين"
  },
  {
    "root": "فلق",
    "words": "فالق فانفلق الفلق"
  },
  {
    "root": "فلك",
    "words": "والفلك الفلك فلك"
  },
  {
    "root": "فند",
    "words": "تفندون"
  },
  {
    "root": "فنن",
    "words": "أفنان"
  },
  {
    "root": "فني",
    "words": "فان"
  },
  {
    "root": "فهم",
    "words": "ففهمنها"
  },
  {
    "root": "فوت",
    "words": "فاتكم فوت تفوت"
  },
  {
    "root": "فوج",
    "words": "فوجا فوج أفواجا"
  },
  {
    "root": "فور",
    "words": "فورهم وفار تفور"
  },
  {
    "root": "فوز",
    "words": "فاز بمفازة الفوز فأفوز فوزا الفائزون بمفازتهم مفازا"
  },
  {
    "root": "فوض",
    "words": "وأفوض"
  },
  {
    "root": "فوق",
    "words": "فوقها فوقكم فوقهم فوق أفاق وفوق فوقه فواق فوقهن"
  },
  {
    "root": "فوم",
    "words": "وفومها"
  },
  {
    "root": "فوه",
    "words": "أفوههم بأفوههم فاه بأفواهكم بأفوهكم"
  },
  {
    "root": "في",
    "words": "فيه في فيها وفى فيما فيهم فيكم لفي فيهن فيهما وفيكم ففي فيم وفيها فينا وفيه أفي"
  },
  {
    "root": "فيأ",
    "words": "فاءو يتفيؤا أفاء تفي فاءت"
  },
  {
    "root": "فيض",
    "words": "أفضتم أفيضوا أفاض تفيض تفيضون"
  },
  {
    "root": "فيق",
    "words": "الآفاق بالأفق"
  },
  {
    "root": "فيل",
    "words": "الفيل"
  },
  {
    "root": "ق",
    "words": "ق"
  },
  {
    "root": "قبح",
    "words": "المقبوحين"
  },
  {
    "root": "قبر",
    "words": "قبره القبور فأقبره المقابر"
  },
  {
    "root": "قبس",
    "words": "بقبس قبس نقتبس"
  },
  {
    "root": "قبض",
    "words": "يقبض مقبوضة ويقبضون فقبضت قبضة قبضنه قبضا قبضته ويقبضن"
  },
  {
    "root": "قبل",
    "words": "قبلك قبلكم قبل يقبل قبلهم تقبل قبلتهم القبلة قبلة قبلتك قبله قبلنا فتقبل فتقبلها بقبول قبلي يتقبل قبلا وقبيله وأقبلوا أقبلنا قبلها وتقبل متقبلين قبيلا وقبل تقبلوا أقبل وأقبل فأقبل فأقبلوا وقابل نتقبل مستقبل وقبائل فأقبلت"
  },
  {
    "root": "قتر",
    "words": "المقتر قتر قتورا يقتروا قترة"
  },
  {
    "root": "قتل",
    "words": "فاقتلوا ويقتلون قتلتم تقتلون يقتل القتلى وقتلوا يقتلونكم واقتلوهم القتل تقتلوهم يقتلوكم قتلوكم فاقتلوهم وقتلوهم القتال قتال نقتل تقتلوا وقتل اقتتل اقتتلوا تقتل للقتال قتل قتلنا قتلوا قتالا وقتلهم قتلتموهم اقتلوا فليقتل فيقتل يقتلون فقتلوا فقتل يقتلوا فلقتلوكم قتلوه فقتلا لأقتلنك لتقتلني لأقتلك فقتله قتله سنقتل يقتلونني لقتال قتلهم يقتلوك قتلوهم فيقتلون أقتلت وقتلت تقتلوه يقتتلان تقتلني قتلت ليقتلوك اقتلوه تقتيلا أقتل أتقتلون تقتلونهم قتلكم قوتلتم قوتلوا يقتلن"
  },
  {
    "root": "قثأ",
    "words": "وقثائها"
  },
  {
    "root": "قحم",
    "words": "مقتحم اقتحم"
  },
  {
    "root": "قد",
    "words": "قد وقد فقد لقد"
  },
  {
    "root": "قدح",
    "words": "قدحا"
  },
  {
    "root": "قدد",
    "words": "وقدت قد قددا"
  },
  {
    "root": "قدر",
    "words": "قدير قدره يقدرون قديرا تقدروا قادر القادر قدروا تقدير وقدره قدرون بمقدار بقدرها ويقدر بقدر قدرنا يقدر مقتدرا قدر نقدر لقدير لقدرون فقدره تقديرا قدرنها القدير مقداره قدرا مقدورا وقدر وقدور وقدرنا قدرنه مقتدرون مقتدر قدرين قدروها فقدرنا القدرون لقادر فقدر القدر"
  },
  {
    "root": "قدس",
    "words": "ونقدس القدس المقدسة المقدس القدوس"
  },
  {
    "root": "قدم",
    "words": "قدمت تقدموا وقدموا أقدامنا يستقدمون الأقدام قدم يقدم قدمتم القديم المستقدمين وقدمنا الأقدمون تستقدمون قدموا قدمتموه قديم أقدامكم تقدم والأقدام فقدموا يتقدم"
  },
  {
    "root": "قدو",
    "words": "اقتده مقتدون"
  },
  {
    "root": "قذف",
    "words": "اقذفيه فاقذفيه فقذفنها نقذف وقذف يقذف ويقذفون"
  },
  {
    "root": "قرأ",
    "words": "القرآن قروء قرئ والقرآن بقرآن قرآن يقرءون قرءنا قرآنا وقرآن قرأت اقرأ نقرؤه وقرآنا لتقرأه بالقرآن فقرأه لقرآن اقرءوا فاقرءوا وقرآنه قرأنه قرآنه سنقرئك"
  },
  {
    "root": "قرب",
    "words": "تقربا القربى والأقربين قريب تقربوها تقربوهن أقرب المقربين بقربان والأقربون تقربوا المقربون قربا قربانا أقربهم قربى اقترب يقربوا قريبا قربت قربة بقريب تقربون لأقرب وأقرب وقربنه واقترب أقريب الأقربين تقربكم ليقربونا فقربه اقتربت مقربة"
  },
  {
    "root": "قرح",
    "words": "قرح القرح"
  },
  {
    "root": "قرد",
    "words": "قردة القردة"
  },
  {
    "root": "قرر",
    "words": "مستقر أقررتم ءأقررتم أقررنا فمستقر استقر مستقرها قرار القرار وقري تقر ونقر مستقرا قرة قوارير قرارا قرت وقرن لمستقر المستقر قواريرا"
  },
  {
    "root": "قرش",
    "words": "قريش"
  },
  {
    "root": "قرض",
    "words": "يقرض قرضا وأقرضتم تقرضهم وأقرضوا تقرضوا"
  },
  {
    "root": "قرطس",
    "words": "قرطاس قراطيس"
  },
  {
    "root": "قرع",
    "words": "قارعة بالقارعة القارعة"
  },
  {
    "root": "قرف",
    "words": "وليقترفوا مقترفون يقترفون اقترفتموها يقترف"
  },
  {
    "root": "قرن",
    "words": "قرينا قرن قرنا القرون مقرنين القرنين قرونا وقرونا قرون وقرون قرين قرناء القرين مقترنين قرينه"
  },
  {
    "root": "قري",
    "words": "القرية قرية القرى قريتكم قريتنا قرى القريتين قريتك"
  },
  {
    "root": "قسر",
    "words": "قسورة"
  },
  {
    "root": "قسس",
    "words": "قسيسين"
  },
  {
    "root": "قسط",
    "words": "أقسط بالقسط تقسطوا المقسطين بالقسطاس القسط وأقسطوا وتقسطوا القسطون"
  },
  {
    "root": "قسم",
    "words": "القسمة تستقسموا أقسموا فيقسمان وأقسموا وقاسمهما أقسمتم مقسوم المقتسمين تقسموا تقاسموا يقسم يقسمون قسمنا فالمقسمت قسمة أقسم لقسم قسم"
  },
  {
    "root": "قسو",
    "words": "قست قسوة قسية والقاسية للقسية فقست"
  },
  {
    "root": "قشعر",
    "words": "تقشعر"
  },
  {
    "root": "قصد",
    "words": "مقتصدة قاصدا قصد واقصد مقتصد"
  },
  {
    "root": "قصر",
    "words": "تقصروا قصورا يقصرون وقصر قصرت ومقصرين مقصورت كالقصر"
  },
  {
    "root": "قصص",
    "words": "القصاص قصاص القصص قصصنهم نقصصهم يقص يقصون فلنقصن نقص فاقصص نقصه تقصص قصصهم قصصنا قصصا قصيه وقص نقصص"
  },
  {
    "root": "قصف",
    "words": "قاصفا"
  },
  {
    "root": "قصم",
    "words": "قصمنا"
  },
  {
    "root": "قصو",
    "words": "القصوى الأقصا قصيا أقصا"
  },
  {
    "root": "قضب",
    "words": "وقضبا"
  },
  {
    "root": "قضض",
    "words": "ينقض"
  },
  {
    "root": "قضي",
    "words": "قضى قضيتم وقضى قضيت لقضي ليقضى اقضوا يقضى قضيها وقضينا مقضيا فاقض قاض تقضي ليقضوا فقضى قضينا قضوا يقضون فقضيهن ليقض القاضية يقض"
  },
  {
    "root": "قطر",
    "words": "والقنطير المقنطرة بقنطار قنطارا قطران قطرا أقطارها القطر أقطار"
  },
  {
    "root": "قطط",
    "words": "قطنا"
  },
  {
    "root": "قطع",
    "words": "ويقطعون وتقطعت ليقطع تقطع فاقطعوا فقطع وقطعنا لأقطعن وقطعنهم ويقطع يقطعون قطعا بقطع وقطعن قطعن قطع قطعت مقطوع فلأقطعن وتقطعوا فتقطعوا قاطعة وتقطعون مقطوعة قطعتم لقطعنا"
  },
  {
    "root": "قطف",
    "words": "قطوفها"
  },
  {
    "root": "قطمر",
    "words": "قطمير"
  },
  {
    "root": "قطن",
    "words": "يقطين"
  },
  {
    "root": "قعد",
    "words": "القواعد مقعد وقعدوا وقعودا القعدون القعدين تقعدوا قعدون تقعد لأقعدن واقعدوا اقعدوا بمقعدهم بالقعود فاقعدوا وقعد قاعدا فتقعد والقوعد قعيد نقعد قعود"
  },
  {
    "root": "قعر",
    "words": "منقعر"
  },
  {
    "root": "قفل",
    "words": "أقفالها"
  },
  {
    "root": "قفو",
    "words": "وقفينا تقف قفينا"
  },
  {
    "root": "قلب",
    "words": "قلوبهم قلوبكم قلوبنا قلبك ينقلب تقلب قلبه قلبي فينقلبوا انقلبتم فتنقلبوا قلوب القلب فانقلبوا ونقلب وانقلبوا منقلبون وقلبه وقلبوا انقلبوا القلوب تقلبهم ونقلبهم منقلبا يقلب انقلب وقلوبهم تتقلب بقلب وتقلبك منقلب ينقلبون قلبها تقلبون قلبين لقلوبكم وقلوبهن قلب لمنقلبون متقلبكم قلوبكما وينقلب"
  },
  {
    "root": "قلد",
    "words": "القلئد والقلئد مقاليد"
  },
  {
    "root": "قلع",
    "words": "أقلعي"
  },
  {
    "root": "قلل",
    "words": "قليلا فقليلا قليلة قليل قل أقلت ويقللكم أقل قليلون وقليل وأقل"
  },
  {
    "root": "قلم",
    "words": "أقلمهم أقلم والقلم بالقلم"
  },
  {
    "root": "قلي",
    "words": "القالين قلى"
  },
  {
    "root": "قمح",
    "words": "مقمحون"
  },
  {
    "root": "قمر",
    "words": "القمر والقمر وقمرا للقمر"
  },
  {
    "root": "قمص",
    "words": "قميصه بقميصي"
  },
  {
    "root": "قمطر",
    "words": "قمطريرا"
  },
  {
    "root": "قمع",
    "words": "مقمع"
  },
  {
    "root": "قمل",
    "words": "والقمل"
  },
  {
    "root": "قنت",
    "words": "قنتون قنتين والقنتين اقنتي قنتت قانتا يقنت والقنتت قنت القنتين"
  },
  {
    "root": "قنط",
    "words": "القنطين يقنط يقنطون تقنطوا قنوط قنطوا"
  },
  {
    "root": "قنطر",
    "words": "والقنطير المقنطرة"
  },
  {
    "root": "قنع",
    "words": "مقنعي القانع"
  },
  {
    "root": "قنو",
    "words": "قنوان"
  },
  {
    "root": "قني",
    "words": "وأقنى"
  },
  {
    "root": "قهر",
    "words": "القاهر قهرون القهار القهر تقهر"
  },
  {
    "root": "قوب",
    "words": "قاب"
  },
  {
    "root": "قوت",
    "words": "مقيتا أقوتها"
  },
  {
    "root": "قوس",
    "words": "قوسين"
  },
  {
    "root": "قوع",
    "words": "قاعا بقيعة"
  },
  {
    "root": "قول",
    "words": "يقول قيل قالوا فيقولون قال فقال أقل قلنا وقلنا قلتم وقولوا قولا فقلنا يقولون وقالوا قل تقولون يقولا تقولوا وقالت قولهم وقال قولوا سيقول قوله قول فقل وقل قالت فقولوا ويقولون تقول وقيل ونقول وليقولوا ليقولن يقولوا القول قيلا فقالوا وقولهم ويقول فيقول قلت أقول قلته لقال نقول ليقولوا وأقل قالا أتقولون لقلنا فسيقولون قولك قائل وقلن قلن بالقول لقالوا قولنا تقل لتقولون سيقولون تقولن وسنقول فقولي قولي فتقول فقولا يقل يقال قائلها وتقولون فيقولوا وقالا قولها لنقولن فقالت قالتا قولكم والقائلين ليقولون قالها وتقولوا وقيله وقول وتقول تقوله ويقولوا لقولهم لقول بقول الأقاويل فقلت وليقول"
  },
  {
    "root": "قوم",
    "words": "المستقيم ويقيمون قاموا وأقيموا لقومه يقوم القيمة لقوم مقام مستقيم وأقام يقيما وقوموا القوم القيوم يقومون وأقاموا وأقوم قائما قائم قوما قائمة قوم قيما قومون مستقيما قومهم فأقمت فلتقم فأقيموا تقوموا قومين والمقيمين قمتم أقمتم مقيم بقوم يقيمون أقاموا تقيموا يقومان مقامهما قومك أقيموا وقومك قومه قومنا وقومه قومي استقموا فاستقيموا القيم وقوم تقم تقوم مقامي للقوم لقومكما فاستقيما أقم ويقوم فاستقم وأقم يقيموا ليقيموا إقامتكم أقوم مقاما فأقامه نقيم قومها وإقام والقائمين والمقيمي وقومهما وقيما ومقاما قواما ومقام وقومها مقامك وقومهم فأقم وأقمن المقامة وقائما قيام واستقم ولقومك يقومنا ليقوم لقومهم قائمون قام قم يستقيم تقويم قيمة ويقيموا"
  },
  {
    "root": "قوي",
    "words": "بقوة القوة قوي قوة قوتكم القوى لقوي قويا للمقوين"
  },
  {
    "root": "قيض",
    "words": "وقيضنا نقيض"
  },
  {
    "root": "قيل",
    "words": "قائلون مقيلا"
  },
  {
    "root": "كأس",
    "words": "بكأس كأسا وكأس كأس وكأسا"
  },
  {
    "root": "كبب",
    "words": "فكبت مكبا"
  },
  {
    "root": "كبت",
    "words": "يكبتهم كبتوا كبت"
  },
  {
    "root": "كبد",
    "words": "كبد"
  },
  {
    "root": "كبر",
    "words": "واستكبر لكبيرة استكبرتم ولتكبروا كبير أكبر الكبر كبيرا يكبروا كبائر ويستكبر واستكبروا يستكبرون كبر تستكبرون تتكبر استكبروا فاستكبروا يتكبرون الأكبر كبيرة الكبرياء أكبرنه كبيرهم الكبير مستكبرون المستكبرين المتكبرين وأكبر يكبر وكبره تكبيرا كبرت الكبرى لكبيركم لتكبروا مستكبرين كبره مستكبرا وكبراءنا استكبارا استكبر أستكبرت واستكبرت للمتكبرين متكبر كبئر فاستكبرتم واستكبرتم وكبير المتكبر كبارا فكبر"
  },
  {
    "root": "كبكب",
    "words": "فكبكبوا"
  },
  {
    "root": "كتب",
    "words": "الكتب يكتبون كتبت كتب والكتب فاكتبوه وليكتب كاتب يكتب فليكتب تكتبوه تكتبوها كاتبا وكتبه فاكتبنا بالكتب كتبا سنكتب كتبنا وكتب وكتبنا بكتب واكتب فسأكتبها مكتوبا كتاب كتبك كتبه كتبهم كتبون للكتب فكاتبوهم اكتتبها وكتاب بكتبي وبالكتب ونكتب بكتبكم لكتب ستكتب كتبها كتبنها كتبيه كتبين"
  },
  {
    "root": "كتم",
    "words": "تكتمون وتكتموا كتم ليكتمون يكتمون يكتمن تكتموا يكتمها وتكتمون تكتمونه ويكتمون نكتم يكتم"
  },
  {
    "root": "كثب",
    "words": "كثيبا"
  },
  {
    "root": "كثر",
    "words": "كثيرا أكثرهم كثير أكثر كثيرة وأكثرهم كثر أكثركم وكثير كثرة استكثرتم لكثير فكثركم لأكثرهم لاستكثرت كثرت كثرتكم وأكثر فأكثرت وتكاثر تستكثر فأكثروا التكاثر الكوثر"
  },
  {
    "root": "كدح",
    "words": "كادح كدحا"
  },
  {
    "root": "كدر",
    "words": "انكدرت"
  },
  {
    "root": "كدي",
    "words": "وأكدى"
  },
  {
    "root": "كذب",
    "words": "يكذبون وكذبوا كذبتم كذبوا الكذبين الكذب المكذبين كذبوك كذب للكذب كذبا نكذب لكذبون يكذبونك كذبت وكذبتم وكذب فكذبوه كذبين مكذوب فكذبت الكذبون فكذب يكذبوك كذبون كذبوه فكذبوهما تكذبون كذبوكم يكذب أكذبتم تكذبوا فكذبوا كذاب كذبه للمكذبين الكذاب تكذبان كاذبة المكذبون فكذبنا مكذبين والمكذبين كذابا تكذيب يكذبك كذبة"
  },
  {
    "root": "كذلك",
    "words": "كذلك وكذلك"
  },
  {
    "root": "كرب",
    "words": "كرب الكرب"
  },
  {
    "root": "كرر",
    "words": "كرة الكرة كرتين"
  },
  {
    "root": "كرس",
    "words": "كرسيه"
  },
  {
    "root": "كرم",
    "words": "كريما كريم أكرمي كرمت كرمنا مكرمون مكرم الكريم كراما المكرمين أكرمكم والإكرام مكرمة كرام فأكرمه أكرمن تكرمون الأكرم"
  },
  {
    "root": "كره",
    "words": "كره تكرهوا إكراه وكرها كرها كرهتموهن كرهين لكرهون كرهون وكرهوا تكره يكرهون أكره مكروها أكرهتنا يكرههن إكرههن كرهوا وكره فكرهتموه"
  },
  {
    "root": "كسب",
    "words": "يكسبون كسب كسبت كسبتم كسبوا اكتسبت اكتسبوا اكتسبن يكسب يكسبه كسبا تكسبون تكسب اكتسب"
  },
  {
    "root": "كسد",
    "words": "كسادها"
  },
  {
    "root": "كسف",
    "words": "كسفا"
  },
  {
    "root": "كسل",
    "words": "كسالى"
  },
  {
    "root": "كسو",
    "words": "وكسوتهن نكسوها واكسوهم كسوتهم فكسونا"
  },
  {
    "root": "كشط",
    "words": "كشطت"
  },
  {
    "root": "كشف",
    "words": "كاشف فيكشف كشفت كشفنا كشف فكشفنا وكشفنا وكشفت ويكشف اكشف كاشفوا كاشفة يكشف"
  },
  {
    "root": "كظم",
    "words": "والكظمين كظيم كظمين مكظوم"
  },
  {
    "root": "كعب",
    "words": "الكعبين الكعبة وكواعب"
  },
  {
    "root": "كفت",
    "words": "كفاتا"
  },
  {
    "root": "كفر",
    "words": "كفروا بالكفرين للكفرين تكفرون الكفرين كافر يكفرون وتكفرون بكفرهم يكفروا وللكفرين ويكفرون يكفر كفر تكفر الكفر كفارا كفار وكفر والكفرون ويكفر كافرة واكفروا بالكفر كفرا كفرين أكفرتم يكفروه للكفر لأكفرن نكفر تكفروا والكفرين ونكفر الكفرون وكفرهم وبكفرهم كفارة والكفار وكفرا لكفرنا فكفرته كفرة بكفرين كفرون كفرتم الكفار وكفروا كفور كفرنا كفرت ليكفروا فكفرت كفورا فليكفر أكفرت سيكفرون كفران لكفور الكافر أكفر لنكفرن لكفرون كفره الكفور كفرهم فكفروا بكفرك ليكفر فتكفرون لأكفر وكفرنا لتكفرون وكفرتم أكفاركم اكفر الكوافر وكفرت كافورا أكفره الكفرة"
  },
  {
    "root": "كفف",
    "words": "كافة كفوا يكف ويكفوا فكف كففت كفيه يكفون وكف كف"
  },
  {
    "root": "كفل",
    "words": "وكفلها يكفل كفل كفيلا يكفله الكفل يكفلونه أكفلنيها كفلين"
  },
  {
    "root": "كفي",
    "words": "فسيكفيكهم يكفيكم وكفى فكفى كفى كفينك يكفهم بكاف يكف"
  },
  {
    "root": "كل",
    "words": "كلما كل بكل كلها أفكلما أوكلما ولكل كله لكل كللة فلكل وكلا كلا الكللة وكل كلهم وكلما وكلهم فكلا كلهن"
  },
  {
    "root": "كلأ",
    "words": "يكلؤكم"
  },
  {
    "root": "كلب",
    "words": "مكلبين الكلب وكلبهم كلبهم"
  },
  {
    "root": "كلح",
    "words": "كلحون"
  },
  {
    "root": "كلف",
    "words": "تكلف يكلف نكلف المتكلفين"
  },
  {
    "root": "كلل",
    "words": "كل"
  },
  {
    "root": "كلم",
    "words": "كلمت كلم يكلمنا بكلمت يكلمهم بكلمة تكلم ويكلم كلمة الكلم وكلم تكليما وكلمته لكلمت وكلمهم لكلمته وكلمه وبكلمي بكلمته وكلمة كلمه أكلم نكلم تكلمون نتكلم تكلمهم يتكلم وتكلمنا كلمتنا يكلمه يتكلمون"
  },
  {
    "root": "كم",
    "words": "كم وكم"
  },
  {
    "root": "كمل",
    "words": "ولتكملوا كاملة كاملين أكملت"
  },
  {
    "root": "كمم",
    "words": "أكمامها الأكمام"
  },
  {
    "root": "كمه",
    "words": "الأكمه"
  },
  {
    "root": "كند",
    "words": "لكنود"
  },
  {
    "root": "كنز",
    "words": "يكنزون كنزتم تكنزون كنز كنزهما وكنوز الكنوز"
  },
  {
    "root": "كنس",
    "words": "الكنس"
  },
  {
    "root": "كنن",
    "words": "أكننتم أكنة أكننا تكن مكنون المكنون"
  },
  {
    "root": "كهف",
    "words": "الكهف كهفهم"
  },
  {
    "root": "كهل",
    "words": "وكهلا"
  },
  {
    "root": "كهن",
    "words": "بكاهن كاهن"
  },
  {
    "root": "كهيعص",
    "words": "كهيعص"
  },
  {
    "root": "كوب",
    "words": "وأكواب بأكواب"
  },
  {
    "root": "كود",
    "words": "يكاد كادوا يكادون وكادوا كاد كدت تكاد أكاد يكد كادت"
  },
  {
    "root": "كور",
    "words": "يكور ويكور كورت"
  },
  {
    "root": "كوكب",
    "words": "كوكبا كوكب الكواكب"
  },
  {
    "root": "كون",
    "words": "كانوا كنتم وكنتم وكان فتكونا كانا تكونوا وكانوا لكنتم كونوا أكون كان كانت كن فيكون لتكونوا ويكون كنت تكونن يكون تكون يكن يكونا تكن ولتكن لكان مكان تك أكن فتكونون كنا فليكونوا نكن كانتا فتكون مكانا ونكون وكنت لنكونن وليكون لأكونن مكانتكم لكنا تكونا نكون مكانه وكن وكنا فكان يك يكونوا ولنكونن وكونوا أكان مكانكم وتكون لتكون وتكونوا وليكونا وأكن فكانوا فكانت وكانت أك ليكونوا ويكونون كوني ليكون فكنتم فنكون لتكونن فتكن كنتن ليكونن مكانتهم لكنت فأكون ولتكونن ليكونا ولتكون يكونون سيكون نك"
  },
  {
    "root": "كوي",
    "words": "فتكوى"
  },
  {
    "root": "كي",
    "words": "لكيلا لكي كي"
  },
  {
    "root": "كيد",
    "words": "كيدهم كيد كيدي كيدون فكيدوني فيكيدوا كيدا كيدكن كيدهن بكيدهن كدنا كيده كيدكم لأكيدن المكيدون فكيدون يكيدون وأكيد"
  },
  {
    "root": "كيف",
    "words": "كيف فكيف وكيف"
  },
  {
    "root": "كيل",
    "words": "الكيل المكيال كيل نكتل كلتم اكتالوا كالوهم"
  },
  {
    "root": "لألأ",
    "words": "ولؤلؤا لؤلؤ اللؤلؤ لؤلؤا"
  },
  {
    "root": "لئن",
    "words": "ولئن لئن"
  },
  {
    "root": "لا",
    "words": "ولا لا فلا أفلا أولا"
  },
  {
    "root": "لبب",
    "words": "الألبب"
  },
  {
    "root": "لبث",
    "words": "لبثت يلبثوا لبث فلبث لبثتم يلبثون لبثوا لبثنا ولبثوا فلبثت ولبثت تلبثوا للبث لبثين"
  },
  {
    "root": "لبد",
    "words": "لبدا"
  },
  {
    "root": "لبس",
    "words": "تلبسوا لباس تلبسون وللبسنا يلبسون يلبسكم يلبسوا وليلبسوا لباسا ولباس لباسهما تلبسونها ويلبسون لبوس ولباسهم لبس"
  },
  {
    "root": "لبن",
    "words": "لبنا لبن"
  },
  {
    "root": "لجأ",
    "words": "ملجآ ملجأ"
  },
  {
    "root": "لجج",
    "words": "للجوا لجي لجة لجوا"
  },
  {
    "root": "لحد",
    "words": "يلحدون ملتحدا بإلحاد"
  },
  {
    "root": "لحف",
    "words": "إلحافا"
  },
  {
    "root": "لحق",
    "words": "يلحقوا وألحقني ألحقتم ألحقنا"
  },
  {
    "root": "لحم",
    "words": "ولحم لحما لحم لحومها"
  },
  {
    "root": "لحن",
    "words": "لحن"
  },
  {
    "root": "لحي",
    "words": "بلحيتي"
  },
  {
    "root": "لدد",
    "words": "ألد لدا"
  },
  {
    "root": "لدن",
    "words": "لدنك لدنه لدنا لدن لدني"
  },
  {
    "root": "لدي",
    "words": "لديهم لدى لدينا لديه ولدينا"
  },
  {
    "root": "لذذ",
    "words": "لذة وتلذ"
  },
  {
    "root": "لزب",
    "words": "لازب"
  },
  {
    "root": "لزم",
    "words": "أنلزمكموها ألزمنه لزاما وألزمهم"
  },
  {
    "root": "لسن",
    "words": "ألسنتهم بألسنتهم لسان بلسان ألسنتكم بلسانك لساني بألسنتكم لسانا بألسنة وألسنتهم لسانك ولسانا"
  },
  {
    "root": "لطف",
    "words": "اللطيف لطيف وليتلطف لطيفا"
  },
  {
    "root": "لظي",
    "words": "لظى تلظى"
  },
  {
    "root": "لعب",
    "words": "ولعبا لعب لعبا يلعبون ونلعب ويلعب لعبين اللعبين ولعب ويلعبوا"
  },
  {
    "root": "لعن",
    "words": "لعنهم فلعنة يلعنهم ويلعنهم اللعنون لعنة نلعنهم لعنا يلعن ولعنه لعنه ولعنوا لعن لعنت ولعنهم اللعنة الملعونة لعنوا ويلعن ملعونين والعنهم لعنتي"
  },
  {
    "root": "لغب",
    "words": "لغوب"
  },
  {
    "root": "لغو",
    "words": "باللغو لغوا اللغو والغوا لغو لغية"
  },
  {
    "root": "لفت",
    "words": "لتلفتنا يلتفت"
  },
  {
    "root": "لفح",
    "words": "تلفح"
  },
  {
    "root": "لفظ",
    "words": "يلفظ"
  },
  {
    "root": "لفف",
    "words": "لفيفا والتفت ألفافا"
  },
  {
    "root": "لفو",
    "words": "ألفينا وألفيا ألفوا"
  },
  {
    "root": "لقب",
    "words": "بالألقب"
  },
  {
    "root": "لقح",
    "words": "لوقح"
  },
  {
    "root": "لقد",
    "words": "ولقد"
  },
  {
    "root": "لقط",
    "words": "يلتقطه فالتقطه"
  },
  {
    "root": "لقف",
    "words": "تلقف"
  },
  {
    "root": "لقم",
    "words": "فالتقمه"
  },
  {
    "root": "لقمان",
    "words": "لقمن"
  },
  {
    "root": "لقي",
    "words": "لقوا فتلقى ملقوا تلقوا ملقوه التقتا يلقون لقوكم تلقوه سنلقي التقى وألقوا ويلقوا ألقى ألقها وألقينا بلقاء لقاء تلقاء فألقى تلقي الملقين ألقوا ألق وألقى ولقاء سألقي لقيتم التقيتم يلقونه لقاءنا تلقائ ملقون وألقوه فألقوه ألقيه فألقوا يلقيه لقينا لقيا ولقائه فألقيها فليلقه وألقيت وألق وتتلقيهم يلقى تلقونه يلق ويلقون لتلقى فألقه فألقيه لقيه يلقيها لقائه التلاق يلقوا يتلقى المتلقيان ألقيا فألقياه فالتقى أءلقي يلتقيان تلقون ملقيكم ملق ولقيهم فالملقيت وألقت فملقيه"
  },
  {
    "root": "لكن",
    "words": "ولكن لكن ولكني ولكنه ولكنهم لكنا ولكنا ولكنكم"
  },
  {
    "root": "لم",
    "words": "فلما ألم ولما فلم ولم أولم أفلم"
  },
  {
    "root": "لما",
    "words": "أولما"
  },
  {
    "root": "لمح",
    "words": "كلمح"
  },
  {
    "root": "لمز",
    "words": "يلمزك يلمزون تلمزوا لمزة"
  },
  {
    "root": "لمس",
    "words": "لمستم فلمسوه فالتمسوا لمسنا"
  },
  {
    "root": "لمم",
    "words": "اللمم لما"
  },
  {
    "root": "لن",
    "words": "ولن لن فلن ألن"
  },
  {
    "root": "لهب",
    "words": "اللهب لهب"
  },
  {
    "root": "لهث",
    "words": "يلهث"
  },
  {
    "root": "لهم",
    "words": "فألهمها"
  },
  {
    "root": "لهو",
    "words": "ولهو ولهوا لهوا ويلههم لاهية تلهيهم اللهو تلهكم تلهى ألهيكم"
  },
  {
    "root": "لو",
    "words": "ولو فلولا لو لولا ولولا فلو وألو"
  },
  {
    "root": "لوح",
    "words": "الألواح ألوح لواحة لوح"
  },
  {
    "root": "لوذ",
    "words": "لواذا"
  },
  {
    "root": "لوط",
    "words": "ولوطا لوط لوطا يلوط"
  },
  {
    "root": "لوم",
    "words": "لومة لائم لمتنني تلوموني ولوموا ملوما ملومين مليم بملوم يتلومون اللوامة"
  },
  {
    "root": "لون",
    "words": "لونها ألونه وألونكم ألونها"
  },
  {
    "root": "لوي",
    "words": "يلون تلون ليا تلوا لووا"
  },
  {
    "root": "لي",
    "words": "ولهم لهم لكم لك لنا ولكم فلهم له فله لها ولنا لي لهن ولهن وله فلكم فلهن فلها فلهما لهما لكما ألهم ولها ولى ولك ألكم"
  },
  {
    "root": "ليت",
    "words": "يليتني يليتنا ليتني يليت يلتكم يليتها"
  },
  {
    "root": "ليس",
    "words": "ليست ليس وليس فليس ولستم ليسوا وليست لست لستم أليس ألست أوليس لستن"
  },
  {
    "root": "ليل",
    "words": "ليلة اليل باليل ليلا ليال بليل ليالي وباليل واليل ليلها وليال"
  },
  {
    "root": "لين",
    "words": "لنت لينا وألنا تلين لينة"
  },
  {
    "root": "مأجوج",
    "words": "ومأجوج"
  },
  {
    "root": "مأي",
    "words": "مائة مائتين"
  },
  {
    "root": "ما",
    "words": "بما وما لم كما فما ما لما فبما فمال أفما"
  },
  {
    "root": "ماذا",
    "words": "ماذا وماذا فماذا أماذا"
  },
  {
    "root": "متع",
    "words": "ومتع فأمتعه تمتع ومتعوهن متعا متع استمتعتم وأمتعتكم استمتع فاستمتعوا فاستمتعتم ومتعنهم يمتعكم سنمتعهم تمتعوا متعنا متعهم ويتمتعوا فتمتعوا ومتعا متعتهم متعنهم يمتعون فمتع متعنه وليتمتعوا نمتعهم تمتعون أمتعكن فمتعوهن فمتعنهم متعت واستمتعتم يتمتعون وتمتعوا"
  },
  {
    "root": "متن",
    "words": "متين المتين"
  },
  {
    "root": "متى",
    "words": "متى"
  },
  {
    "root": "مثل",
    "words": "مثلهم كمثل مثله مثلا مثلها مثل بمثل ومثل فمثله مثليهم مثليها ومثله أمثالكم أمثالها بمثلها مثلنا المثلت الأمثال مثلكم المثل بمثله فتمثل المثلى أمثلهم التماثيل ومثلهم لمثله ومثلا الأمثل وتمثيل لمثل كمثله أمثلها أمثلكم كأمثل مثلهن"
  },
  {
    "root": "مجد",
    "words": "مجيد المجيد"
  },
  {
    "root": "مجس",
    "words": "والمجوس"
  },
  {
    "root": "محص",
    "words": "وليمحص"
  },
  {
    "root": "محق",
    "words": "يمحق ويمحق"
  },
  {
    "root": "محل",
    "words": "المحال"
  },
  {
    "root": "محمد",
    "words": "محمد"
  },
  {
    "root": "محن",
    "words": "امتحن فامتحنوهن"
  },
  {
    "root": "محو",
    "words": "يمحوا فمحونا ويمح"
  },
  {
    "root": "مخر",
    "words": "مواخر"
  },
  {
    "root": "مخض",
    "words": "المخاض"
  },
  {
    "root": "مدد",
    "words": "ويمدهم يمدكم يمددكم يمدونهم ممدكم مدتهم مد مددنها تمدن وأمددنكم نمد مدادا مددا فليمدد مدا ونمد نمدهم أمدكم أتمدونن يمده وأمددنهم ممدود ويمددكم ممدودا مدت ممددة"
  },
  {
    "root": "مدن",
    "words": "المدائن المدينة"
  },
  {
    "root": "مرأ",
    "words": "المرء وامرأتان امرأت وامرأتي مريا امرأة امرؤا امرأته وامرأته امرأتك لامرأته امرأتي امرأ امرئ امرأتين وامرأة وامرأت"
  },
  {
    "root": "مرج",
    "words": "مرج مريج مارج والمرجان"
  },
  {
    "root": "مرح",
    "words": "مرحا تمرحون"
  },
  {
    "root": "مرد",
    "words": "مريدا مردوا مرد مريد ممرد مارد"
  },
  {
    "root": "مرر",
    "words": "مرتان مر مرة فمرت مرتين يمرون مرت مروا تمر لتمرون مستمر وأمر"
  },
  {
    "root": "مرض",
    "words": "مرض مرضا مريضا مرضى المرضى المريض مرضت"
  },
  {
    "root": "مرو",
    "words": "والمروة"
  },
  {
    "root": "مروت",
    "words": "ومروت"
  },
  {
    "root": "مري",
    "words": "الممترين تمترون مرية يمترون تمار مراء يمارون تمترن أفتمرونه تتمارى فتماروا"
  },
  {
    "root": "مريم",
    "words": "مريم يمريم ومريم"
  },
  {
    "root": "مزج",
    "words": "مزاجها ومزاجه"
  },
  {
    "root": "مزق",
    "words": "مزقتم ممزق ومزقنهم"
  },
  {
    "root": "مزن",
    "words": "المزن"
  },
  {
    "root": "مسح",
    "words": "المسيح فامسحوا وامسحوا والمسيح مسحا"
  },
  {
    "root": "مسخ",
    "words": "لمسخنهم"
  },
  {
    "root": "مسد",
    "words": "مسد"
  },
  {
    "root": "مسس",
    "words": "تمسنا مستهم تمسوهن المس يمسسني تمسسكم يمسسكم مس يمسسهم ليمسن يمسسك يمسهم تمسوها مسني مسهم لمسكم مسه مسته فتمسكم مسنا مسكم يمسك مساس تمسسه يمسنا وليمسنكم يمسه يتماسا"
  },
  {
    "root": "مسك",
    "words": "فإمساك فأمسكوهن تمسكوهن استمسك أمسكن يمسكون أيمسكه يمسكهن لأمسكتم ويمسك أمسك ممسك يمسك أمسكهما ممسكت فيمسك مستمسكون فاستمسك تمسكوا مسك"
  },
  {
    "root": "مسو",
    "words": "بالأمس تمسون"
  },
  {
    "root": "مشج",
    "words": "أمشاج"
  },
  {
    "root": "مشي",
    "words": "مشوا يمشي يمشون تمش تمشي ويمشي ويمشون مشيك امشوا تمشون فامشوا مشاء"
  },
  {
    "root": "مصر",
    "words": "مصرا بمصر مصر"
  },
  {
    "root": "مضغ",
    "words": "مضغة المضغة"
  },
  {
    "root": "مضي",
    "words": "مضت وامضوا أمضي مضيا ومضى"
  },
  {
    "root": "مطر",
    "words": "مطر وأمطرنا مطرا فأمطر أمطرت ممطرنا"
  },
  {
    "root": "مطو",
    "words": "يتمطى"
  },
  {
    "root": "مع",
    "words": "معكم مع معهم معه معك لمعكم معي معنا معكما لمع معها"
  },
  {
    "root": "معز",
    "words": "المعز"
  },
  {
    "root": "معن",
    "words": "ومعين معين الماعون"
  },
  {
    "root": "مقت",
    "words": "ومقتا مقتا لمقت مقتكم"
  },
  {
    "root": "مكث",
    "words": "فيمكث مكث مكثين امكثوا فمكث مكثون"
  },
  {
    "root": "مكر",
    "words": "ومكروا ومكر المكرين ليمكروا يمكرون مكر لمكر مكرتموه يمكر ويمكرون ويمكر مكرا تمكرون بمكرهن مكرهم المكر مكروا ومكرنا"
  },
  {
    "root": "مكك",
    "words": "مكة"
  },
  {
    "root": "مكن",
    "words": "مكنهم نمكن مكنكم فأمكن مكنا مكين مكني وليمكنن ونمكن"
  },
  {
    "root": "مكو",
    "words": "مكاء"
  },
  {
    "root": "ملأ",
    "words": "الملإ ملء لأملأن الملأ وملإيه وملإيهم وملأه ملأ ولملئت الملؤا للملإ فمالون بالملإ امتلأت ملئت"
  },
  {
    "root": "ملح",
    "words": "ملح"
  },
  {
    "root": "ملق",
    "words": "إملق إملق"
  },
  {
    "root": "ملك",
    "words": "ملك ملكا الملك بالملك ملكه ملكت يملك ملوكا أملك تملك ملكوت يملكون مملوكا تملكون بملكنا وملك ملكتم تملكهم الملوك ملكون مليك وملكا"
  },
  {
    "root": "ملل",
    "words": "ملتهم ملة وليملل يمل فليملل ملتنا ملتكم الملة"
  },
  {
    "root": "ملو",
    "words": "نملي وأملى فأمليت مليا أمليت تملى"
  },
  {
    "root": "من",
    "words": "ومما من ومن مما منها مني فمن منه منكم منهم ومنهم منهما لمن ممن منا فمنهم منهن ومنكم أفمن كمن منك أومن ومنها وممن لمنكم أمن ولمن ومنه بمن وبمن ومنك منكن فمنه فمنها فمنكم ومنا مم"
  },
  {
    "root": "منع",
    "words": "منع ونمنعكم منعك منعهم منعنا تمنعهم مناع ممنوعة مانعتهم منوعا ويمنعون"
  },
  {
    "root": "منن",
    "words": "المن منا بالمن من فمن يمن مننا تمنها نمن فامنن ممنون يمنون تمنوا المنون تمنن"
  },
  {
    "root": "مني",
    "words": "أماني فتمنوا يتمنوه أمانيهم تمنون تتمنوا ولأمنينهم ويمنيهم بأمانيكم تمنى أمنيته تمنوا ومنوة الأماني يتمنونه مني يمنى"
  },
  {
    "root": "مهد",
    "words": "المهاد المهد مهاد مهدا يمهدون المهدون ومهدت تمهيدا"
  },
  {
    "root": "مهل",
    "words": "كالمهل ومهلهم فمهل أمهلهم"
  },
  {
    "root": "مهما",
    "words": "مهما"
  },
  {
    "root": "مهن",
    "words": "مهين مهينا مهانا المهين أهنن"
  },
  {
    "root": "موت",
    "words": "الموت أموتا يميتكم موتكم الموتى تموتن أموت وماتوا موتها الميتة فيمت موتوا ويميت وأميت فأماته الميت مات تموت ماتوا متم يموتون موته والموتى ميتا ميتة ومماتي تموتون ميت بميت ونميت يموت الممات مت لميتون نموت متنا موتا يميتني الأموت فيموتوا بميتين موتتنا ميتون تمت أمتنا الموتة ومماتهم أمات وأموتا أماته"
  },
  {
    "root": "موج",
    "words": "الموج موج يموج"
  },
  {
    "root": "مور",
    "words": "تمور مورا"
  },
  {
    "root": "موسى",
    "words": "موسى يموسى وموسى بموسى لموسى"
  },
  {
    "root": "مول",
    "words": "الأمول المال أمولكم أمول أمولهم ماله بأمولكم بأمولهم مال وأمول أمولا وأمولهم وأمولا مالا أمولنا بأمول بمال ماليه"
  },
  {
    "root": "موه",
    "words": "ماء الماء كماء ماءك بماء ماؤها وماء ماؤكم ماءها"
  },
  {
    "root": "ميد",
    "words": "مائدة تميد"
  },
  {
    "root": "مير",
    "words": "ونمير"
  },
  {
    "root": "ميز",
    "words": "يميز ليميز وامتزوا تميز"
  },
  {
    "root": "ميكيل",
    "words": "وميكيل"
  },
  {
    "root": "ميل",
    "words": "تميلوا ميلا فيميلون ميلة الميل"
  },
  {
    "root": "ن",
    "words": "ن"
  },
  {
    "root": "نأي",
    "words": "وينؤن ونآ"
  },
  {
    "root": "نبأ",
    "words": "أنبؤني أنبئهم أنبأهم النبين أنبياء النبيون والنبين لنبي نبيهم أؤنبئكم ونبيا أنباء وأنبئكم النبي والنبوة والنبيون الأنبياء نبي ينبئهم نبأ فينبئكم أنبئكم والنبي نبإي ينبئكم نبإ فينبئهم نبؤني أنبائها تنبئهم نبأنا للنبي أتنبؤن فننبئكم ويستنبؤنك لتنبئنهم نبئنا نبأتكما تنبؤنه نبؤا نبئ ونبئهم نبأهم سأنبئك ننبئكم نبيا أفأنبئكم أنبؤا بنبإ الأنباء فأنبئكم النبوة فننبئهم أنبائكم ينبئك نبأه بالنبين فلننبئن بنبإ ينبأ لتنبؤن نبأت نبأها أنبأك نبأني ينبؤا النبإ"
  },
  {
    "root": "نبت",
    "words": "تنبت أنبتت وأنبتها نباتا نبات نباته وأنبتنا ينبت وأنبتت أنبتنا فأنبتنا تنبتوا أنبتكم ونباتا"
  },
  {
    "root": "نبذ",
    "words": "نبذه نبذ فنبذوه فانبذ انتبذت فانتبذت فنبذتها فنبذنهم فنبذنه لنبذ لينبذن"
  },
  {
    "root": "نبز",
    "words": "تنابزوا"
  },
  {
    "root": "نبط",
    "words": "يستنبطونه"
  },
  {
    "root": "نبع",
    "words": "ينبوعا ينبيع"
  },
  {
    "root": "نتق",
    "words": "نتقنا"
  },
  {
    "root": "نثر",
    "words": "منثورا انتثرت"
  },
  {
    "root": "نجد",
    "words": "النجدين"
  },
  {
    "root": "نجس",
    "words": "نجس"
  },
  {
    "root": "نجم",
    "words": "النجوم والنجوم وبالنجم والنجم النجم"
  },
  {
    "root": "نجو",
    "words": "نجينكم فأنجينكم نجويهم ينجيكم أنجينا فأنجينه نجينا أنجينكم ونجويهم أنجيتنا أنجيهم فنجينه ونجنا ننجيك ننجي ننج ونجينهم ناج نجا نجيا فنجي أنجيكم لمنجوهم نجوى نجيكم فنجينك النجوى فأنجينهم ونجينه نجي نجينا وأنجينا ونجني نجني نجوت فأنجيه لننجينه منجوك نجيهم ونجينهما نجينه وينجي النجوة ونجينا ونجويهم نجينهم ويتنجون تنجيتم تتنجوا وتنجوا نجيتم نجويكم تنجيكم ينجيه"
  },
  {
    "root": "نحب",
    "words": "نحبه"
  },
  {
    "root": "نحت",
    "words": "وتنحتون ينحتون تنحتون"
  },
  {
    "root": "نحر",
    "words": "وانحر"
  },
  {
    "root": "نحس",
    "words": "نحسات نحس ونحاس"
  },
  {
    "root": "نحل",
    "words": "نحلة النحل"
  },
  {
    "root": "نحن",
    "words": "نحن ونحن لنحن أنحن"
  },
  {
    "root": "نخر",
    "words": "نخرة"
  },
  {
    "root": "نخل",
    "words": "نخيل النخل والنخل ونخيل والنخيل النخيل بنخل النخلة ونخل نخل ونخلا"
  },
  {
    "root": "ندد",
    "words": "أندادا"
  },
  {
    "root": "ندم",
    "words": "الندمين ندمين الندامة"
  },
  {
    "root": "ندو",
    "words": "ونداء فنادته مناديا ينادي ناديتم وناديهما ونودوا ونادى ونادوا نادوا نادى نداء فناديها وندينه نديا نودي فنادى نادينا يناديهم ناديكم نادينا فنادوا ينادون التناد ينادونك يناد المناد ينادونهم فتنادوا ناديه ناديه"
  },
  {
    "root": "نذر",
    "words": "ءأنذرتهم تنذرهم ونذيرا ومنذرين نذرتم نذر نذرت نذير ونذير لأنذركم وأنذر ولتنذر وينذرونكم لتنذر لينذركم ولينذروا أنذر المنذرين والنذر منذر النذير أنذروا لينذر وينذر وأنذرهم وتنذر أنذركم ينذرون نذورهم نذيرا منذرون تنذر منذرين أنذرتكم النذر ونذر بالنذر أنذرهم فأنذر نذرا أنذرنكم فأنذرتكم"
  },
  {
    "root": "نزع",
    "words": "وتنزع وتنزعتم تنزعتم ينزع ونزعنا ونزع ولتنزعتم تنزعوا نزعنها يتنزعون لننزعن فتنزعوا ينزعنك تنزع نزاعة والنزعت"
  },
  {
    "root": "نزغ",
    "words": "ينزغنك نزغ ينزغ"
  },
  {
    "root": "نزف",
    "words": "ينزفون"
  },
  {
    "root": "نزل",
    "words": "أنزل وأنزل نزلنا أنزلت وأنزلنا فأنزلنا ينزل نزله أنزلنا نزل تنزل منزلين نزلا أنزله منزلها أنزلنه سأنزل منزل وينزل فأنزل منازل المنزلين ننزل ننزله ونزلنا وننزل لنزلنا ونزلنه تنزيلا نتنزل لأنزل أنزلني منزلا أنزلنها ونزل لتنزيل نزلنه تنزلت منزلون تنزيل أءنزل تتنزل نزلت نزلة نزلهم أنزلتموه المنزلون فنزل يتنزل"
  },
  {
    "root": "نسأ",
    "words": "النسي منسأته"
  },
  {
    "root": "نسب",
    "words": "أنساب نسبا"
  },
  {
    "root": "نسخ",
    "words": "ننسخ نسختها فينسخ نستنسخ"
  },
  {
    "root": "نسر",
    "words": "ونسرا"
  },
  {
    "root": "نسف",
    "words": "لننسفنه نسفا ينسفها نسفت"
  },
  {
    "root": "نسك",
    "words": "مناسكنا نسك منسككم ونسكي منسكا ناسكوه"
  },
  {
    "root": "نسل",
    "words": "والنسل ينسلون نسله"
  },
  {
    "root": "نسو",
    "words": "نساءكم نسائكم النساء نساؤكم نسائهم نساء ونساءنا ونساءكم ونساء وللنساء والنساء نساءهم نسوة النسوة نسائهن ينساء"
  },
  {
    "root": "نسى",
    "words": "ينسينك ينسى"
  },
  {
    "root": "نسي",
    "words": "وتنسون ننسها تنسوا نسينا ونسوا فنسوا نسوا ننسيهم نسوه فنسيهم فأنسيه نسيت ونسي نسيا أنسىنيه منسيا فنسي فنسيتها تنسى أنسوكم تنس نسيتم نسينكم نسي ننسيكم ونسوه فأنسيهم"
  },
  {
    "root": "نشأ",
    "words": "وأنشأنا أنشأكم أنشأ وينشئ أنشأنه فأنشأنا أنشأنا ينشئ النشأة أنشأها ينشؤا المنشآت أنشأنهن إنشاء وننشئكم أنشأتم المنشءون ناشئة"
  },
  {
    "root": "نشر",
    "words": "منشورا ينشر ينشرون نشورا تنتشرون فانتشروا النشور وينشر فأنشرنا بمنشرين منشور منتشر منشرة والنشرت نشرا أنشره نشرت"
  },
  {
    "root": "نشز",
    "words": "ننشزها نشوزهن نشوزا انشزوا فانشزوا"
  },
  {
    "root": "نشط",
    "words": "والنشطت نشطا"
  },
  {
    "root": "نصب",
    "words": "نصيب نصيبا نصيبهم النصب والأنصاب نصب نصبا نصيبك بنصب ناصبة نصبت فانصب"
  },
  {
    "root": "نصت",
    "words": "وأنصتوا أنصتوا"
  },
  {
    "root": "نصح",
    "words": "النصحين وأنصح ناصح ونصحت نصحوا نصحي أنصح لنصحون نصحون نصوحا"
  },
  {
    "root": "نصر",
    "words": "ينصرون والنصرى نصير نصرى النصرى نصر وانصرنا أنصار فانصرنا بنصره نصرين أنصاري نصرانيا ولتنصرنه نصركم النصر النصرين ينصركم نصيرا نصرنا ونصروه نصرا النصير ونصروا استنصروكم وينصركم تنصروه نصره والأنصار ينصرني تنصرون منصورا ينصرونه منتصرا وانصروا ونصرنه ينصره نصرهم ولينصرن لينصرنه انصرني ونصيرا ينصرونكم ينتصرون وانتصروا استنصره المنتصرين بنصر ينصر تناصرون ونصرنهم المنصورون ينصرنا لننصر انتصر ينصرونهم لانتصر تنصروا ناصر وينصرك منتصرين فانتصر منتصر تنتصران وينصرون لننصرنكم نصروهم أنصارا ناصرا"
  },
  {
    "root": "نصف",
    "words": "فنصف النصف نصف نصفه ونصفه"
  },
  {
    "root": "نصو",
    "words": "بناصيتها بالنوصي بالناصية ناصية"
  },
  {
    "root": "نضج",
    "words": "نضجت"
  },
  {
    "root": "نضخ",
    "words": "نضاختان"
  },
  {
    "root": "نضد",
    "words": "منضود نضيد"
  },
  {
    "root": "نضر",
    "words": "ناضرة نضرة"
  },
  {
    "root": "نطح",
    "words": "والنطيحة"
  },
  {
    "root": "نطف",
    "words": "نطفة النطفة"
  },
  {
    "root": "نطق",
    "words": "ينطقون ينطق منطق تنطقون أنطقنا أنطق"
  },
  {
    "root": "نظر",
    "words": "تنظرون النظرين انظرنا ينظرون فانظر وانظر فنظرة ينظر فانظروا وانظرنا انظر انظروا انتظروا منتظرون أنظرني المنظرين فانتظروا المنتظرين وانظروا للنظرين فينظر أنظر ينظروا نظر لننظر ينتظرون وانتظروا فينظروا منظرين فأنظرني فلينظر منظرون سننظر فانظري فناظرة ننظر وانتظر ينتظر نظرين فنظر نظرة انظرونا ولتنظر ناظرة"
  },
  {
    "root": "نعج",
    "words": "نعجة نعجتك نعاجه"
  },
  {
    "root": "نعس",
    "words": "نعاسا النعاس"
  },
  {
    "root": "نعق",
    "words": "ينعق"
  },
  {
    "root": "نعل",
    "words": "نعليك"
  },
  {
    "root": "نعم",
    "words": "أنعمت نعمتي نعمة نعمت فنعما والأنعم بنعمته ونعم بنعمة نعما أنعم الأنعم نعمته النعيم النعم وأنعم نعم كالأنعم أنعمها نعيم نعماء فنعم ولنعم أفبنعمة وبنعمت بأنعم لأنعمه أنعمنا أنعمكم أنعما نعمتك وبنعمة نعمه بنعمت أنعمهم وأنعمت فلنعم ونعمة ونعيم النعمة نعيما ولأنعمكم ناعمة ونعمه"
  },
  {
    "root": "نغض",
    "words": "فسينغضون"
  },
  {
    "root": "نفث",
    "words": "النفثت"
  },
  {
    "root": "نفح",
    "words": "نفحة"
  },
  {
    "root": "نفخ",
    "words": "فأنفخ فتنفخ ينفخ ونفخت انفخوا ونفخ فنفخنا نفخ نفخة"
  },
  {
    "root": "نفد",
    "words": "ينفد لنفد تنفد نفدت نفاد"
  },
  {
    "root": "نفذ",
    "words": "تنفذوا فانفذوا تنفذون"
  },
  {
    "root": "نفر",
    "words": "فانفروا انفروا تنفروا لينفروا نفر نفيرا نفورا نفرا ونفور مستنفرة"
  },
  {
    "root": "نفس",
    "words": "أنفسهم أنفسكم نفس نفسا لأنفسكم نفسه والأنفس بأنفسهن أنفسهن فلأنفسكم وأنفسنا وأنفسكم لنفس لأنفسهم نفسك وأنفسهم الأنفس نفسي النفس بالنفس فلنفسه بأنفسهم أنفسنا لنفسي لنفسه نفسها بنفسك نفوسكم فلأنفسهم كنفس النفوس تنفس فليتنافس المتنفسون ونفس"
  },
  {
    "root": "نفش",
    "words": "نفشت المنفوش"
  },
  {
    "root": "نفع",
    "words": "ينفعهم تنفعها ينفع ومنفع نفعهما نفعا ينفعنا فنفعها ينفعك ينفعكم تنفع ينفعه نفعه منفع ينفعونكم تنفعكم تنفعهم فتنفعه نفعت"
  },
  {
    "root": "نفق",
    "words": "ينفقون وأنفقوا أنفقتم أنفقوا ينفق تنفقون نفقة تنفقوا والمنفقين نافقوا المنفقين نفقا فسينفقونها المنفقون أنفقت ينفقونها نفقتهم والمنفقت نفاقا ونفاقا منفقون النفاق وينفقوا الإنفاق أنفق لتنفقوا فأنفقوا لينفق فلينفق"
  },
  {
    "root": "نفل",
    "words": "الأنفال نافلة"
  },
  {
    "root": "نفي",
    "words": "ينفوا"
  },
  {
    "root": "نقب",
    "words": "نقيبا نقبا فنقبوا"
  },
  {
    "root": "نقذ",
    "words": "فأنقذكم يستنقذوه ينقذون تنقذ"
  },
  {
    "root": "نقر",
    "words": "نقيرا نقر الناقور"
  },
  {
    "root": "نقص",
    "words": "ونقص ينقصوكم تنقصوا منقوص ننقصها ينقص تنقص انقص"
  },
  {
    "root": "نقض",
    "words": "ينقضون نقضهم تنقضوا نقضت أنقض"
  },
  {
    "root": "نقع",
    "words": "نقعا"
  },
  {
    "root": "نقم",
    "words": "انتقام تنقمون فينتقم تنقم فانتقمنا نقموا منتقمون انتقمنا"
  },
  {
    "root": "نكب",
    "words": "لنكبون مناكبها"
  },
  {
    "root": "نكث",
    "words": "ينكثون نكثوا أنكثا نكث ينكث"
  },
  {
    "root": "نكح",
    "words": "تنكحوا تنكح ينكحن النكاح فانكحوا نكح ينكح فانكحوهن تنكحوهن ينكحها وأنكحوا نكاحا أنكحك نكحتم يستنكحها"
  },
  {
    "root": "نكد",
    "words": "نكدا"
  },
  {
    "root": "نكر",
    "words": "المنكر منكر بالمنكر نكرهم منكرون ينكر منكرة ينكرونها والمنكر نكرا نكير نكروا أنكر تنكرون نكر منكرا"
  },
  {
    "root": "نكص",
    "words": "نكص تنكصون"
  },
  {
    "root": "نكف",
    "words": "يستنكف استنكفوا"
  },
  {
    "root": "نكل",
    "words": "نكلا تنكيلا أنكالا نكال"
  },
  {
    "root": "نمرق",
    "words": "ونمارق"
  },
  {
    "root": "نمل",
    "words": "الأنامل النمل نملة"
  },
  {
    "root": "نمم",
    "words": "بنميم"
  },
  {
    "root": "نهج",
    "words": "ومنهاجا"
  },
  {
    "root": "نهر",
    "words": "الأنهر والنهار بنهر النهار بالنهار نهارا وأنهرا تنهرهما نهرا والنهار أنهرا نهار أنهر وأنهر ونهر ونهارا تنهر"
  },
  {
    "root": "نهي",
    "words": "انتهوا فانتهى وينهون وتنهون تنهون نهوا ينهيهم ينتهوا يتناهون منتهون ينهون نهيت نهيكما أنهكما وينهيهم تنتهوا ينتهون والناهون أتنهىنا أنهيكم ننهك وينهى تنته النهى ونهوا تنهى وانه ينته المنتهى نهيكم فانتهوا ينهيكم ونهى منتهيها ينهى"
  },
  {
    "root": "نوأ",
    "words": "لتنوأ"
  },
  {
    "root": "نوب",
    "words": "منيب أنيب أناب منيبين وأناب منيبا وأنابوا وأنيبوا ينيب أنبنا"
  },
  {
    "root": "نوح",
    "words": "ونوحا نوح نوحا ينوح"
  },
  {
    "root": "نور",
    "words": "نارا بنورهم النار النور نار المنير نورا نور ونور والنور نوره فالنار ينار منير لنوره منيرا بنور والنار نورهم نوركم ونورهم نورنا"
  },
  {
    "root": "نوس",
    "words": "الناس للناس بالناس والناس"
  },
  {
    "root": "نوش",
    "words": "التناوش"
  },
  {
    "root": "نوص",
    "words": "مناص"
  },
  {
    "root": "نوق",
    "words": "ناقة الناقة"
  },
  {
    "root": "نوم",
    "words": "نوم نائمون منامك والنوم منامكم المنام منامها نومكم"
  },
  {
    "root": "نون",
    "words": "النون"
  },
  {
    "root": "نوي",
    "words": "والنوى"
  },
  {
    "root": "نيل",
    "words": "ينال تنالوا تناله ينالهم سينالهم ينالوا ينالون نيلا يناله"
  },
  {
    "root": "هؤلاء",
    "words": "وهؤلاء"
  },
  {
    "root": "ها",
    "words": "هاؤم"
  },
  {
    "root": "هات",
    "words": "هاتوا"
  },
  {
    "root": "هبط",
    "words": "اهبطوا يهبط فاهبط اهبط اهبطا"
  },
  {
    "root": "هبو",
    "words": "هباء"
  },
  {
    "root": "هجد",
    "words": "فتهجد"
  },
  {
    "root": "هجر",
    "words": "هاجروا واهجروهن يهاجروا فتهاجروا يهاجر مهاجرا وهاجروا المهجرين والمهجرين واهجرني تهجرون مهجورا مهاجر هاجرن هاجر مهجرت واهجرهم هجرا فاهجر"
  },
  {
    "root": "هجع",
    "words": "يهجعون"
  },
  {
    "root": "هدد",
    "words": "هدا"
  },
  {
    "root": "هدم",
    "words": "لهدمت"
  },
  {
    "root": "هدهد",
    "words": "الهدهد"
  },
  {
    "root": "هدي",
    "words": "اهدنا هدى بالهدى مهتدين ويهدي هداي تهتدون لمهتدون وهدى الهدى تهتدوا اهتدوا يهدى المهتدون والهدى يهتدون هديكم فهدى هديهم هديتنا ويهديكم أهدى ولهدينهم تهدوا ليهديهم ويهديهم هديا اهتديتم المهتدين هدينا يهدني هدىن مهتدون وهدينهم فبهديهم لتهتدوا بالمهتدين يهديه لهديكم هدىني لنهتدي يهد يهديهم وتهدي يهدون المهتدي هادي تهدي اهتدى يهتدي هاد لهدى هدنا لهدينكم لهديكم هديهم وهديه المهتد يهدين يهتدوا أهدك ويهديه وهدوا هديكم لهاد هاديا سيهدين بهدية بهديتكم أتهتدي يهديكم بهدي يهديني لنهدينهم بهد هديها اهتديت فاهدوهم وهدينهما واهدنا هدنا أهديكم أهدكم فهدينهم نهدي لتهدي بأهدى سيهديهم ويهديك مهتد يهدوننا هدينه وأهديك وهدينه للهدى"
  },
  {
    "root": "هرب",
    "words": "هربا"
  },
  {
    "root": "هرع",
    "words": "يهرعون"
  },
  {
    "root": "هروت",
    "words": "هروت"
  },
  {
    "root": "هرون",
    "words": "هرون وهرون يهرون"
  },
  {
    "root": "هزأ",
    "words": "مستهزؤن يستهزئ هزوا ويستهزأ يستهزؤن استهزئ استهزؤا تستهزؤن المستهزين يستهزؤن"
  },
  {
    "root": "هزز",
    "words": "وهزي اهتزت تهتز"
  },
  {
    "root": "هزل",
    "words": "بالهزل"
  },
  {
    "root": "هزم",
    "words": "فهزموهم مهزوم سيهزم"
  },
  {
    "root": "هشش",
    "words": "وأهش"
  },
  {
    "root": "هشم",
    "words": "هشيما كهشيم"
  },
  {
    "root": "هضم",
    "words": "هضما هضيم"
  },
  {
    "root": "هطع",
    "words": "مهطعين"
  },
  {
    "root": "هل",
    "words": "هل فهل وهل"
  },
  {
    "root": "هلع",
    "words": "هلوعا"
  },
  {
    "root": "هلك",
    "words": "التهلكة ويهلك فأهلكته هلك يهلك أهلكنا فأهلكنهم يهلكون مهلك أهلكنها أهلكتهم أتهلكنا مهلكهم أفتهلكنا ليهلك الهلكين لنهلكن نهلك مهلكوها أهلكنهم لمهلكهم وأهلكنا المهلكين مهلكي أهلك هالك مهلكوا فأهلكنا يهلكنا أهلكني فأهلكوا أهلكت"
  },
  {
    "root": "هلل",
    "words": "أهل الأهلة"
  },
  {
    "root": "هلم",
    "words": "هلم"
  },
  {
    "root": "همد",
    "words": "هامدة"
  },
  {
    "root": "همر",
    "words": "منهمر"
  },
  {
    "root": "همز",
    "words": "همزت هماز همزة"
  },
  {
    "root": "همس",
    "words": "همسا"
  },
  {
    "root": "همم",
    "words": "همت أهمتهم لهمت وهموا وهمت"
  },
  {
    "root": "همن",
    "words": "وهمن يهمن"
  },
  {
    "root": "هنأ",
    "words": "هنيا"
  },
  {
    "root": "هنا",
    "words": "هنالك ههنا"
  },
  {
    "root": "هو",
    "words": "هم فهم وهم هو وهو فهو هن وهي لهو هما وهن أفهم لهي أهم وهما هيه"
  },
  {
    "root": "هود",
    "words": "هادوا هودا هدنا يهود هود"
  },
  {
    "root": "هور",
    "words": "هار فانهار"
  },
  {
    "root": "هون",
    "words": "الهون هون هين يهن هينا هونا أهون"
  },
  {
    "root": "هوي",
    "words": "تهوى أهواءهم الهوى أهواء أهواءكم استهوته بأهوائهم هويه هواء هويه هوى أهوى هاوية"
  },
  {
    "root": "هي",
    "words": "هي فهي"
  },
  {
    "root": "هيأ",
    "words": "كهية وهيئ ويهيئ"
  },
  {
    "root": "هيت",
    "words": "هيت"
  },
  {
    "root": "هيج",
    "words": "يهيج"
  },
  {
    "root": "هيل",
    "words": "مهيلا"
  },
  {
    "root": "هيم",
    "words": "يهيمون الهيم"
  },
  {
    "root": "هيمن",
    "words": "ومهيمنا المهيمن"
  },
  {
    "root": "هيهات",
    "words": "هيهات"
  },
  {
    "root": "وأد",
    "words": "الموءدة"
  },
  {
    "root": "وأل",
    "words": "موئلا"
  },
  {
    "root": "وبر",
    "words": "وأوبارها"
  },
  {
    "root": "وبق",
    "words": "موبقا يوبقهن"
  },
  {
    "root": "وبل",
    "words": "وابل وبال وبيلا"
  },
  {
    "root": "وتد",
    "words": "الأوتاد أوتادا"
  },
  {
    "root": "وتر",
    "words": "يتركم والوتر"
  },
  {
    "root": "وتن",
    "words": "الوتين"
  },
  {
    "root": "وثق",
    "words": "ميثقه ميثقكم ميثق الوثقى ميثقا بميثقهم ميثقهم وميثقه واثقكم موثقا موثقهم الميثق الوثاق يوثق وثاقه"
  },
  {
    "root": "وثن",
    "words": "الأوثن أوثنا"
  },
  {
    "root": "وجب",
    "words": "وجبت"
  },
  {
    "root": "وجد",
    "words": "ولتجدنهم تجدوه يجد تجدوا تجد وجد لوجدوا يجدوا وجدتموهم ستجدون يجدون لتجدن ولتجدن وجدنا أجد وجدتم يجدونه وليجدوا وجدوا لأجد لأجدن ووجدوا فوجدا ستجدني وجدها ووجد نجد يجده وجدت وجدتها فوجد وجدنه وجدكم فوجدنها يجدك ووجدك"
  },
  {
    "root": "وجس",
    "words": "وأوجس فأوجس"
  },
  {
    "root": "وجف",
    "words": "أوجفتم واجفة"
  },
  {
    "root": "وجل",
    "words": "وجلت وجلون توجل وجلة"
  },
  {
    "root": "وجه",
    "words": "وجهه وجه وجهك وجوهكم وجهة وجهي وجيها وجوه وجوههم بوجوهكم وجوها وجهها وجهت يوجهه الوجوه توجه بوجهه ووجوه لوجه"
  },
  {
    "root": "وحد",
    "words": "وحد وحدا وحدة فوحدة وحده الوحد بوحدة لوحد وحيدا"
  },
  {
    "root": "وحش",
    "words": "الوحوش"
  },
  {
    "root": "وحى",
    "words": "نوحيه أوحينا وأوحينا أوحيت وأوحى يوحى أوحى يوح ليوحون ووحينا نوحيها نوحي فأوحى وحيه بالوحي فأوحينا وحيا فيوحي وحي"
  },
  {
    "root": "ودد",
    "words": "يود ود أيود تود ودت ودوا مودة وتودون ودود ودا يودوا المودة يوادون بالمودة وودوا الودود"
  },
  {
    "root": "ودع",
    "words": "ومستودع ومستودعها ودع ودعك يدع"
  },
  {
    "root": "ودق",
    "words": "الودق"
  },
  {
    "root": "ودي",
    "words": "ودية فدية واديا أودية بواد بالواد واد الواد أوديتهم"
  },
  {
    "root": "وذر",
    "words": "ويذرون وذروا ليذر فتذروها وذر ذرهم ونذرهم فذرهم ونذر فذروها أتذر ويذرك ويذرهم ذرنا فنذر فذروه فيذرها تذرني وتذرون ذروني ذرونا تذر فذرني تذرن تذرهم وذرني ذرني"
  },
  {
    "root": "ورث",
    "words": "الوارث ميرث وورثه يورث ترثوا يرثها أورثتموها يرثون يورثها وأورثنا ورثوا الورثون يرثني ويرث نرث نورث ونرثه الورثين وأورثنها ورثة وورث وأورثكم أورثنا أورثوا التراث"
  },
  {
    "root": "ورد",
    "words": "فأوردهم الورد المورود واردهم واردها وردا وردون وردوها ورد الوريد وردة"
  },
  {
    "root": "ورق",
    "words": "ورقة ورق بورقكم"
  },
  {
    "root": "وري",
    "words": "وراءه وراء ورائكم يوري فأوري وري وراءكم ورائه يتورى وراءهم وراءي ورائهم توارت ورائ تورون"
  },
  {
    "root": "وزر",
    "words": "أوزارهم يزرون تزر وازرة وزر أوزار وزيرا أوزارا وزرا أوزارها وزرك"
  },
  {
    "root": "وزع",
    "words": "يوزعون أوزعني"
  },
  {
    "root": "وزن",
    "words": "والميزان والوزن موزينه موزون وزنوا وزنا الموزين الميزان الوزن وزنوهم"
  },
  {
    "root": "وسط",
    "words": "وسطا الوسطى أوسط أوسطهم فوسطن"
  },
  {
    "root": "وسع",
    "words": "وسع وسعها الموسع سعة وسعة سعته وسعا وسعت والسعة لموسعون"
  },
  {
    "root": "وسق",
    "words": "وسق اتسق"
  },
  {
    "root": "وسل",
    "words": "الوسيلة"
  },
  {
    "root": "وسم",
    "words": "بسيمهم بسيميهم للمتوسمين سيماهم سنسمه"
  },
  {
    "root": "وسوس",
    "words": "فوسوس توسوس الوسواس يوسوس"
  },
  {
    "root": "وشي",
    "words": "شية"
  },
  {
    "root": "وصب",
    "words": "واصبا واصب"
  },
  {
    "root": "وصد",
    "words": "بالوصيد مؤصدة"
  },
  {
    "root": "وصف",
    "words": "يصفون وصفهم تصفون وتصف تصف"
  },
  {
    "root": "وصل",
    "words": "يوصل يصلون وصيلة يصل وصل وصلنا"
  },
  {
    "root": "وصي",
    "words": "ووصى الوصية موص وصية يوصيكم يوصى يوصين توصون وصينا وصيكم وأوصني ووصينا توصية وصى أتواصوا وتواصوا"
  },
  {
    "root": "وضع",
    "words": "وضعتها وضعت وضع مواضعه تضعوا ويضع ولأوضعوا ووضع ونضع وتضع تضعون يضعن تضع ووضعته وضعها موضوعة ووضعنا"
  },
  {
    "root": "وضن",
    "words": "موضونة"
  },
  {
    "root": "وطأ",
    "words": "ليواطؤا يطؤن موطئا تطؤها تطؤهم وطآ"
  },
  {
    "root": "وطر",
    "words": "وطرا"
  },
  {
    "root": "وطن",
    "words": "مواطن"
  },
  {
    "root": "وعد",
    "words": "وعدنا تواعدوهن يعدكم الميعاد وعده وعدتنا وعد يعدهم توعدون تعدنا ووعدنا تواعدتم الميعد وعدوه وعدا موعدة وعدها نعدهم الوعد موعده وعدك موعدهم وعيد وعدكم ووعدتكم لموعدهم وعدهم موعدا موعد يوعدون موعدكم ووعدنكم موعدي موعدك الوعيد أيعدكم وعدنه ميعاد يعد وعدتهم وعدنهم أتعدانني بالوعيد الموعود"
  },
  {
    "root": "وعظ",
    "words": "وموعظة يعظكم يوعظ موعظة فعظوهن وعظهم يوعظون تعظون أعظك والموعظة أوعظت الوعظين يعظه أعظكم توعظون"
  },
  {
    "root": "وعي",
    "words": "بأوعيتهم وعاء وتعيها وعية فأوعى يوعون"
  },
  {
    "root": "وفد",
    "words": "وفدا"
  },
  {
    "root": "وفر",
    "words": "موفورا"
  },
  {
    "root": "وفض",
    "words": "يوفضون"
  },
  {
    "root": "وفق",
    "words": "يوفق وتوفيقا توفيقي وفاقا"
  },
  {
    "root": "وفي",
    "words": "وأوفوا أوف والموفون يتوفون يوف توفى ووفيت متوفيك فيوفيهم أوفى توفون وتوفنا يتوفيهن توفيهم أوفوا توفيتني يتوفيكم توفته يتوفونهم فأوفوا يتوفى نتوفينك نوف لموفوهم ليوفينهم فأوف توفني يوفون تتوفيهم وتوفى وليوفوا يوفيهم فوفيه ليوفيهم يوفى وليوفيهم توفتهم وفى الأوفى يستوفون"
  },
  {
    "root": "وقب",
    "words": "وقب"
  },
  {
    "root": "وقت",
    "words": "موقيت موقوتا ميقت لميقتنا لوقتها الوقت لميقت ميقتهم أقتت ميقتا"
  },
  {
    "root": "وقد",
    "words": "استوقد وقودها وقود أوقدوا يوقدون يوقد فأوقد توقدون الوقود الموقدة"
  },
  {
    "root": "وقذ",
    "words": "والموقوذة"
  },
  {
    "root": "وقر",
    "words": "وقرا وقر وتوقروه وقارا"
  },
  {
    "root": "وقع",
    "words": "وقع يوقع فوقع واقع فقعوا مواقعوها تقع ووقع لوقع وقعت الواقعة لوقعتها بموقع"
  },
  {
    "root": "وقف",
    "words": "وقفوا موقوفون وقفوهم"
  },
  {
    "root": "وقى",
    "words": "تتقون واتقوا المتقين يتقون تقويهم"
  },
  {
    "root": "وقي",
    "words": "للمتقين فاتقوا فاتقون المتقون اتقى التقوى واتقون وقنا اتق اتقوا وتتقوا للتقوى وليتق تتقوا تقية واتقى تقاته بالمتقين فقنا فليتقوا والتقوى واتقوه ولتتقوا تقوى يتق واق تقيكم تقيا ويتقه اتقيتن واتق واتقين يتقي وقهم تق فوقه ووقيهم أتقيكم ووقيهم ووقينا يوق قوا فوقهم وتقويها الأتقى بالتقوى"
  },
  {
    "root": "وكأ",
    "words": "متكآ متكين أتوكؤا متكؤن متكين يتكؤن"
  },
  {
    "root": "وكد",
    "words": "توكيدها"
  },
  {
    "root": "وكز",
    "words": "فوكزه"
  },
  {
    "root": "وكل",
    "words": "فليتوكل فتوكل المتوكلين الوكيل وتوكل وكيلا فتوكلوا بوكيل وكلنا وكيل توكلنا يتوكلون يتوكل توكلت توكلوا المتوكلون نتوكل وكل"
  },
  {
    "root": "ولج",
    "words": "تولج وتولج يلج وليجة يولج ويولج"
  },
  {
    "root": "ولد",
    "words": "وبالولدين ولدا للولدين فللولدين والولدت أولدهن المولود ولدة بولدها مولود بولده أولدكم أولدهم ولد الولدان والولدن الولدن الولدين ولدتك وأولدكم وأولدا وأولدهم ءألد ولولدي والأولد وولدا بولديه بولدتي ولدت وليدا ولدي ولولديك والد ولده والده لولديه ولدن ولدنهم وولده يلدوا ووالد يلد يولد"
  },
  {
    "root": "ولي",
    "words": "توليتم ولى تولوا وليهم فلنولينك فول فولوا موليها تولى أولياؤهم وليه مولىنا يتولى أولياء أولى يولوكم وليهما موليكم أولياءه مولى وليا نوله يتولون يتولهم وليكم يتول الأولين موليهم أوليائهم نولي فتولى ولينا تولوهم يولهم لتولوا أولياؤه المولى وليتهم وليتم ويتولوا مولىنا لولوا يتولوا وتولوا يلونكم تتولوا وتولى وال موليه يتولونه لوليه ولوا لوليت الولية تولاه موليكم تول وموليكم أوليائكم يولون فتولوا فتول وتول تولون أولياؤكم الولي فأولى ويولون ليولن"
  },
  {
    "root": "وني",
    "words": "تنيا"
  },
  {
    "root": "وهب",
    "words": "وهب الوهاب هب ووهبنا فهب لأهب وهبنا فوهب وهبت يهب ويهب"
  },
  {
    "root": "وهج",
    "words": "وهاجا"
  },
  {
    "root": "وهن",
    "words": "تهنوا وهنوا موهن أوهن وهنا"
  },
  {
    "root": "وهي",
    "words": "واهية"
  },
  {
    "root": "وي",
    "words": "ويكأن ويكأنه"
  },
  {
    "root": "ويل",
    "words": "فويل وويل يويلتى يويلتنا ويلكم يويلنا الويل ويل ويلك"
  },
  {
    "root": "يأجوج",
    "words": "يأجوج"
  },
  {
    "root": "يأس",
    "words": "يئس ليوس استيسوا تايسوا يايس استيس يايس يوسا يئسوا فيوس يئسن"
  },
  {
    "root": "ياقوت",
    "words": "الياقوت"
  },
  {
    "root": "يبس",
    "words": "يابس يابست يبسا"
  },
  {
    "root": "يتم",
    "words": "واليتمى اليتمى يتمى لليتمى اليتيم يتيمين ويتيما يتيما"
  },
  {
    "root": "يحيى",
    "words": "بيحيى ويحيى يحيى ييحيى"
  },
  {
    "root": "يدي",
    "words": "يديها بأيديهم أيديهم يديه بأيديكم بيده بيدك يدي بيد أيديكم وأيديكم يدك أيديهما يد يداه يده أيد بأيدينا أيديهن أيدينا يداك وأيديهم أيدي الأيدي بيدي وأيدي بأيدي يدا"
  },
  {
    "root": "يس",
    "words": "يس"
  },
  {
    "root": "يسر",
    "words": "اليسر استيسر والميسر ميسرة يسيرا يسير ميسورا يسرا يسرنه ويسر يسرنا تيسر يسره ونيسرك لليسرى فسنيسره"
  },
  {
    "root": "يعقوب",
    "words": "ويعقوب يعقوب"
  },
  {
    "root": "يقظ",
    "words": "أيقاظا"
  },
  {
    "root": "يقن",
    "words": "يوقنون يقينا الموقنين توقنون اليقين موقنين واستيقنتها يقين موقنون بمستيقنين للموقنين ليستيقن"
  },
  {
    "root": "يمم",
    "words": "تيمموا فتيمموا اليم"
  },
  {
    "root": "يمن",
    "words": "لأيمنكم أيمنكم وأيمنهم أيمنهم الأيمن أيمن اليمين بيمينه بيمينك يمينك أيمنهن يمين باليمين الميمنة وبأيمنهم"
  },
  {
    "root": "ينع",
    "words": "وينعه"
  },
  {
    "root": "يوسف",
    "words": "ويوسف يوسف ليوسف بيوسف"
  },
  {
    "root": "يوم",
    "words": "يوم وباليوم يوما واليوم أياما ويوم أيام يومين اليوم ليوم الأيام يومئذ باليوم يومكم فاليوم يومهم بأيىم ويومئذ فيومئذ وأياما بيوم"
  },
  {
    "root": "يونس",
    "words": "ويونس يونس"
  }
]