// This is a sanitize service to adhere to the Quran Othmani text
module.exports = function Sanatize(sentence) {
  const replacements = {
    يء: "ي",
    ءا: "آ",
    ويءادم: "ويآدم",
    يادم: "يآدم",
    ءادم: "آدم",
    لءآدم: "لآدم",
    رآ: "رءا",
    تبوآ: "تبوءا",
    جزآ: "جزءا",
    ورآ: "ورءا",
    ترآ: "ترءا",
    سوآ: "سوءا",
    ردآ: "ردءا",
    يستء: "يست",
    الءن: "الن",
    ألءن: "ألن",
    آلءن: "آلن",
    لءي: "لي",
    لءو: "لو",
    بءو: "بؤ",
    سءو: "سؤ",
    كءو: "كؤ",
    هءو: "هؤ",
    فءو: "فؤ",
    زءو: "زؤ",
    نءو: "نؤ",
    تءو: "تؤ",
    طءو: "طؤ",
    كءي: "كي",
    زءي: "زي",
    سءي: "سي",
    بءي: "بي",
    سء: "س",
    ىه: "يه",
    ىل: "يل",
    ىك: "يك",
    ىة: "ية",
    تىن: "تين",
    أفءدة: "أفدة",
    والأفءدة: "والأفدة",
    أنجىنا: "أنجينا",
    أفءدتهم: "أفدتهم",
    تجءرون: "تجرون",
    المستءخرين: "المستخرين",
    شطءه: "شطه",
    استءذن: "استذن",
    استءذنوك: "استذنوك",
    ووقىنا: "ووقينا",
    لخطءين: "لخطين",
    يجءرون: "يجرون",
    جءروا: "جروا",
    قرءان: "قرآن",
  };

  return sentence
    .split(" ")
    .map((text) => {
      for (const [key, value] of Object.entries(replacements)) {
        text = text.replace(new RegExp(key, "g"), value);
      }
      return text;
    })
    .join(" ");
};

// console.log(Sanatize('ولئن أتيت الذين أوتوا الكتٰب بكل ءاية ما تبعوا قبلتك وما أنت بتابع قبلتهم وما بعضهم بتابع قبلة بعض ولئن اتبعت أهواءهم من بعد ما جاءك من العلم إنك إذا لمن الظٰلمين'))
